{
  "search_query": "iPhone XS Max",
  "total_reviews": 146,
  "Overall_rating": "4.6",
  "Total_ratings": "1,451 Ratings &",
  "reviews": [
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Best iphone I have used till now .. good update from my previous iPhone 6s Plus"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "pretty good phone , camera quality is outstanding but battery is still poor ! takes 2 hours + to get fully charge !\nrest everything is good ! :)"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Very Nice"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Have been using 5s for the past 4 years and finally decided to upgrade to XS Max, Inspite of the big size it still feels so convenient due to its brilliant structure and no doubt it provides a superior performance based on every aspect.\nThe Gold variant definitely gives an elegant feel when you hold it, though it would have been great if apple included a fast charger considering the price tag.\nAlso, a special thanks to Flipkart for a quick delivery!"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Best iphone yet"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "The product is amazing. Only thing Flipkart could have done better was the packaging of the product as it’s an electronic item and has to be handled with care. There should be an extra box, but anyway got the mobile phone in the best condition possible."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Best phone in year of 2018 👌🏻👍👍👍👍🤫"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Flipkart service is very good . Today I got delivery of my replacement apple xs max phone. Phone is very good with fantastic battery backup. And you know apple phones are status symbol and not value for money . And Flipkart helps me a lot in replacement. Thanks Flipkart team 👍👍👍"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Best phone in my budget!!! Happy with the purchase previously was using Samsung S7 and I have to say this phone really amazes me and it never lags or anything. This is my 5th iPhone though! Really Looking forward for iPhones from now on"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "It's a good option if you want to buy into the iOS ecosystem and currently using an Android or an iPhone 7 or below.\n\nDont think it's worth upgrading from an X. The display is amazing and the gestures work beautifully. But just a heads up the eSim service is not available at Jio yet at the time this review is being written. So you will be using a single sim for some time now.\n\nIf you are used to a bigger 6.5\" display this makes more sense than the XS. When it comes to value for money, apple ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Upgraded from iPhone 7\nWay ahead of iPhone 7.\n\nGot silver xs max 64\nWanted to get 256 GB but it costmore.\nConfused b/w xs 256 and this, I preferred display size to memory and satisfied after purchase.\n\nPros:\n\n1. bigger screen, looks big, but u will like its display size. Xs is very small. This one is best in class.\n2. The phone is premium, steel side, glass back is amazing.\n3. Although I have put on a tough case, but the raw one is very kool.\n4. It’s a small tablet.\n5. Face unlock is good, ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Awesome mobile git it for 70k 256gb ,worth for each penny"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Great phone to have.. just have issue with slow charging.. rest everything is awesome.. loving it :)"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "a very nice phone having a good camera...purely flagship phone..."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "I switched over from pixel 2 xl and i don't feel that disappointed. Camera on pixel 2 is still better when it comes to low light but this phone is such a beast when comes to performance."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Awesome. So premium look and nice features. Flipkart services always good. It was not available to buy between 25 Oct to 4 Nov then I contacted to customer care and they help me for availability this product. Nice phone If you are iPhone user."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Fast delivery and good deal\nThanks FLIPKART"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Awesome phone to have"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "I brought this phone in the month of September 2018. I am big fan of apple iPhone since from iPhone 5s to XS Max I love the designs and right now I am using the public beta of iOS 14. Battery is good"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Best Phone ever.. iPhone over done it again, it was a gift for my sister and she is very happy with it."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "In love with my phone. It’s a heavenly feeling when we watch any video."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Very nice product"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "It’s iPhone what else is there to say.The most heavily reviewed phone in the market, you know what you’re getting.After the iOS 13 update , the phone brings out a lot a of features previously people asked for. Dark mode is 🔥🔥 . But there are cons too. Storage being the biggest of them. iCloud is expensive and needs WiFi . Miss my SD card ...lol."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "I love it both Flipkart and apple"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Reached in time"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Great Product Wonderful superb experience. Thank you Flipkart for superfast delivery."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Finally an iPhone with more than 3000 mah battery!\nI moved from iPhone X to xs max and I don’t regret it.\n\nNot as bulky as it may sound (6.5 inch screen) ."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Gives a premium feel when in hand , Quite reliable at times than the phones that claim to be flagships of some companies that run using Android. It may take some time to adjust to the iOS if you’re using it for the first time.\nIf you ask me an opinion to buy this ,\nMy answer would be :\nOh Hell Yeah!"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "legend as always"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Recieved on 13th November. I am writing this after 1 month usage. This is my first iOS mobile.Excellent mobile in the market.After updating to 12.1 iOS,I am using two SIMs. No negatives till now. Outstanding potraite photos"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Awesome camera, stability and battery. Apple phones anyway possess great show off value and decent ecosystem."
    },
    {
      "User_Rating": "5",
      "Title": "Superb Apple",
      "Comment": "Nothing to take this to next level. This is just perfect. 6.5” can get people used to the size pretty fast. Weight balance makes it easier to handle through the day. Camera is super duper with incredible dynamic range and HDR."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "I bought for 70k at that price this is very nice apple product"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Outstanding"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Most amazing I Phone till date from Apple.\nHave always been a loyal Apple user but just loved this new phone.\nI trusted Flipkart to buy this expensive phone & they fully justified my faith by sending genuine product before the scheduled delivery date.\nThanks so much Flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Happy with the phone."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Awesome ..totally satisfied and nice service by flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Very Very Good"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Although it’s pretty expensive, but the phone is superb without a doubt ! Battery life is amazing, and actually u don’t need to spell out the great stuff which apple makes coz everything is top of the line !!"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "A beautiful designed phone ..Apple has to look into pricing of the their products ..They are overpriced and becomes more costly once they are In India\nNo doubt quality of the products is 10/10."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Upgraded from X, this phone is giving me new level of experience than X\nAwesome display\nGood battery\nButtery smooth OS\nMind blowing performance\nU will not regret after buying this costly phone\nAs far as price is concern, common better things come with better price"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Better than 11pro max 256 GB for the price."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Awesome phone I finally switch from android to iPhone and the experience is great. I’m loving it ?"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "nice 1"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "For show off apple phone is ok but if we will talk about features than any android phone is better than I phone"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Awesome and high quality product. Superior to all other phones. Big screen give a amazing experience. Very good for eye health, no strain even after using for hours."
    },
    {
      "User_Rating": "5",
      "Title": "Worth the money",
      "Comment": "Awesome product"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "People thinks it is costly .... indeed ,, but exclusivity comes under cost . By far this is the most exclusive phone to carry with. Every feature is unmatchable(MI, vivo , oppo , lenovo just stay away????) u will feel the power of this phone once it comes in ur hands"
    },
    {
      "User_Rating": "5",
      "Title": "Best iPhone Ever!!!",
      "Comment": "Yes this is beast in performance! Beautiful, elegant, premium iPhone ever made. Yes agree its very very expensive in comparison. But if you keep price aside for a moment, then whatever you get is best in the industry. I have been iPhone user for 10 years now and this is one of the best ever made as they advertise.Day to day perfromance - opening apps, multitasking etc is impressive.No Lags at all. No hang. Of course nobody talks about hanging when you talk about iPhones. Games run smoothly if...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "What a masterpiece. Upgraded from x to xs max. Simply in love with the gold colour.\n\nBattery wise there is a lot of improvement and camera is simply fab.\n\nOverall happy happy.\n\nAfter all if you don’t have an iPhone then you don’t have an iPhone."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Wow it’s awesome looking so gorgeous and the performance of this mobile is soo good"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "One of the best smartphone I've ever used ❤️❤️🤩🤩😍"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "A phone with sexy combination of superb camera and gaint storage capacity"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Nithing like this one. Better bigger smoother, faster and efficient then ever"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "It is a good phone but the price is too high and the charger is too slow and the other box components too."
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "the phone is really excellent"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "The specs are great and the feel of a premium phone is very much there. The only issue I faced was that the phone doesn’t come with a fast charger in the box and it takes too long to get charged up using the charger in the box. That’s it, otherwise the phone is good."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Reviewing after two months of use.\nPhone is good, perfectly working, Best Rear camera , good look and design. Good sound quality. Good at Rs.110k.\nWorst thing is front camera, I give 1 * out of 5 for front camera.\nIt was delivered in sealed packed condition and there is no issue with this phone. Working perfectly with fast charger."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "All are excellent but heating problems."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Best in class! Butter smooth performance, solid camera, great premium build and finish and excellent display. OLED definitely beats LCD with its high contrast and deep blacks.\nBuyers should go for XR if display is not the main thing they are looking in a iPhone. Go for this one only of you want the best and money is not an issue.\nOnly drawbacks are price and lack of fast charger and headphone dongle.\nRecommended only to people with hefty pockets and for those who are already deep in the app...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "# some thing need to review and write it on online means ,then it must be apple product especially in cell phones !\n\nAmazing and mind blowing performance\n,I was last used is 7 plus and gave it to my wife and I bought s8+ . No matter what Apple is Apple I must say , coming to camera I don’t have words to tell ,battery back up No 1 position secured in you tube video compared with note 9 (4000 mah ) pixel XL 3 (3430 mah) Sony z3 (3500 mah ) and iPhone 3134 mah and still won with lesser capa...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Awe stuck with XS Max",
      "Comment": "Apple products are class apart its proved once again. Looks like a jewel in hand with the gold color and camera is awesome night shots class apart dont have second thoughts go for the best in class"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Don’t read reviews to purchase this XS Max.this phone is beyond to limitations and once you feel it you forgot the words.\nIf you are first time iPhone user than this is the best time to get this one with duel sim ,big display and big big battery."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Best phone ever"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Excellent"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "The best out there. Period."
    },
    {
      "User_Rating": "5",
      "Title": "Beast but hate the front camera (below average)",
      "Comment": "No other phone come close to iphone xs max! Camera is superb, face id is slight better than iphone x, stronger than iphone x, works like a charm and looks are to die for and the gold colour exceptionally beautiful but the front camera is something i hate the most about the beautiful phone it has some kind of beauty mode and it makes your face kinda blurry as well!"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Master phone. Incredible!!"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Loved it....."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Good value for money."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "phone is good but flipkart packing not good"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "One of the best phone that I ever had"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Awasome phone by apple and surprize price by flipkart so so perfect...all feature are perfect for me..superb mobile with superb feture..."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Fantastic phone. Felt a bit heavy, otherwise one of the best phones in the market ."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "so good"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "excellent display and touch, some cool features in camera.superb built quality. nice gadget to have but it is too pricey comparing the others in market."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "I mean iPhone is iPhone. Just use it. And thanks to flipkart for considerable discount and prompt service."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "love itttttttt"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Superb phone...I love it"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Such a beauty. I love the size which is equal to my other phone 7 plus but looks bigger due to no borders amd home button. If you’re looking for best mobile in the market then go for it. Flipkart delivered it in 2-3 days and I would say great experience with Flipkart for buying mobile first time online and Big Billion sale made it easy and real. Thanks Flipkart for such great offer."
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Amazing phone. Awesome battery.Great display and great delivery by Flipkart scheduled to deliver on Monday but got it on Saturday itself.But price in India is crazy,Apple really needs to look into it before it becomes too late.With every year and every phone if this continue to happen even the apple loyalist will start thinking is it worth it."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Best thing Apple has launched so far"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Great product, wonderful delivery experience."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "As promised a great product."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "I got the phone on launch day and am now using it for more than a month. This is the only phone I use. I am enjoying my experience with this phone, nothing to complain whatsoever. The phone is quite huge though, so makes it tough for single handed use sometimes. Also if you are going to add a case to it please ensure it’s lightweight and not bulky else your handling experience might worsen."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "The best phone ever!!"
    },
    {
      "User_Rating": "4",
      "Title": "AWESOME PHONE, but its very expensive",
      "Comment": "so phone undoubtedly the best, however there is only one issue which is network connectivity.\n1. Camera: classic, incomparable.\n2. Speed: what to say in this segment, did not find any lagging\n3. network connectivity: ok this is the only segment which has huge issue. E-Sim not working properly. so dual sim feature is dicey in iphone\n4. rest is awesomely great....:-)"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "fast delivery. great mobile. now with double SIM"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Recently upgraded from X to XS Max, really loving the huge, vibrant, colourful Super Retina display. Every time I look at that beautiful display and golden glass back, I fall in love love with it again. It looks amazing with the Spigen ultra hybrid crystal clear case.♥️♥️"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "very nice"
    },
    {
      "User_Rating": "4",
      "Title": "Classy Product With Premium Price",
      "Comment": "the phone in damn cool, classy product from apple and the biggest iphone ever and my first iphone too... really happy to be a part of ios family.\n\nPros -\n1. Its the Best looking phone\n2. Best display ever on a smartphone\n3. Sound quailty is awesome\n4. ios 12 makes it more powerful and smooth\n5. A powerful Device\n6. Camera is way to good..\n\nCons -\n1. Front camera is not too good\n2. can't do video call with jio ..\n3. too much costly\n4. many restrictions with app store"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "excellent finish and performance but a bit costly than other good brands"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Excellent phone i have ordered paying with huge discount today is 27-9-19 still i dont got any problm thanks Flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Awesome phone"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Excellent"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "product is excellent.\nflipkart service for exchange is poor."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Worth Buying...... Damn Fast performance"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "The first thing that catches the eye is that stunning gold colour with that humongous display. Yet it feels so comfortable in the hand. A really good phone in every aspect. Really smooth and luxurious"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Quality service"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Delivered before time. Ausome product."
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Awsome device. Except for the fact that they give you less for the money (3.5 mm dongle, and a fast charger) everything else is great, so far."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Performance is too good"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Thanks flipkart for delivering iphone in good order. I got iphone xs max 256 gb silver at 110000 in offer. Cheaper than in Europe.."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Absolute stunner. Apple has done it again. Feels so premium"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "nice phone display quality awesome, camera quality nice. costly phone I phone only gives normal charger full charge complete 2 hours above. and esim not available in India only use single sim."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Fantastic and best machine and best answer to china android phones, who just target only hardware configuration selling"
    },
    {
      "User_Rating": "3",
      "Title": "Good",
      "Comment": "It’s regarding the price and low light camera and remaing things are just awesome in this device"
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "there is no call recording in iphone and ..whatsup pictures and mobile camera pictures are savings in same gallery .the two falts only .. otherwise all good"
    },
    {
      "User_Rating": "1",
      "Title": "Did not meet expectations",
      "Comment": "Camera is blurry"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Good performance."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Got my phone in 2 days.. Everything is working properly no issues at all"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Just wow!!!"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Awsome... upgraded from 6s ..... Silver Color is goid compare to gold... go for it"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "good"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Just Awesome"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "good but phone was switched on in box"
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Phone is awesome..😍\nLittle unhappy by the delayed delivery"
    },
    {
      "User_Rating": "1",
      "Title": "Did not meet expectations",
      "Comment": "incorrect model provided, it Is not an indian version as mentioned in the description"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "One of best iphone model till date and value for money"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Great phone for great people"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "very good"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Nice product"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Just wow\nNo phone can beat it"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Quality product which will last for atleast 5years with proper maintenance.\nThank you Flipkart for selling me on offer. Im sure that my phone box is opened before my purchase. Please avoid that."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Product though received 3 days late was received in good packaging"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Simply outstanding. I have upgraded from 7 plus and its a significant upgrade. Gold colour looks very premium"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Its just wow.i love its camera."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Awesome phone with dual sim. 5 star for portrait mode."
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "loved it\nbut it can be more better"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "the most advanced mobile. Best phone ever"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Awesome value for proposition piece. Worth the price 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Nice deal by Flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "excellent little bit heavy"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Good device by Apple...too expensive in India!"
    },
    {
      "User_Rating": "1",
      "Title": "Utterly Disappointed",
      "Comment": "Battery heating problem. Would suggest you. It to buy online"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "I love it but very costly"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "tremendous phone.I thanks to Flipkart to get me this beautiful iPhone on time.I also thanks to the seller SUPERCOMNET for its Superfast and priority delevery through Flipkart.Love you Flipkart."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "excellent product only apple box is not sealed. But the handset is new/never activated."
    },
    {
      "User_Rating": "5",
      "Title": "Apple I-Phone XS Max",
      "Comment": "Very satisfied with the item and thanks for the fast delivery."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "FANTABULOUS!!"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Flagship phone !!"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Thankyou Flipkart for delivery before time."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Wowww.... Phone is just amazing, It feels premium in hand and superb build quality.\nCamera is good, performance is smooth, good battery life at least from previous models, doesn’t feel too heavy in hand, iOS is jus nothing better than this.\nThe only con I can say is price, it doesn’t justify the price to value ratio. Lil too costly in India as compared with other countries.\nIf u can spill out this amount just buy it u will love it.."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "fantastic"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "excellent"
    }
  ]
}