{
  "search_query": "iPhone XS",
  "total_reviews": 363,
  "Overall_rating": "4.7",
  "Total_ratings": "11,941 Ratings &",
  "reviews": [
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Nice one 🥳🧡"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Value for money"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Got an amazing deal for this phone!!!\nThank you flipkart! Only thing which can improve is quick delivery time\nOverall I got the best phone at an unbeatable price!"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Excellent"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "A awesome phone in this butget . camera is awesome . it is a beast"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "More good iphone at price of 53k and after 1 year also I cannot see any lag very good phone go for it eyes closed"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "I am a iPhone lover & I really my iPhone within time and good quality... I appreciate the @TrueCom Seller and Flipkart... 🥰"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "A awesome phone, camera is awesome. Best"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Genuine Apple product! Loved it. And Delivery was also fast. Best phone from flipkart!"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "The iPhone XS has a markedly improved dual camera, delivering better photos than the iPhone X in both dark and high-contrast environments. It has a faster processor, faster face ID, adds dual-SIM support.\nFeels pretty solid and premium."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "I’m thrilled by this purchase. Great product at great prices. Gonna thank Flipkart for that, it was an amazing offer. I’d an iPhone X earlier need an upgrade this was good deal.Apple Performance is truly mesmerising & I love it. But battery is still a one day. Thank you."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "More good iphone at price of 53k and after 1 year also I cannot see any lag very good phone go for it eyes closed"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "best and perfect camera quality"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Superb upgrade. Went over from iphone 6 to XS, my world flipped upside down. Go for it!"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Camera quality A1, Smoothly working like Makkhan. Video Quality is supper both Day & night"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "On wifi net 2 days backup nice phone"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Fantastic product at the price range 50-55k\nreally amazing build quality and size of the product is much better then other iPhones."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "best got it for 48500/- thanks Flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Beat phone in best range"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Satisfied"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "I ordered this phone during flipkart sale and this phone is absolutely amazing\nnow people ask why should we buy iPhone xs when iPhone 11 is available in similar price, following is the reason ,\niPhone xs has OLED display which makes huge difference in images! (Iphone 11 has LCD display which is not good at all)\nImage resolution is better in iPhone XS!\nThe most important thing is the premium feel that we get in iPhone XS due to its stainless steel body and not like aluminium used in iPhone 11!"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Premium phone...\nCamera Is Awesome like a DSLR\nBetter than iPhone 11"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Very handy and sleek style. Awesome display quality with best operating system"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "It’s really awesome\nCamera is like DSLR\n1/2 day battery life its really good\nFace unlock very fast\n☺️☺️😎\nThanks to Flipkart 😎😎for providing me this iPhone"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Awesome working processor"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Best Buy in Republic Day sale\nWorth every penny 😎"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Excellent mobile upgrade iPhone 6s to xs good performance thank you flipkart!"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "This is my first iPhone. Till now I used some android phone. Comparatively I feel Android phone is better as per battery, user friendly, apps and lot more. I didn’t find any extra features or other useful thing in iPhone.\nLook wise also. Specially I feel battery drain is too fast in iPhone which is very important to focus."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "This is my dream mobile.\n*original product\n*mass looking\n*mass display\n*Decent battery backup\n*powerful processor delivery very smooth performance(I’ll never seen in any other mobile)\n*No heating issues while charging and working time\n*good sound quality\n*compact design\n*No one can beat the apple benchmark,hardware and performance\n*camera take very very high quality pictures in normal lighting condition.but need to improve low light images.poor quality at low light"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Best phone in the segment. Worthy in price 50k."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Value of the money .... excellent recommendations by flipkart .....thank you flipkart for your quick service , yoiur recommendations and also thank you for your easy and convenient services ."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Excellent as always❤️❤️❤️❤️❤️❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Best phone in the world\nAnd best in performance\nThanks Flipcart this phone❤️❤️❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Excellent mobile with premium quality. I chose this over iPhone 11 because of the screen and premium looks as I Got it for 53k in a sale. iPhones usually lasts long compared to android. So buy it without any doubt."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Waited for the price drop after iPhone 11 launch. But the Xs is unavailable and mostly sold out. Glad that I could grab the device."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Awesome phone :) :) It's my first apple product. Simply superb. Camera is amazing and overall very good product. Thanks to flipkart for a quick delivery :)"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Excellent\nAwesome\nTerrific"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "It is super phone but little heating while charging and while using long time also heat a bit and night mode camera little disturb the eyes clarity, otherwise no phones beats this iphone xs and Very thanks to Flipkart to given this phone with best Offers & Discounts and also saying thanks for seller of SuperComNet to given genuine apple iphone xs as well."
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "Flipkart’s delivery was really bad...i got the delivery late and their customer support is not that good..on the other hand phone is very good if you already have fast charger with you otherwise it will take more than 3 hrs to fully charge other than that phone is great and do get yourself airpods as well"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Got this for the price of a XR. OVERALL ITS A FLAGSHIP BUILD QUALITY. IF YOU ARE NOT TOO MUCH OBCESSED WITH THE IPHONE 11 CAMERA AND POCKETIBLITY AND SUPER BUILD IS YOUR THING GO FOR THIS. CAMERA IS REALLY GOOD BUT YOU WILL MISS THE WIDE ANGLE LENS.\nMy personal choice was a phone which would easily fit into my hand and my pocket. 11 pro was out of my budget. I had to compare between iphone 11 and iphone xs. Xs was bit cheaper and smaller did fit into my budget. This had 3d touch and amole...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Super phone nice camera and super fast phone made by apple . Best is eSIM"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "One Of the Best iPhone"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Got in 50k..\nBest iphone at really good price..\nCamera is far better than my previous samsung note 9..\nDon't follow youtubers review this phone will never disappoint you..."
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Pros\n1. That premium feeling of iPhone XS is awesome\n2.camera is very good in day light and in artificial blue lights like office and stores light.\n3.Touch screen very smooth like feather\n4.Decent battery , with normal days usage after 100%. Charge in the morning 25% remains by the time i charge again. I use 24/7 internet on, lots of whats app and facebook , browsing. Note : i turned off face id.\n5.Display is very nice, better than iPhone11 .\n\nCons.\n1. In low light - camera is worst. Cann...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "I’ve been using iPhone since 2016, got the 6s model and it made me fall in love with it. Recently, due to high prices and less features, I tried migrating to Android and got the S10e but started hating as soon as I realised that I’m being fond of iOS ecosystem now.\nFinally Got this iPhone XS in a great price which seems to be an amazing deal for an Apple Premium Device, absolutely loving the screen, camera, performance as of now. Only concern is Battery life that could’ve been better, else t...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "So nice"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Awesome phone 😍❤️ 🔥🔥"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Superb Gadget ✌🏻"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Phone is good but it’s quite expensive."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "This is the best deal I have got so far on Flipkart! Thanks for the timely delivery and this iPhone, it works wonder , before it I owned an iPhone XR that’s an awesome device too but this is light weight and is better in many ways apart from battery , but it sustains the whole day ! Overall it’s a beast! I bought it for 54999/- without any other deals\nThanks to the delivery team for the timely delivery n Flipkart for this irresistible deal ! Enclosed are pics clicked by this Xs Gold variant"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Graet phone. Camera, touch , performance wise there is no comparison with other phone. But battery backup is so less and apple still using that old 5 Watt charger which takes lot of time to charge."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Got it during Republic Day sale .This is my first iPhone and it’s amazing in-terms of quality and performance. Lacks night mode in camera which would have made this phone even more competitive. Battery life is okay it’s because of it’s LED display which is just awesome. Handy phone at 5.8” fullscreen display for one hand operations. Premium build and feel. Touch is simply unmatched to any-other brands it just flows. It come with a 5W charger which will take more than 2 hours to charge to 100%...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Great product go"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "iPhone XS in this price range is great.\nSome ppl will prefer iphone 11 over this due its battery & latest chip.\nBut XS is almost equal in performance with 11 & i will always prefer a less bezel oled display. Size of XS is just perfect for short hand ppl. 👍"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Worth for spending money\nIt is equivalent to 11 pro\nBattery last upto one day"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Bought this phone in 2020. It’s an awesome value for money phone and had made me happy in every way possible."
    },
    {
      "User_Rating": "5",
      "Title": "Great services 😊",
      "Comment": "As i ordered my phone on 26th march but due to lockdown it took nearly two months as i got on 20th may, but inspite of these hurdles.. They comminicated well and at ladt i got the phone in an amazing condition without any damage to box too.. !\nI am extremely happy as it was my first time to order phone on flipkart."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "After about six months of ownership, and thorough usage during the lockdown, the following observations have been made:\n\n1. All hardware materials are built to last long except the battery.\n\n2. Wireless charging is a needlessly heat generating process. More show than go. Also device heats up during movie downloads.\n\n3. Expensive but got it for 48k in a nice deal fron Flipkart.\n\n4. Battery peak charging capability is about 93% in a few months. Really?\n\n5. No real competitor with better value a...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "First of all,thanks to flipkart for providing me the original product of apple.\nComing to mobile,\nCamera is excellent on daytime,it was ok on nyt\nProcessor is excellent\nBattery is good for non-gamers\nSound is also good\nOLED display makes a huge difference from iphone 11,thats why i prefered XS over 11\nI was using iphone 6s and it is an excellent upgrade for me\nWorth waiting for 1month since i ordered.\nThank you TruecomRetail and Flipkart."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Positives- Superb Potrait Mode, 4K front camera video recording, Steel body, Perfect handling, Dolby sound with Speaker on top as well.\n\nNothing as such negative but was expecting at least a adapter with high power instead of 5V adapter."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "It's been a whole day and still phone is on. Battery is really improved. And Camera quality is really Awesome. But price is really not worth it. I recommend it 5 star because of its Appearance. Good phone."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Replaced with my IPhone-7 and let me tell you the positives first; Battery life, there’s a significant improvement 100%-0% took 8 hrs compared to IPhone-7s 4 hrs. Was little difficult initially without the Home button but that gave more screen space.. really loved it!! Better Camera, processor are the other positives.. THE BRAND NEW IPHONEXS ALSO HEATING UP WHILE CHARGING... like old models.. tad disappointed due to this.."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "First of all I would like to Thanks #Flipkart & #Mastercard for giving me such a wonderful Diwali gift as a part of MasterStroke Contest.\n\nThis latest product from Apple is no doubt a value for money. Its specifications may not be that much on the higher side as compared to other low budget Chinese Phones, but it gives you more than what is says. The 12MP + 12MP dual rear camera gives you a DSLR type photos. In low light also the quality of the pics are quite good as it has quad LED Flash Li...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "thank you flipkart to given me the opportunity buy new iPhone"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Well performance,good looking,loved it"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Amazing phone..handy phone..best phone ever from iphone"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "I have i phone 11 and now this xs i can clearly say the build and disply is far better than 11 .....its too good ...no one can beat iphones"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "From SE 16GB to XS 64GB\n\nTremendous Move\n\nBest Of IPhone\n\nPeople who know me asked why you chose XS instead of 11\n\nThe reason is\n\nBetter Build Quality\n\nBetter Display\n\nBetter Compactness and Handiness\n\nThere’s Only Few Changes From 11Pro to XS Nothing Much\n\nBut It’s IPhone"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Just awesome...best phone..."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "I bought this iphone on flipkart shopping days, and I received the product on discounted price, I feel very good once I was able to place the order, because the moment I place the order I saw after some time product was out of stock. this phone is superb, I m upgrading from iphone 7 so feeling very good and nice enhancements."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "I ordered 2 iPhones and this is the best gadget. Go for it...."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Nothing much to say explicitly, i was using oneplus but now when i have got this beast i can feel the difference easily. Fabulous phone"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Battery itself take 3+ hours to get full which becomes task in itself especially when all world is moved to fast charging"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "A very Satisfactory purchase, Thanks to Flipkart for Such Great Offer.\nTo Sum it up, Apple is Something which one can't compare to others at all.\nGreat Battery, Best cameras, Sound and Display is Awesome and rest is Also Best in class.\n\n10/10 in short."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Very best phone amazing delivery within 24 hours thankyou flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "A phone with all features pro camera pro screen pro design true flagship is here battery backup also too good"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Best in this price! I got this model in 60k"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Excellent"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "No words to say simply awesome and my smiley picture on phone says how am feeling after getting iPhone for the first time"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Very good"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "excellent product . delivered 2 days before excepted delivery date."
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Good, have been using it for 5 months.\nOverall ok product but I do have issues with network. Looks like it can be a phone problem. Am still trying to figure out."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Amazing camera"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Awesome mobile... battery will last up to 1 and half a day for an average usage and will last for a day for moderate usage. With 12w Apple adapter charging is very easy and very fast(1.45 to 2 hrs). In my point it’s worth because it’s performance"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Nice"
    },
    {
      "User_Rating": "5",
      "Title": "MAITRA",
      "Comment": "Fine"
    },
    {
      "User_Rating": "5",
      "Title": "Delivery",
      "Comment": "Nice work by flipkart and also very nice phone"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "It's camera is very nice."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Amazing!!\nNo words, its a beast, stole it at rock bottom Price of 48,500. Thanks to Flipkart and team. You rocks"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Unbelievable deal\n\nLove everything About the phone thank you flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Super"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "glad to see that it comes with pre installed ios 13\nno heating issue on ist day usage.awesome build quality.look premium in hand"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "superb retina display awsme performnce a beast from apple face id works superb"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "It was my first iPhone bought on my own.Just enjoying the display and the camera. They are just awesome. The e sim is a major improvement .Highly recommended for those who want an upgrade to their phones and haven’t already bought an iPhone X."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Awesome photography im happy with it"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Brilliant product"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Writing review after 4 months of use —\nSuperb picture quality, sdr is working fine , video quality is superb, best camera, no makeover like other cameras do.—/ super autofocus\n\nBattery— 24 hrs —-/ my screen usage time more than 4-5 hrs daily\n\nPerformance/-/ nothing to say much , you can assume in 4gb ram what apple will do...,,, flawlessly.., super fast\n\nCharging time —- as this support super fast charging but i have normal one , for me it takes 2 hrs to get charge above 90\n\nDisplay — no ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Excellent Phone"
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "Awesome phone😍😍"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "I bought this for my daughter for 52999. Very good deal!\nLooking again to see if it comes down to this low price to buy one more"
    },
    {
      "User_Rating": "1",
      "Title": "Useless product",
      "Comment": "Phone has display and camera problem. But flipkart refuses to replace. When i got the product seal of the box was open. There were impression of finger prints on phone. Then also flipkart says, go to service center fr it. Poor service. They are cheating consumers online."
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "sometimed it heats while multi tasking"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Wow 49000"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Great phone bought at fantastic price.\nExtremely happy"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Just superb! It has everything that an awesome phone should have"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Amazing device , prompt delivery thanks Flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "The phone is just amazing!"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Osm"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "I was Android owner previously and this is my first iPhone(already loving it).I am not a fan of big screen phones so this phone comes quite handy and where one can operate it easily using single hand.Also the sound and video quality is very good but main issue is charging which takes hell of a time to reach 100% as it does not support fast charging,but battery can easily run for 1 day and it will require charge next day only.\nCamera is awesome and quality of video recorded is top class.\nGo fo...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Amazing Phone at an excellent price by Flipkart."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "I love this iPhone latest version"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Gud nice..."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Super phone the best mobile"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Amazing!!\nNo words, its a beast, stole it at rock bottom Price of 48,500. Thanks to Flipkart and team. You rocks"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Apple finally delivers an iPhone with a huge screen, and for movie-watching, game-playing fans the iPhone XS Max is an exciting new addition to the range. It certainly costs a lot, but if you can get past the price (which many won't be able to) the XS Max offers up a super, supersized experience."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Great product go"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "I ordered this phone during flipkart sale and this phone is absolutely amazing\nnow people ask why should we buy iPhone xs when iPhone 11 is available in similar price, following is the reason ,\niPhone xs has OLED display which makes huge difference in images! (Iphone 11 has LCD display which is not good at all)\nImage resolution is better in iPhone XS!\nThe most important thing is the premium feel that we get in iPhone XS due to its stainless steel body and not like aluminium used in iPhone 11!"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Phone is very smooth.. attractive look."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Here is my review after a month's usage.\n\nThis phone is a beast, you can throw any app, game or performance hungry resources and iPhone will handle everything smoothly.\n\nCamera is awesome too, works perfect at both day and night.\n\nAs of now, pretty much satisfied with Jr Steve Job ;)"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "best and perfect camera quality"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Simply loving it"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Really a very fast delivery and the condition of the phone was awesome.Thank You"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Upgraded from iPhone 6\nLittle heating and connectivity issue except this device is awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Best in class device @49999"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Value for Money"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "I m so excited because it’s an Awesome mobile with in this price range and 10 stars for the the price."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Am happy"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Best iphone in the offer price by flipkart.\nLucky to grab the offer..."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Nice Phone but battery life is not good..\nBattery re-charging time is to long 0 to 100% approx 3hr.\nAnd another one is phone heating problem...."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Amazing got at 50000"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Stunning Quality\n\nEven though the features like IP68, Oled display and stereo speakers came late by Apple, the phone is excellent in terms of quality and performance.\n\nOnly downside the battery life could have been better, XR's battery life is better compared to this"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "super qulity"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "With 4 more years of support from apple, and a beautiful camera and display, at this price point, great deal from flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "🍉🍉🍉 loves it 😃"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Finally after 10 days i got this phone on my hands,feeling loved for the Flipkart republic day sale .Thank you flipkart❤️❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Got it for 50k. Worth at this price"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Awesome phone but battery life is poor"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "owsam"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "got this at ₹91042 nice deal + 1 year extra warranty at ₹3300"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Delivery was Swift and fast. Arrived 4days before the scheduled delivery date. Secured delivery.\n\nproduct is genuine and amazing. it has fulfilled my expectations."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent experience",
      "Comment": "Excellent experience. Delivered 2 days early from committed date."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Excellent Mobile, Mind blowing Price, Thanks Flipkart."
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "thanks to Flipkart for such a great deal.\nReceived genuine original product with 1 year warranty. Display is great. Battery last for a day with medium usage 4-5 hours. Slight bulky. Speakers are good. Camera is excellent in bright light only, very poor low light compared to iPhone 7. Portrait mode is amazing as it gives natural bokeh effect, compared with Samsung which is giving better bokeh image but Samsung looks artificial. Face ID is accurate and faster than Touch ID. Performance is good...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "It’s really awesome\nCamera is like DSLR\n1/2 day battery life its really good\nFace unlock very fast\n☺️☺️😎\nThanks to Flipkart 😎😎for providing me this iPhone"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "The only word to describe this piece of art is \"Perfect\"!!!"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "After a long time moving to Iphone and phone is amazing except the battery life. Got at great price 49999 so the phone desires every penny of it. Again its a great phone to hold on for years."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Phone is super and amazing performance and camera result. Apple is giving good security feature. Good phone for business person."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Excellent phone with an outstanding display. Battery life depends on usage but usually lasts the day. Camera is amazing and video recording at 4K is awesome."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Awesome mobile... battery will last up to 1 and half a day for an average usage and will last for a day for moderate usage. With 12w Apple adapter charging is very easy and very fast(1.45 to 2 hrs). In my point it’s worth because it’s performance"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "good"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Name is enough to say"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "This is the best smartphone in the market in my point of view. I personally didn't like the three camera design and frosty texture of the back of iPhone 11 pro. Specification wise, there is not much difference between xs and 11 series, so instead of spending one lakh on 11 pro, xs could be a better value for money at the current price of 55-60k."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "most valuable product in this price. i really love it"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "The best smartphone of 2018"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Absolutely awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "The phone is really awesome am using it since last 4 months worth for money to buy in Flipkart."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Buttery smooth and awesome transition from the existing phone to this one. And got it on time too."
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "awesome product ."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Device is just great. Delivery was pathetic!"
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "Network problem.....\nAnd heating problem....\nDon't buy from flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "I like the display and the ease to hold it. Better grip over iPhone 7"
    },
    {
      "User_Rating": "5",
      "Title": "Mind Blowing Bole to FAAAD!!",
      "Comment": "Hello Frands,\n\nYes i have purchased iPhone XS without selling my kidneys. Because i kept them safe for Corona & Elephant.\nI personally hated the big screen phones since i have seen everyone swiping on the big screens in delhi metro. That time i was so happy with my handy iPhone 5S. I kept upgrading iPhone with new generation iPhones. With iPhone XS upgrade i personally in love with this gold beauty.\n\nDisplay : Super Gorgeous OLED display,\nPerformance : Super, Color : Gold, Face ID : Super...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Its perfect bt insanely overpriced.. Bt m luving it so much..display is gorgeous/sound is good too/ camera is better compared to iphone x/ battery life isnt that great..\nOne thing i dont like is Flipkart's delivery..it sucks big time.. They took 4 days to deliver 1 lac rupees product..which is bad.\nMaximum time for delivery should be 2 days.. Must deliver the product this expensive with in 1-2 days..\n2/5 star for delivery\n4/5 star for the phone"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "the phone is amazing and i bought it for Rs 1,04,000 on bigg billion day"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Awesome phone."
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "All excellent except battery\nBattery feel like we use in 2015 android phone in iPhone"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Nice Product"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Awesome at 48499/-"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "excellent phone. got @1. thank you flipkart ."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "I think this is end of my journey of mobile"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "nice product in this thanks Flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Thanks for a packed new product and before time delivery."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Good experience"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Fast delivery by flipkart..."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Best phone. With flipkart trust.\nThankyou soo much for you service"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Very good"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Happy buying 🙂"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Overall nice phone with average camera"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Powerful phone and run smooth with heavy apps opened in background\nDisplay is good and fast touch response.\nSpeaker sound good with genuine bass while listening music."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Good one"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Wonderful Mobile purchased in fabulous offer from Flipkart.\nThx FK"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Amazing Phone!"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Good but battery drains so fast."
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Over all good product at under 50 k. Good hardware and software integration."
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "Superb camera superb display"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Apple never disappoint their customers\nIt always gives it's best\nLove Apple"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Apple always maintains its standard and its value for money,flipkart had really good price offer,so got it here and was delivered within 2days,thank you😊☺️"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Nice phone"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Received genuine and brand new phone in best price."
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "If you want to carry brand then go for it many better options in this price range. Money only for brand name"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Best phone ever. I have replaced i phone 7 with dis one. Amazing experience. 05 out of 05👍🏻"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "So far good"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Iphone xs Bad news(No 10 days replacement for apple phone here )they are saying to go apple centre😕😕😕😕😕\nis the best decision i made\nSperb delivery from flipkart best deal also\n\nSo buy it when ever u need it. Gud job\nThankx to flipkart happy shopping guys 😚😚😚😚😚"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "I have i phone 11 and now this xs i can clearly say the build and disply is far better than 11 .....its too good ...no one can beat iphones"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Thanks Flipkart for such a amazing deal... :) But keep some sufficient stock so many can grab it."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Thanks"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "superb retina display awsme performnce a beast from apple face id works superb"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Good Product"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Highly Satisfied apple user and a great Flipkart Deal.."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Everything is great with shipping packaging etc.\nThe best thing is it ships with ios 13.3 the latest ios released yet mens it is a newly manufactured unit love Flipkart."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "First of all,thanks to flipkart for providing me the original product of apple.\nComing to mobile,\nCamera is excellent on daytime,it was ok on nyt\nProcessor is excellent\nBattery is good for non-gamers\nSound is also good\nOLED display makes a huge difference from iphone 11,thats why i prefered XS over 11\nI was using iphone 6s and it is an excellent upgrade for me\nWorth waiting for 1month since i ordered.\nThank you TruecomRetail and Flipkart."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Though I got the product late, but satisfied with product"
    },
    {
      "User_Rating": "1",
      "Title": "Absolute rubbish!",
      "Comment": "This product is one day old and speakers are sounding like Chinese phone i dont know how is this even possible"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Always wanted to try an iOS device and bought this.\n\nA good phone with the optimised software, good camera, great build quality."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Value for money"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "best"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "My battery capacity dropped to 96% in just 20 days. Wastee"
    },
    {
      "User_Rating": "1",
      "Title": "Absolute rubbish!",
      "Comment": "Phone comes with low network/wifi issues\n\ni have never had issues with my iphones in the past. I happen to have oneplus 6t along with this phone and everywhere I clearly see that OnePlus has much better network quality. Indoor coverage is poor on this phone."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Best phone"
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "Heat much"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Nice"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "typically awesome..."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "One day of use superb experience exception with battery"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "I Love It.....Very Much"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Great product. Camera is amazing"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "I bought this iphone on flipkart shopping days, and I received the product on discounted price, I feel very good once I was able to place the order, because the moment I place the order I saw after some time product was out of stock. this phone is superb, I m upgrading from iphone 7 so feeling very good and nice enhancements."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Thank you for fast delivery with a seal pack."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Very good"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Improve delivery days"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Front camera is still better in my pixel.\nPortraits are not as good as pixel.\nLoudspeakers are fantastic on this device as well as display.\n\nGood phone for apple fans and not for pixel or mate series owners!"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Best image"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Amazing. Simply superb"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Awesome phone"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "SMOOTH AF"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "VALUABLE PHONE FROM A VALUABLE BRAND(APPLE)"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "It's a great phone even though launched during Sep18, there is no lag\nThe camera with 2X optical Zoom is very useful and the picture quality is realistic\nThe screen is awesome even though the notch is little irritating.\nThe signal reception is good\nBut for the price it deserves 5star."
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "Phone is gud but not great.Galaxies r much better in most of the aspects.Display wise and camera wise galaxies any day better.Build quality and Speed perspective Apple is better.After spending so much what u get is Full hd(nt 2k) screen and 5 watts charger.No option for finger print reader and face unlock also not great though oneplus excel in biometric department.I m happy wid my purchase but my impressed."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "As Always I Phone never disappoint"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "photos quality is average"
    },
    {
      "User_Rating": "1",
      "Title": "Utterly Disappointed",
      "Comment": "Again Replace Defective Product"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "I love it"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Very good Product"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Grey colour is just awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Nice phone , look awesome, designed well"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Outstanding"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Review is not required for i-phone users and review won't be accepted to other users... ;) ;)\n\nSimply Awesome..."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Terrific product.. got original sealed product bought in Republic Day sale value for money.\nThanks flipkart for delivering two days before\nPacking would have been better !!\nOther than that no issues genuine product has been delivered"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Great product, but, surely does not justify the price ..."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "A Great Purchase !!!"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Iphone XS, The first Dual Sim phone by apple. Always wanted to have one but this very feature was not there until now and thats why i never bought one.\n\nReturning to Display and performance, Its best in industry no phone can match it in these 2 departments. Regarding pricing, its steep but then it is never aimed for masses. Tim cook in one of his interview had said that Apple dose not want to sell more rather they want to sell the best and hence the price.\n\nMost importantly both Jio and Airte...\nREAD MORE"
    },
    {
      "User_Rating": "3",
      "Title": "Just okay",
      "Comment": "Totally overpriced\nSamsung and one plus 6 always better than this\n\nIt just a brand to show off\n\nBut you want performance then go with samsung and oneplus"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Super smuth prafomans long buttary display good but flipcart dilevare is very poor"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Good seller received on time and one day before thanks"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Its my 2nd iphone XS its great in all the way i purchased this product at 54000/-. Camera quality very good. Performance very good. Face recognition speed is very fast."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Its appearance n performance than other n also unique then others"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Awasome product."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "This review is not about the iphone but about getting a dead phone from Flipkart today - this is inspite of paying the full price!! I have complained to Flipkart and they said they have escalated the issue and will resolve by 8th Dec!\n\nThe phone I got doesn’t start and even when put on charge (like all Apple phones) doesn’t show the Apple logo or anything on the screen for that matter!\n\nI want either my money back so that I can buy it from another store or a NEW replacement phone - I will u...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Awesome phone. Snappy performance. Camera is fantastic."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Oh this beautiful phone!!\nOne hell of a masterpiece, except for the fact of it being little pricey."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Excellence in every minute detail. Fastest Delivery by Flipcart"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "It’s awesome"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Over all phone is awesome but some issues are there first battery backup is very less in this money value, battery drain fastly only 11 to 12 hrs backup and same time charging is very slow, it takes 3hrs to 100%. Face unlock is very fast even in dark night just a sec and phone become unlock, super."
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Costly , but gud product! Can’t say whether it is value for money ! Prices are sure to drop! Please wait to buy"
    },
    {
      "User_Rating": "2",
      "Title": "Slightly disappointed",
      "Comment": "Battery problem"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "It's been a whole day and still phone is on. Battery is really improved. And Camera quality is really Awesome. But price is really not worth it. I recommend it 5 star because of its Appearance. Good phone."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Good"
    },
    {
      "User_Rating": "3",
      "Title": "Just okay",
      "Comment": "Battery percentage become too low"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Battery problem"
    },
    {
      "User_Rating": "3",
      "Title": "Decent product",
      "Comment": "received iphone xs within 24 hr .itz best apple product with light weight and best look .value for money"
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "Osm mobile ... Thank you flipkart ..50k .. unbelievable deal.."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Thank you! Filpkart 4 such a good affordable price."
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "apple slowed it, product is not as good as iphone x or xr used to be\n\ncamera quality is diminished in low light conditions\n\nscreen quality is not as good as samsung mid range\n\nspeed is an issue, lags many times a day but its absolutely manageable, this all is happening after a recent update, sometime it seems like the new phones have little different quality of hardware used. i know disappointing it is but thats reality. cosmetics of phone are brilliant no doubt whatsoever. battery is improv...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Simply it's awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Nice"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Amazing phone at very honest prize.Love apple love flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Awesome Phone..."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Battery still needs improvement.."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "one of the phone"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "A very Satisfactory purchase, Thanks to Flipkart for Such Great Offer.\nTo Sum it up, Apple is Something which one can't compare to others at all.\nGreat Battery, Best cameras, Sound and Display is Awesome and rest is Also Best in class.\n\n10/10 in short."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Got it at a reduced price. Worth the deal. Amazing pick"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Quality you know: IPhone. Cost : a bit on the higher side"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Osm"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Yes..! It’s original product..! Amazing mobile with best price"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Best model iPhone ever"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "I’m just loving it"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Nice product"
    },
    {
      "User_Rating": "1",
      "Title": "Utterly Disappointed",
      "Comment": "Not value for money"
    },
    {
      "User_Rating": "5",
      "Title": "iPhone XS with very great price on flipkart",
      "Comment": "When it comes to apple iPhone its unmatched experience with any other mobile phones\n\nnow also with dual sim and camera and apple brand value"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "One of the best in the series of I phones."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Very nice product"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Totally happy with my apple"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "nice"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Pam"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "One of the best deals I have got"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Amazing Delivery n Fantastic Product. Thank You"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "iPhone is awesome and you flipkart are fab. What fast service yesterday ordered today got delivered. Amazing guys. You spread smiles."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "One word :marvellous"
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "Battery draining very fast. Display is good."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Awesome phone and also authentic"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Awesome phone"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "I love this 👌👌👌"
    },
    {
      "User_Rating": "4",
      "Title": "4 Star for my Iphone XS",
      "Comment": "The package and the product is good. But the delivery was delayed for a day due to various reasons."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Utmost satisfaction."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Best phone"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "It’s amazing picture Quality is too good"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Great mobile phone"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "supper"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Iphone is always amazing."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Product delivery was delayed due to lockdown. Product was nice nd packed well. Working great. Good phone to buy"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Good phone"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Premium look phone"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Simple and Sleek Product from Apple As usual, Flipkart managed to deliver the product before expected delivery date thanks to the delivery team.keep up the good work."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Over all good❤❤"
    },
    {
      "User_Rating": "2",
      "Title": "Bad quality",
      "Comment": "Battery is a huge problem. Charging pace is slow. At times the phone doesn’t charge at all. Not sure of the battery quality."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Excellent smartphone\nPoor flipkart help centre support"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Thanks to flipkart for making this wonderful product available at best price"
    },
    {
      "User_Rating": "1",
      "Title": "Did not meet expectations",
      "Comment": "Not so good heating problem"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Nice product"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Good product"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Best phone 60k under\nBest cemra\nValue for money"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Nothing matches its performance. Great quality product."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Best in the business."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Superb camera"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Super"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Lovely phone"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Great cameras"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "I have exchange my XR with XS , truly amazing Display and camera , but if u want tough phone than XR is better , but XS is amazing because i get only in 48k, and currently not any highend apple device available on this price"
    },
    {
      "User_Rating": "3",
      "Title": "Just okay",
      "Comment": "It could’ve the Best Buy if it wasn’t for the lacklustre battery life. The camera, display, software, performance is top notch(no pun intended) no doubt but when it comes to battery backup, it gives up in half day of normal use."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Nice and superb quality"
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Value for money I get very low price"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Genuine phone !"
    },
    {
      "User_Rating": "1",
      "Title": "Not recommended at all",
      "Comment": "Review after 3 month using my iPhone XS battery is not good only 3 hr backup and battery capacity 80% in 3 month not satisfied with iPhone nd flipkart"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Apart from the battery everything seems to be working fine."
    },
    {
      "User_Rating": "2",
      "Title": "Slightly disappointed",
      "Comment": "It’s said it fast carger in 30 mins 50 percent it will take they but the actual things is it taking more than 1 hr to get 50 percent charge"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "super"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Just wow i got in 49999"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "What an amazing deal by flupkart, love this phone"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "fine"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Great product....very fast and responsive....much better than the earlier versions"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Best camera and display. Value for money"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "good"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Good product"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "It's a great phone among iPhone X series. Decent battery backup, good camera quality, great performance. The price deal was good for me comparing it's actual market price when it was last available and also the fact that this phone is unavailable even in the online market nowadays. But to be honest, it's not a value for money if you have an Android phone also in the comparison list to buy one. Since I upgraded from an iPhone to iPhone, it's a nice deal for me."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Amazing"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Perfection!"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Thanks flipkart for this awesome product at this price."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "No need to explain much about iPhone. It’s one of a kind and no competition. You should experience the portrait mode on this phone. Awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Mindblowing"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Phone gets hanged while on YouTube sometimes"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Battery is not sufficient for full day usage but overall product is very good"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "The product is really good. It is a very best choice in 2021,no doubt in it. Got for it...Awesome phone😊😊😊"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Best phone I got"
    },
    {
      "User_Rating": "1",
      "Title": "Very poor",
      "Comment": "Very bad experience\nBattery not working\nDischarge fast & charging slow\nHang issue"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Excellent touch reactiveness with very high refresh rates. Loved the screen display especially the dust resistant feature."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Phone is amazing\nBut delivery speed is very low"
    },
    {
      "User_Rating": "5",
      "Title": "Value for money.",
      "Comment": "Although the phone came out 2 years ago, it's still better than a lot of top end android phones. iOS, although a bit restrictive, is a delight. The timely update and long term support is something that Android has a lot of catching up to do.\n\nThe build quality is just top notch with a gorgeous display. The camera is great but is a little dependent on good lighting. My pixel 2XL camera would beat it under most conditions.\n\nOverall, a great phone to buy at this price if you want to experience a...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Phone was too good and i love it"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "iphone is better camera"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "It’s a iPhone what do you expect"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Besst deal"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Amazing product!"
    }
  ]
}