{
  "search_query": "iPhone 11",
  "total_reviews": 539,
  "Overall_rating": "4.6",
  "Total_ratings": "2,06,193 Ratings &",
  "reviews": [
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Really satisfied with the Product I received... It’s totally genuine and the packaging was also really good so if ur planning to buy just go for it."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Feeling awesome after getting the delivery of my phone. Dual speakers makes the sound quality very loud. Amazing!!"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Good Camera"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Very very good"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "This is amazing at all"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Super🔥 and good performance 👌❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Photos super"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Camera is awesome\nBest battery backup\nA performer 👌🏻\nIt will be a real value for money if they provide charger and earphone inbox!"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Perfect Product!!"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Value for money 😍"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Excellent Phone."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "V Good all"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "It’s really awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Awesome Battery Life...Camera clarity is too good..\nValue for money...Its gives full day battery backup in single charge..."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Go for iPhone 11 , if confused between iPhone 11 or iPhone 12 mini.Battery Life is enhanced , it worked for complete 2 days without charging it. Explored new features of taking screenshot by clicking on apple logo by Haptic Touch , Portrait mode with stage effect enhanced & slow motion selfie."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Nice product\nThe camera is extremely good which i liked the most.\nGot delivery within 24 hrs. Thanks to Flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "iPhone 11 is a good phone. Not a very big difference between 12 except for the OLED screen and a very minor camera improvement which is you cant make a difference. If you are planning for a iPhone and you have budget you definitely can go for this without second thoughts.\nNow some people are complaining and giving review 0 or so because there is no charger and headphones, but thats been already mentioned so I assume they are illiterate. Its not that Flipkart is removing them duh. Anyways bee...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Good product 👌I love iPhone"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "first iphone from android.\nwhat can I say, iphone 11 says it all.\nearlier I used to abuse iphone users by saying show off, but after using it .. it’s completely worth it..\np.s: there is still little pain in lower abdomen 😜"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "If you get it you would definitely not regret it. It is a premium flagship phone. Love for apple, love for iphone."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "It's my first time to use iOS phone and I am loving my upgradation 😍😍 I love the color, I love the assebility of the phone....I need to learn more about its functionality, but as far as I have seen, it's quite easy and it has a lot of functions to work on, specially if you are a content writer or a blogger you get a lot of content creation platforms and they are really amazing.\n\nThis phone not only for good quality photography but a lot of other task too.😍💯"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Amazing phone with great cameras and better battery which gives you the best performance. I just love the camera ."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Great iPhone very snappy experience as apple kind. Upgraded from iPhone 7.\nPros\n-Camera top class\n- Battery top performed\n-Chipset no need to say as apple kind\n-Security as you expect from apple\n- Display super bright industry leading colour\naccuracy and super responsive\n-Build quality as expect from apple sturdy\npremium durable beautiful stylish.\n-Os most stable os in smartphone industry\n\nCons\n-No 5G\n-Display is not based on OLED technology\n-Charger headphones and 1 apple stic...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "very good camera quality"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Always love the apple products, upgraded from old iPhone 6S plus to this after having my first baby. I just love to click baby’s photos with it. Overall I just love this phone. Battery back up is okay, sound quality is good. Haven’t tested yet waterproof yet. Only one thing I hate is apple could have given charger & headphones in box."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Don’t expect much from front camera… especially who loves beauty mode and filters.. back cameras are good…video department is always plus point in iPhones… battery capacity is really surprising lasts for one day at least… performance always good and smooth… speaker’s quality is good…built quality best and haptic feedback is enjoyable…\nNote : images are good after you edit"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Superbb performance n camera is awesome 😍😍"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Awesome Best iPhone 😍👍🏼"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Value for money 🖤🖤"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Damn this phone is a blast . Upgraded from android to ios and is a duperb experience. Battery backup is top notch and display also pretty good"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Previously I was using one plus 3t it was a great phone\nAnd then I decided to upgrade I am stuck between Samsung s10 plus or iPhone 11\nI have seen the specs and everything were good except the display it’s somewhere between 720-1080 and it’s not even an amoled it’s an LCD display\nBut I decided to go with iPhone because I have never used an IOS device I have Been an android user from the past 9 years I ordered IPhone 11 (128gb) product red\nMy experience after using 3 weeks\n1. The delivery ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "It’s very good battery life and display and video quality and ther performance of iPhone.....🔥🔥🌈"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "NYC"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Phone Is So Good"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "I dreamt about this day from a long time.... Getting an iPhone with my own money.... Super happy and worth spending every penny"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "My first ever I phone and awesome performance camera battery and smoother than my previous phone"
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "🎈Battery\n🎈Performance\n🎈Camera\n🎈Price\n\n🎊All together worth IT\n\n♥️♥️♥️♥️"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "A wort full value for money decision it’s . Simply go for it in 2021 its still a good decision . Awesome camera , Super smothered performance, Heck of build quality. And Most important it protects your privacy."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "What a camera .....just awesome ..you can feel this iPhone just awesome . Good for gaming also ...try pubg in hd it’s just wow"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Buy it if you afford it 😜"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Purple is best"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Value for money\n5 star rating\nExcellent camera\nBattery backup full day in single charge.\n\nTougher and water resistant design, glossy back.\nThe screen has excellent brightness and contrast.\nApple A13 Bionic is the fastest smartphone chip on the planet.\nExcellent battery life, fast charging support.\nStereo speakers with great quality."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "excellent look..."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Amazing Powerful and Durable Gadget.\n\nI’m am very happy with the camera picture quality, Amazing face id unlocked in dark room, Strong battery with perfect screen size as you can carry easily in pocket. This is my third iPhone.\n\nI shifted from android Samsung Note series to iPhone because of the strong build quality and peace of mind for next 3-4 years.\n\nDon’t think to much just go for it and I suggest you to go for minimum 128gb variant or more 256gb.\n\nI’ve attached my puppy pics and no fi...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "I’m satisfy😍😍"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Very good"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Definitely worth purchase"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "I'm Really happy with the product\nDelivery was fast as well\n..it was a gift for my sister and she loved it so much."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "This is my first iOS phone. I am very happy with this product. Very much satisfied with this. I love this phone."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Awsn loved it"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Camera is just wow 👌👌"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Loving it!!! 🤩\nSE to 11❤️\nA Big & Worthy Upgrade🥰💥"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Best and amazing product.....phone looks so premium.... battary is also good as expected .... Wide angle camera is so addictive ...if you are a IOS lover....then this phone will be the best choice for you all!!💯🔥"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Very good"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "I upgraded from 7 plus and Im not regretting it. The only thing missing is OLED display other than that 11 is no where lesser than 11pro."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Product 100%"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Just awesome phone, everything works in such a smooth and refined way !!!\nCamera - next level\nDisplay - next level\nPerformance - monster\nBattery - next level\nEverything works at the best level with A13 Bionic Chip\nValue for money iphone\nYou should go for this just killer performance 🔥🔥"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Everything is perfect pictures come out so clearly and at first I wasn’t sure when I got it then when I started to use it and get the hang of it it was amazing!! I can’t wait to see what the next future phones will be like. The screen display on this bad boy are unbelievable they are so clear and never fail me. The performance is super cool there is a lot of cool features as well I like this phone because I feel that it is easy to use and one of my favorite things about this phone is the Face...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Finally got it 😙"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Amazing camera quality."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "It’s a must buy who is looking for an upgrade from previous generation of iPhones. If you are using XR then still you can hold on for sometime and upgrade to 2020 model else this phone is a must buy . Camera quality is amazing and wide angle is something to count upon. Performance wise it’s amazing and feels premium while holding in hand. So a big YES for this device. Go for 128 GB variant as the 4K videos will occupy lots of space and the storage can get over very quickly. Try to buy it with...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "i11 is worthy to buy, too much happy with the product. Thank u flipkart I received the item on time..loved it.."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Did an upgrade from 6s plus to iphone 11.\nAo far the experience is well and good. Felt smoother than 6s plus. The camera quality is superb. Battery backup is descent. Not a heavy user, and gets power more than a day. Go for it if you need an alrounder iphone in a competitve price."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Loved it..."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Amazing camera quality as expected, battery also has very good performance. Display, body, and touch experience is the best I’ve ever had. Sound quality of speakers is more than sufficient. Apple is known for it’s customer friendly security services and I can see it how. The A13 processor is the best in its work. So I would definitely recommend it for everyone who are looking for it, just go for it without delay.\n\nThe most amazing thing it the delivery. Flipkart has delivered it in the span ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Best camera ever"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Gifted my man on his 30th birthday 🎂 He loves it.. Him happy so i am more than happy 😍😘❤️🥰"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Value for money❤️❤️\nIts awesome mobile phone in the world ...\nDisplay was very good and bright ..\nTrust me freinds you r never regret after Buying..\nJust go for it....\nI love this phone and i switch to iphone x to 11"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "I was using Iphone 6s and also Oneplus 6t. Both mobiles were perfectly alright in Photos, gaming, and smooth interface . My 6s mobile getting battery issue. thought upgrade to 11. Really like this mobile of its Internal storage (compare to 6s) , camera and its touch feeling. Its a worth buying mobile for me."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Such an awesome experience with iPhone 11 awesome Camera quality."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "iphone 11 is a very good phone to buy only if you can compromise for the display. The display on this is device is pretty good but you can get other options with better displays in this price segment.\nIf you can survive with an HD+ LCD panel with thicker bezels and a notch up top then this is a very good phone for you.\nCameras are awesome, battery backup excellent, great performance and a decent premium look. Good job Apple !"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Excellent Phone"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "over all its nice.. color... purple. 😍"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Awesome 💙"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "happy ❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Superb Phone.."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Just enjoy the power of it!"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "It is just awesome mobile for this price from Apple,\n\nAfter 10 days review\n\nBattery enough for 1 day even 24*7 Internet will be on and mostly internet usage\n\nCamera is just awesome cool , android 64 MP is equal to this just 12 MP\n\nA13 Bionic chip will give more high performance without hanging\n\nAudio stereo speakers will give Dolby atoms sound with crystal clear\n\nVideo recording is like cinematic shots of every sec can be a 4K 60fps. Just awesome this phone\niPhone 11 loved one"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "I was using android phone earlier..I was thinking apple phones are much more costy than other phones with less specifications..so why to waste money in this??..But trust me guys once if you start using ios then you won't go back to android...beleive me this phone is the best than all other...There is no other phone which can beat iphones in terms of camera..iphones gives the best real image..its very faster and smoother than android phones...if you think to switch to ios iphone 11 is the best...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "I rate this product 5* as it has got amazing user experience with the best performing A13 bionic processor. The screen responds and graphics rendering is top notch. With casual gaming and internet browsing, the battery lasts for approx. 1 day. Camera is very good. You will fall in love with the portrait mode. You can call me a loyal Apple customer or whatever but I won’t stop praising the products and overall experience. That user experience matters and is worth every penny you pay.\n\nBelow ar...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "So far it’s been an AMAZING experience coming back to iOS after nearly a decade but it’s not as versatile as android though phone is sturdy dropped it accidentally a couple of times and nothing happened fortunately camera is awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Using this phone from last 4days, great camera quality love it"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Quality camera"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Awesome phone, great display(may not be a OLED)...very fast processor...taking portrait photo is the real joy."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Awesome Phone. Battery backup top-notch..."
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Just got this iphone 11\nAnd it is most powerful mobile phone I have used ever\n\nSo,go for it if you want a phone with best specification like camera,battery backup,display, A13 bionic chip\n\nThat's my review about this phone but yours can be differ from me...."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "This is my first Iphone. Very smooth and super fast\nThankyou @Flipkart god bless you with more success."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Excellent Fabulous Adorable Iphone 11 Value for money and premium phone"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Awesome Thanks Flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Thanks Flipkart For this amazing deal! I had a dream of owning a iphone since i had known about.\nIm very happy with my purchase & it is totally worth it.\nAmazing experience all over !!\n\nAnyone who’s thinking of buying it in 2021, i would simply say go for it without any second thoughts ❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Perfect iPhone on this budget!! Camera and the night mode is crazy and killing it 🤩 Also the colour suits for everyone ❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Excellent"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Outstanding performance this phone"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "A perfect phone and a good battery super camera and the sound is dynamic overall the phone is perfect for upgrading from lower iPhone model to iPhone 11"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Very nice iPhone 11 i lake"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Fantastic phone"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Gift this to your loved ones fabulous product and amazing super fast delivery by flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Really worth of money. i just love it. It is the best phone ever."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Iphone is just awesome.. battery backup is very very nice.. continuously for 10 hours we can use it.camera is just awesome.. display is just fab.i love it alot..i had to wait 15 days for it as i pre ordered it..overalll it's worth the price..these all images are clicked by my iPhone..and i love it."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Moved to Android to #IOS... AWESOME Mobile...🥳🔥"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Good phone but not handy. You will always need both of your hands to use the phone."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "It’s been 7 years I was waiting for an income for my first iPhone .it was like a dream to me and finally I achieved it. Why chose iPhone?? It’s a premium standard level phone maybe you could find other brands valu like this but not all those are iPhone. If you are thinking to buy an iPhone don’t think too much grab it bro. Being an an iPhone owner can give you a feeling like owning an Lamborghini in your pocket According to me a middle class family boy.\n\n\nBest on camera and videography\nSoun...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Exactly mach what you expect and where Spent your money .\nPros:\n1. Battery 10/10\n2. Camera 10/10\n3. Performance 10/10\n4. Premiem Feel 10/10\n5. One handed grip 9/10\n6. Network Capability 9/10\n7. Siri 8/10\n8. App manegement 9/10\n9. Sound on Speaker 8/10\n\nCons:\n1. Side Panel colour quality 6/10\n2. In-box Charger 6/10"
    },
    {
      "User_Rating": "1",
      "Title": "Worst experience ever!",
      "Comment": "The product came defective,yet Flipkart didn't accept the replacement and the behaviour of the executive was not good\nWhat's the advantage of being a plus member if we have to face this type of issues\nDisappointed"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "i phone no comment"
    },
    {
      "User_Rating": "1",
      "Title": "Did not meet expectations",
      "Comment": "Received damage piece and price reduced price by 2k after purchase and no proper response from customer care"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "yellow looks amazing and unique color and phone is osm"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "I'm switching this phone to oppo reno 10x zoom\nIt's really impressive\nRarely I'm missing smooth display touch response like oppo reno but\nI really loved it.\nCamera really impressive"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Awesome product... I loved it"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Battery heats every once in a while. Also, while Apple claims that the battery lasts 1 hour more than iphone XR, I personally have tried testing and the hard fact is that it doesnt. Phone’s performance and camera is great.\n\nJust that battery life js not very great. Also, no fast charger comes in the box. Charging the phone takes more than 2.5 hours."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Amazing picture quality ."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "awesome phone to have. it has got many smart features apart from mind blowing looks, camera, display, battery and sound. have fallen in love with this phone. must buy phone if you have got enough money. thanks to flipkart and apple of course.."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Excellent product"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Good"
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "I received a defected product which was already used\nBecause phone warranty is less than 10 months, it means phone is already activated by someone and flipkart not help me"
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "Wow"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Very good product"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Nice"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Superbb performance n camera is awesome 😍😍"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "This my first iPhone.. I am very satisfied with the performance and other features of this phone."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "This is my first I phone and I'm very happy to have it but it's battery life is not good as Android have that's all. All over phone is Awesome"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "The products is good and but apple should give the full hd display and 18 W charger in box that help to lot"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Very good product, battery life is decent"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "It is better to buy iPhone 11 over iPhone 12 if you prioritize the camera,Its because the difference isn’t significantly huge except lowlight performance and Go for 128 GB variant rather than 64 GB because the system data alone contains 20 GB of data .\nEven though it's 720p LCD display but it's better than todays Android's 1080p display. My phone was a 64GB mint green model and this one is really pretty especially in the real life. I can still get almost everything out of what i paid for at a...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Best All rounder Mob phone I love i phone ❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Finally purchased iphone 11 instead of XR and its awesome decision"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Feels great to get back to iPhones after a gap of 3 years. Great camera, processor, battery performances. Apple ecosystem adds to the value if you have other Apple products. Display is not on par with Amoled panels, but it's bright and punchier enough. LCD display aids to better battery life I guess. Camera is fabulous, excels in both still photography and video. Overall feels good investing into iPhone again, and am planning to stick to this for at least 3 more years. And guess what.. no oth...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Good clearity display and camera"
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "Looking so good 👍 😍 super 👌 stylish 😎 phone\nClean box 📦 good 👍 delivery 👌 fast delivery\nOriginal box Original iphone 📱 👌 😍😍😍"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "I am upgrading from Redmi 6A to iphone 11\nThis is my dream phone happy to purchase from my own money at Rs 48500"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Most powerful phone you can buy in 2019, Best Camera, Great Battery life, Decent Display, close your eyes and buy this ultimate phone, you’ll never regret it’s a complete package."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Awesome...🤩😍😍"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Super"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "superb performance"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "One of the Best iphone in 2020"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "This is my first iPhone. Thought a lot before putting this much amount for a phone, but it’s turning out to be worth every penny spent.\nGot a good deal from Flipkart. The camera is awesome, battery looks to be pretty decent, performance unquestionably good."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "The only issue is the unavailability of fast charging adapter in the box. It really takes a hell lotta time to get 100%.\nApart from that.. it really is a premium smart phone.\nOne can easily fall in love with the fast and efficient performance."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "The best all rounder iphone. Flipkart is doing a great job. They're delivery services are blazing fast. I got delivery on the same day. Genuine Apple Product. Working great. Talking about review There's no need of review for iphones. They're simply the best."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "It's amazing product guys I mean just go for it lovely and it's seal pack product so don't worry just order it"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "The ultimate performance\nCamera is superb\nThe battery backup also very good i never saw iphone gives this much of battery backup\nIf any one wana buy iphone 11 definitely i will recommend this mobile\nIt has the better battery and powerfull processer peak performance glorious camera and the display also 100% high quality lcd display if u had money for for 12 if u dont wana invest much money on that then go for iphone 11 it has maximum same specs only main difference between the 12 and 11 is...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Excellent camera and display touching very nice and smooth very improvement against iPhone XR and new processor is very fast"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Superb Phone.."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "iphone 11 is a very good phone to buy only if you can compromise for the display. The display on this is device is pretty good but you can get other options with better displays in this price segment.\nIf you can survive with an HD+ LCD panel with thicker bezels and a notch up top then this is a very good phone for you.\nCameras are awesome, battery backup excellent, great performance and a decent premium look. Good job Apple !"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Nice product by apple only"
    },
    {
      "User_Rating": "1",
      "Title": "Very poor",
      "Comment": "Charging cable is not working\nAnd not return wrost service and customer support not help this problem. This is a not good"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "I love I phone"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Ok, so after almost 3 years I am again back into Apple Ecosystem. Switching from Android to iOS has just one disadvantage imo, and that's you can't take your WhatsApp data restored to iOS. Everything starts fresh, pretty sad. I am so glad that I chose iPhone 11 over 12. With 5G nowhere in India for at least an year will have an added advantage to iPhone 11. Spending extra 25k just for A14 chipset and OLED display is not a clever choice. Anyways, a fantastic phone with everything fit perfectly...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "camera is very good."
    },
    {
      "User_Rating": "1",
      "Title": "Hated it!",
      "Comment": "if you possible dont buy on this app of iphone my iphone in does not worked of battery very froud this flipcart for iphone🤦🏻‍♂️"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "I had hopes of this amazing camera I could use for photography or simply to just take photos of day to day life and capture the exact beauty… whilst this camera does come with noticeable improvements from previous iPhones, it isn’t amazing. I would have wanted something more from a camera that had been the main focus of the phone\nI'm madly love with this iPhone 💚"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "At time of writing this review this phone processor definitely beat any flagship android phone !\n\nUpgraded from 7 Plus which is also quite good\n\nBut this phone performance is huge ! Fast and always to roll 😅\nLow light Camera is great\nBut i think portrait mode is not good as iPhone 7 plus\nIn this phone portrait mode is looks like artificial but on my previous phone it looks like dslr photo maybe i am missing setting on this !\n\nOtherwise everything is good !"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "One word : BEAST!!\nThere’s no other phone in the entire smartphone industry which can beat the processor that Apple has put in this device - their very own A13 bionic chip.\n\nGlad that I’m returning back to Apple and iOS after a long time."
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "impressive super phone and best in class camera ,sound and face unlock is super fast just see and phone is unlock and fast in daily apps use"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Worth the money’ starting first from its performance it beats out all phones , second the smoothness of camera is awesome, contrast ratio is much than expected. Price will not matter if u r a quality person, if not other phones are available with better discount"
    },
    {
      "User_Rating": "1",
      "Title": "Not recommended at all",
      "Comment": "Phone hang and heat issue in all iphone 11 model almost"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "🤩🤩🤩🤩🤩🤩I loved the Phone.. Every time I pick up the phone it makes me happy... The phone is beast💪💪 and the camera is fabulous 🥰🥰🥰.. I think one of my great purchase from Flipkart.. Thank you Filpkart.."
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Awesome product!\nBattery: awesome\nDisplay: awesome\nPerformance:awesome\nSound quality: awesome\nCamera: awesome in light-but Low light camera performance is not very good"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Awesome phone with good battery & best camera."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "This will help you more. See if you are planning to buy iPhone 11. I will say. Yes. But there are some plans I just want to disclose before you buy. 1) If you are an existing iPhone X/XS/XS Max/ XR user, better you guys do not think it to buy. You guys have more or less better gadget. 2) If you are an android user and planning to buy premium phone. I will suggest them to please buy iPhone instead of buying an Android. I bet you will never go back to android after using IOS. Now I want to shar...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "The built quality is not very premium.\nThe battery back is great .\nThe LCD panel is not so sharp but the brightness level is very High .\nCamera is super duper awesome.\nThe red colour which people think is bright is actually very soothing and excellent colour to choose from .\nThe A13 Bionic chip is really a flagship processor and can beat any phone which even has 12 gb ram .\nCamera module is very great and looks very stylish."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "awesome phone love it this device. camera and music is so good."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Amazing as it looks."
    },
    {
      "User_Rating": "1",
      "Title": "Very poor",
      "Comment": "I ordered this phone from flipkart 10 days ago. And from day 1 I was facing sound issues. The sound was getting cut in between the calls and on Instagram . I contacted flipkart after 5 days of purchasing this phone but they didn’t help me and said it’s technical issue so company is going to provide me the solution. I have spend at least 6 hours on calls and in Apple care centre so that they can solve my issue but still I am not getting any help, especially from flipkart.\nI am using Apple f...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Beast from Apple. I loved the performance, camera, durability, battery... I used this for a week and I just fell in love with the same. If you are upgrading from iPhone 8 or lower then it is worth otherwise you can wait for iPhone 12 or higher variants."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "My first I phone ever I upgraded to iOS And it's so pretty and beautiful long lasting power battery backup awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "its really nice phone ever i had.\nany way i have never used iphone before.\ni am loving it.\nthank you flipkart for delivery one day before."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "That's really azaming products"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "#brillient camera\n#high performance\n#good battery backup\n#0 to 100% charging took 3.30 hours with 5w charger\n#while using camera mobileheat issue\n#no hanging issue"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Jus one word “Awesome”"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Green beauty💚"
    },
    {
      "User_Rating": "1",
      "Title": "Did not meet expectations",
      "Comment": "Not up to the mark"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Always Loved"
    },
    {
      "User_Rating": "3",
      "Title": "Does the job",
      "Comment": "Apple is not doing any R&D for making its handset user friendly. Though it is small in size it is difficult to handle it with single hand. In this amount others are giving far far better than apple. One of the myth is it never gets lag, but others get after a couple of years. But in a couple of years everyone changes his mobile, than why should we bother about lagging of phone. In a nutshell apple should do a lot for improving its performance"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "This is my first iPhone and not much happy but ok. Because in this range i expect too much but...."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "I was purchase 34000"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Awesome...battery backup, display, camera, sound quality all are above 4 star"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Love it"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Best iphone ever.. best value for money phone.. easy to hold and face unlock is very fast and works even in dark.. looks very cool.. delivered in one day.. best flipkart experience and get also the original product. Red one is the .best color and most selling color so I love red one."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "The iPhone 11 is still on par or better, but it didn't get as big of a jump in battery life as the Pro models did. ... I was not a fan of Apple's Smart HDR cameras on the iPhone XS and XR, but the iPhone 11 is a huge improvement, and it makes older phones like the iPhone X and iPhone 7 look downright bad."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Really very nice... my dad gifted me really I am soo happy with this phone love it 😇"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Nice phone....but I bought it for 49000...now it prices 45000 ...with in a week gap 4000 difference"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Phone is tip top"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Camera is awesome\nBattery lasts more than a day without games\nSpeakers good\nTakes 3 Hrs for full charge"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "First value for money product from Apple still display can be improved"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Nice purchase"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "awesome camera. But display is not upto mark."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Awesome performance with pro camera"
    },
    {
      "User_Rating": "1",
      "Title": "Very poor",
      "Comment": "Phone is getting heated frequently while using Fb and other apps"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "So Beautiful and dashing.."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Great phone, switched from iPhone 7 and I compared with iPhone XR felt no difference except the second back camera."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Here is the thing\n\nThe only reason why you should buy this phone is for the camera, iOS, and if you have headaches looking at AMOLED display.\n\nI’m not an avid gamer but watch a lot of movies on smartphone. However, my migraine attacks increased considerably after using AMOLED Smartphone. That’s why I made a calculated decision to buy iPhone 11. It has the best LCD display and the blacks, though not as natural as an AMOLED, is better than some of the other smartphones.\n\nAdding to this the ste...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "This is my most awaiting phone.\nReceived very well in condition and packing\nDelivered on time"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Nice"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Superb mobile\nThank you apple"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "performance, camera, battery backup everything just awesome and specially colour i loved it"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Iphone is Brand"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Good Product"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "I Phone 11 is an amazing phone in a great price. I am using IOS for the first time and it’s so good , I am never going back to Android, It’s a win win situation for me. And specially the Black Colour is so sexy. Go for it"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Excellent phone. Got it for 29k after exchange and bank offer. Totally value for money at that price. Loved the product red colour.\niOS is smooth and no lags at all. Shifted from android though I have used iOS earlier and totally loving iOS.\nGot an original sealed box piece so go ahead and order without worrying. Also received the iOS 14.5.1 after turning on the phone immediately.\nFor people who are worried that there is no 5G in this phone don't hesitate to buy it. 5G is going to take tim...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Excellent phone it’s a pro and value for the money you spent never gonna regret the buying of this phone\nSome amazing shots clicked by this iPhone"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Beast Performance with Excellent Camera. got it for 54k"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Iphone11 (4/64)GB Green color"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "It’s Good"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Awesome ✨"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Not mere a phone , Its more than that for fun and enjoy life. Just grab it. Best luck"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Got my iPhone 11 today! It’s totally worth it even in 2021. Takes wonderful images and the stabilisation of video on this phone is just awesome although it is a 2019 model. Performance wise it’s ultra fast as expected to be. The only drawback per paper is the screen it has, but in usage I noticed nothing bad and the screen was totally fine for me!\nI upgraded from Nokia 6.1 Plus and it’s great 🤩"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "I bought this last week and so far iPhone delivered and it worth\nI’m happy with their iPhone 11\nDisplay I would 5 of 5"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Awesome Device thanks aapplee for this great device"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Wonderful mobile and the camera is just exceptional especially in night mode. Love the mobile"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Great phone for its price"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Loved it"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Nice"
    },
    {
      "User_Rating": "5",
      "Title": "Great phone ever!",
      "Comment": "This iPhone 11 is awesome for everything if you are using a camera, audio, durability, premium, battery, and do more."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "1.Excellent camera with moderate battery backup and display\n2.feeling bit heavy in weight\n3. Front cam is 4K in video but image clarity in night mode is not good\n4. Finally compared to Any android phone this is very good"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Awesome camera❤️ and gud battery backup"
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Mobile is very good"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Awesome camera, smooth and fast UI, display is great (though not LED) but the black area at the top could have been reduced. Battery remains a day even if used heavily. Charger in the box is ok, but 12 or 18W could have been nothing like anything. Overall an excellent product and comfortable to use. I have got it almost a month back and so far so good."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "first time iphone user...great experience"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Value for money.. the great 11 is awesome."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Very nice phone"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Nice value for money phone"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "I bought a new iPhone just to click awesome picture"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "My First iPhone purchase after being a 6yr Hardcore Android user. Delivery was super fast with good packaging.\n\nJust go for this device if you want a new experience, a new change and the feeling of holding this device is such an amazing experience but the smartphone is little heavy as I upgraded it from my Galaxy S9 plus which was quite lightweight.\n\nPro’s as far as I experience after using the device:-\n1. Design, amazing looking design + dual camera setup.\n2. Performance is A+ no doubt, smo...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "I upgraded from one plus 6 to iPhone 11 and it’s too good. Very smooth, battery also good. I love it. And thanks flipkart for fast delivery."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "I got super fast delivery in Just 18 hour's. thank You so much 💖\nThank you so much to this universe and everyone who make this possible for me, really very greatfull for this ❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Great experience with this iPhone after upgrading from iPhone 6."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "The camera is very good"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Everybody is talking about pros of this phone let me share the negatives.\n1. Charging this phone takes lifetime. it took my phone 2 hrs to reach from 21% to 74%.\n2. Almost same specs design and built quality as XR\n3. Product Red is basically Lipstick Red, totally different from XR.\n4. I would rate 0 of 10 in the area of innovation. There is nothing new other than IOS 13 which is full of BUGS.\n5. It very heavy around 200 gms and gets heavier if you add cases and covers."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Awesome product by Apple as usual the quality no doubt the quality is up to the mark no much for Apple till now this is my first purchase for iPhone device and I am 101% satisfied with the performance I love it"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Best ever, awsome camera and battery smooth os."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "iPhone camera"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "I got this mobile in big billiondays sale\nTruly i love this product very much....\n1. Camera was brilliant in day and night conditions\n2. Performance was damn good\n3. Battery performance good\n4. Apple taggedhele...😂😂"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Valuable"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Simply super"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Nice one"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Nice 👌👌👌👌👌👌"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "very good"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "So nice loved it"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Nice 🔥"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Love the camera"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Wow"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Nice phone with good looking design."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "I was confused between black and red, but when i saw the red i was sooo happy and relieved . RED is such a beauty .go get it guys.\nThe only con i find is they are not giving adapters and earphones along with it anymore .i really had to pay extra for it."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Awesome phone good looking working so fast"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "An awsm phone design is much better then iphone 12 series\nI m writing this review after the use of 4month of the iphone11 on normal use battery life is aprox 2days and on continuous use of YouTube and pubg its goes for 6-7 hr i’m a college student and i use mobile 24/7 and its performance is excellent although its an Apple iphone so no need to justify about its performance its best."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Good product"
    },
    {
      "User_Rating": "3",
      "Title": "Fair",
      "Comment": "Heating issue"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Trust kept by Flipkart.. upgraded from iPhone 7s"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "Camera is not working properly .. facing issues like graininess and blurry image quality..\n\nPixel get outcasted when image is zoomed in"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Good phone, and it's better than comparing with other iphone"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Awesome phone"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Camera Quality is so good I Love ❤️ Camera"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Battery backup is extraordinary, camera is decent & performance offered by A13 bionic is awsome. The display is good in practical usage like the visibility of display is very good in direct sun light compare to pro models. Iam extremely satisfied for the money I spent."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Good buy.. working perfectly !\n\nThat was upgrade from 6S to 11. I see no deference in both the phones except:\n1. Battery performance\n2. Camera quality\n3. Face detection unlock\n\nGo for it..!"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Loved this product and a very fast delivery from flipkart..."
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "Nice super"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "This is my first iphone. And i am very happy with this. Camera is just ✌️✌️🤘🤘"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Best for its performance..."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "No comments because its i phone"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Love at everysight😍❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Niceee"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Heavy upgrade from 6s to 11\nHere is not available fingerprint sensor in this phone"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Only con is no charger and EarPods"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Amount is to high with out adopters and ear pod"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Nice"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Its iPhone, name is enough, amazing handset\nPros: superb display\nSuperb battery backup\nPremium looks\nCamera gives natural pics\nNetwork coverage superb\n\nCons: only con is ekart delivery services which are very disappointing"
    },
    {
      "User_Rating": "3",
      "Title": "Decent product",
      "Comment": "Their was mic problems over their"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "superb quality and performance\ni like the black colour."
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Really no phone like iPhone. So switched to iPhone."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Ultimate super smooth"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Great phone but cost is too high don’t know when it will decrease please decrease cost"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Nice phone man..."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Excellent product! Don’t listen to a single negative review! Just go for purchase without any second thought. It has no power adapter and EarPods but you can use any Bluetooth Headphones for the same. But the product is worth without adapter and EarPods also at this price range. I was about to purchase iPhone 12 mini but it is not worth it. 11 is the best value for money iPhone.Just go and upgrade yourself to an Apple user!!"
    },
    {
      "User_Rating": "3",
      "Title": "Good",
      "Comment": "Phone battery is good\n4K video recording is really amazing\nCamera is good\nLow light performance should be improved\nPerformance is good\nSlow motion video create blinking on screen in artificial light\n\nFlipkart showed me quick delivery next day but the phone arrived one day late. I missed many memories to be captured. Upset with flipkart delivery"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "This is a gift for my wife. She preferred the green colored iPhone, as it is a new color introduced by Apple.\n\nAvid user of IPhones for the last 6 years starting with I phone 5S.\n\nShe started using the product immediately after we received it & she loving it.\n\nRefer to my ratings as per below:\nDelivery Time: Amazing (3 days)\nLooks: Awesome. Exactly same as it was shown in the portal\nValue for money: satisfied. I got an instant discount of Rs 6000/- on the m.r.p (hdfc cards). Definite recommen...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "I got this for 45 k on flipkart sale....only downside is we have to buy charger and earphones separately.... Due to this pandemic period,,some states are doing lockdowns,,it's hard for us to buy genuine charger from iplanet as they are closed......but Best deal I made... I'm satisfied with the product...thank you flipkart for nice packing and fast delivering the product"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Everything is awesome about this phone except the following:\n\nNo fast charger\nNo fingerprint scanner\nYou still need to swipe up manually after face unlock"
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "ALL PRODUCTS IS VERY GOOD BUT THEY MUST PROVIDE A POWER' ADAPTER. THIS IS VERY DISAPPOINTED"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Value for money...battery backup better than 12"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "In love with this iphone great performance,camera ,battery everything. Go for it have a uncompareble battery backup, no doubts in iPhone camera here You can see the picture which is shot on my iPhone In love with this iphone great performance,camera ,battery everything. Go for it have a uncompareble battery backup, no doubts in iPhone camera here You can see the picture which is shot on my iPhone In love with this iphone great performance,camera ,battery everything. Go for it have a uncompare...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Love 💗 the phone"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Overall satisfied, but a huge price difference between 64. & 128.. That's not done"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Awesome Phone 📱 !! I phone 🔥🔥🔥"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "So good look comfortable iPhone 11 I am so very happy my life first time iPhone used camera is 👌 sound quality is clear sounds"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "First time experiencing i phone. Good experience"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Amazing to purchase dusting the sale . Else you would feel \" ahh should have taken earlier\""
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Value for money..with super added features.."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Love it"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Awsome"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Amazing"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Best Camera, good speakers and I guess green is the best color. Oh..yeah..good battery backup too"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "I will just say its an awesome phone. Starting from speed , battery life, resolutions, camera quality, features it is superior in all department versus its predecessor. Also would like to state that at this price point it is an extraordinary value product. Recommend anyone who is looking for a highend smart phone within a range of 60k to 100K. ."
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "Overall phone is good but my point is as per feature wise if you compare then it's over priced. Camera is normal. The maximum retail cost on this phone is sixty four thousand nine hundred and flipkart is showing sixty eight thousand three hundred on their website. It's completely misleading information and indirectly cheating with customers. Be aware guys."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Amazing phone i am so happy thank you filpkart"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Awesome product 😘❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Cool"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Value for Money product over-all Product Quality is Good but when you connect in Charging that time Handset is overheating"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Value for Money"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Thank you flpkrt"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Although quality of product build everything is superb but facing heating issue during charging with 20w Apple adopter. Plz suggest what to do."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "This is my second I phone on flipkart order awesome unique feeling proud 🌺🌺❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Super battery quality"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Please improve Better Backup"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Awesome mobile and original product\nCamera ok\nBattery just ok because slow charging\nOverall good mobile value for money"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Nice one but its getting little bit heat"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Awesome looks"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "I bought iPhone 11 On March 2021, And I am Writing this review after using the phone for 4 Months. I would Say Everything is fine, Top Performance, Nice Camera as Anyone would Expect from any series of iPhone but when the Question comes to Battery it is complicated. The Battery is fully optimised and it comes 3110 mAh capacity but the problem is with the charger. Honestly Apple Removed charger from in Box items in the name of Environment and they are also forcing us to buy any 20W PD 3rd part...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Was a little worried about display before buying coz of its low resolution and lcd type but after using it in hand took away all of it. It is a very high quality lcd display and the resolution is perfect you wouldn't notice any pixelated objects on screen.\nAnd everything else in this phone without a doubt is best in the industry.\nVery happy with my purchase.\niOS experience is awesome."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Great Camera, nice display.\nHowever no adapter and no earphones."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Top notch quality phone"
    },
    {
      "User_Rating": "1",
      "Title": "Terrible product",
      "Comment": "Within few months, you will need to replace some parts"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "excellent mobile phone with amazing feautures. 100% value for money.The greatest attribute was its battery(all day long usage). dont hesitate to buy. Only difference between 11pro and 11 is display and its telescope lens remaining all are same"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "1 week of use I must say this is the best although it could be better if they provided Earpods too as an Android user I didn't have one and have to bought extra. Better buy at offers and sales it would be good for budget."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Osm product ✌️"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Amazing picture quality, I love it 😘🥰😍"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Beast Phone.\nCamera - Quality is best in market. Capture every detail of an object without losing the quality. Also it can shoot video's upto 4K at 60fps.\nDisplay - 6.1 inch Awesome flawless true tone display.\nBuild - Glass finish makes the iPhone scratch free. Slippery in hand, must have a good quality case.\nPerformance- I don't have to to say anything, no other brand phone can match this iPhone's Performance.\nBattery- Only flaw i have found that, the performance of battery is not upto t...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "It is great. Its battery drain is low when you charge till 100. 100 to 90 the battery is superb. After that it drain like a bullet train"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Stunning 😍😍😍"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "performance vera lvl camera was nice, but heating issue konjam eruku, 720 lcd display nu kamdupudika mudiyala vera lvl display....over all value for money"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Superb camera performance"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Absolutely amazing phone. Highlight being the superb camera, sound quality and performance"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Awesome"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Awesome mobile....this is my first I phone.. my wife was gifted to me my dream was completed to my wife....I am happy for this purchase I love this phone ...the delivery man was good ....thanks to apple and thanks to Flipkart"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "The product is great as its an Apple. Packaging was worst, it looked initially as an open box, I checked the coverage on Apple with Serial No., it was Ok. However, they should improve the packaging and take care how its being delivered."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Phone is superbe... i would fst of like to speed delivery"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "I have been an android user till now. This is my first iPhone. I just love it. IOS UI is so smooth and buttery. I got this phone at a whopping offer of 45k. I couldn’t find a single issue till now. Battery is lasting for 2 days maximum which is more than enough. Camera is the best. This is the most powerful processor and everything is so fast and smooth. Gaming performance is excellent. No lags or issues in gaming. Dual speakers are very loud and 3d music experience is awesome and movie watch...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Raw power n performance. Perfect choice considering value for money. Definitely one of the best to get. Loving the experience !!"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Its Like Dream Come True😍"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Happy with the product"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Phone is really awesome. I am writing this review after using it from 3 days. I’ve switched from op6 so it feels a little bit heavy. Performance wise no complaints.you’ll never regret after buying it.\nDelivered in 1 day. Good job by Flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Good phone"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Amazing performance"
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "happy Happy Happy , its li dream cum true...\ngenuine product with good price"
    },
    {
      "User_Rating": "3",
      "Title": "Does the job",
      "Comment": "Apple iPhone as usual is a great product. I can rate out of out. The delivery person from Flipkart first time gave bad experience with rude behaviour .. no\nPatience at all. He was saying within 10 minutes to be at home but came after 2 hours that too scolding us when we called and enquirers whT time he will come home. Requesting flipkart to appoint customer friendly delivery guys."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "I have got this phone at 30k in big billion days sale .\nI have been using this phone for 3 months now .\nBattery : 1 full day with medium use\nDisplay ; awesome\nDesign : 5/5\nI have used iPhone SE earlier and used android later . iPhone usage experience is definitely higher\nI highly recommend this phone if you are getting at good deal ."
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "Good i phone 11"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "I purchased this phone for my Father..\nIt's awesome Phone...\nGuys don't buy XR this phone is better then XR"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Nice 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Worth of money"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Finally my dream phone first iOS\n..\nGood service , delivered so fast (in just 2 days )\nGotcha 37 k on big billion sale 22sep\n.....will update product review soon ..\nHappy customer ; )"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "It's good"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Superb Camera"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Nice product speed is nice ,camera is very gud and overall best breand"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Awesome"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Product is definitely good.\n\nI want to comment on flipkart’s delivery\nDelivery rating (-2) for delaying the order for 2 days which is 200% error in your delivery."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Super product"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Very good phone upgraded from iPhone 7 plus"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "I am very happy to purchase this phone performance is Good 👍 Battery is also very Good ."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Phn is good no remarks but battery health condition is decreasing fast\nI am using mobile from 3 months with in three months the battery health is decreased for 5 persentage"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Thanks Flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Just osam product 🥰🥰🥰"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Best under 50K.."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "First Apple Phone, Fastest Delivery. Thanks Flipkart Great Service"
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "Battery quality is not upto the mark, else everything is as expected"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Apple is always the best mobile. Delivery by Flipkart in one day."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Lovely"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Very good camera"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "My first ever iPhone I loved this awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Lovely"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Very good camera"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "My first ever iPhone I loved this awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Good"
    },
    {
      "User_Rating": "1",
      "Title": "Unsatisfactory",
      "Comment": "Please don't buy from Flipkart\nMy phone got auto off while using is unable to switch on.\nIt's just 7 days old."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "value for money"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Just wow! Got it at 44k"
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "Facing battery issues with in 2 month"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Wonderful experience"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "absolutely stunning.... looks so perfect in hand.. in time delivery by flipkart and continuous customer support for any doubts... this phone definitely raise your looks..."
    },
    {
      "User_Rating": "1",
      "Title": "Worst experience ever!",
      "Comment": "Sorry to say I am really disappointed this product by not recommended anyone"
    },
    {
      "User_Rating": "3",
      "Title": "Does the job",
      "Comment": "Heating issue"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Camera awesome.. Battery backup very Good compared to old iPhone.. totally it’s worth for money……"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Nice"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Thank you so much ❤ I am super happy with this product❤"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Finally Purchase My Second iPhone 11 Black Edition Love This Phone Thanks #apple❤️😍#iPhone11"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Amazing product. Go for it"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Wjust wow"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "As always awesome product by apple , performance is great as A13 can do any job u throw at it. but if u want to game and continuous watch netflix / youtube then battery backup is not par to the price of mobile, average battery life"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "THE BEST PHONE UNDER 45K JUST SPEEHLESS FOT THE LIGHTING DEAL"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Value for money.camera quality awesome."
    },
    {
      "User_Rating": "3",
      "Title": "Decent product",
      "Comment": "Could have included charger specifically for India since it is very expensive for a 4g device costing 50k"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Awesome mobile go for it no doubts about it and becz of many fake stories im really scared of buying it on online flat forms but I have trust on Flipkart and Flipkart proved it thank you Flipkart"
    },
    {
      "User_Rating": "2",
      "Title": "Expected a better product",
      "Comment": "Display with notch is irritating in 2021."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Best in class! Satisfied,thanks Flipkart."
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "DISPLAY QUALITY IS NOT UPTO THE MARK.\nMy Primary device is VIVO V20 pro which has a better oled panel."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Super"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Awesome product 😍"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Nice phone, decent battery backup overall camera is good but there should be more features needed in the camera."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Switched from iPhone 6 iPhone 11 and it’s awesome 💥❣️"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "One of the best in this price range go for it without any doubt. everything is good in this phone except battery life, it could be more my 2 yrs old one plus 8 battery life is same as i phone 11 but it is sufficient for the whole day if you are not a heavy user .."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "So nice"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Nice"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "The delivery arrived within 3 days of order. The customer service was very good. Ekart logistics themselves made sure that the product is safe. Got it in 47K. Preety low as compared to launched price. It's perfect till now. Just don't forget to buy charging adapter and headphone splitter if you don't have bluetooth headset.\n\nUpdate after 3 months use:\nDon't Buy any other accessories other than MFi certified. I used various 3rd party non MFi accessories, and it was just waste of money.\n\nIf yo...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Not charger earphones...cable only mobile in the box...bht nice i phone"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "an osm product ...red is my fav😍"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "This is unbelievable!! Waat a phone great !!"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Great product"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Nice image"
    },
    {
      "User_Rating": "1",
      "Title": "Worthless",
      "Comment": "Internet diconnected every time automatically."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "#The Best Camara\n#Great Battery (must needed in iphone)\n#Display is not too good (not good viewing experience)\n#No lagging and no heating\nOverall its *iphone* and only for premium users so you must not compare this with any cheap phone with so called overloaded features."
    },
    {
      "User_Rating": "5",
      "Title": "Absolutely Awesome device",
      "Comment": "Apple at its best, this is how you can define this device.\n\nCrazily fast performance\nGreat Camera\nGreat Battery\nSuperfast Face id\nAwesome looks\nGood screen quality\nSlightly heavy though but doesn't trouble once you get used to it.\nThanks Flipkart for a fast delivery."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Superb , very nice thank you Flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "My first iPhone. I just loved it. Great performance, great camera. Great battery life ❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "I am very happy 🥰🥰🥰🥰"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Awesome phone.."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Best product at best price"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Good one"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "what would be say about it...it's apple🤩🤩 excellent product"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "1st of all thanks to apple .. nice product was launched...product also good...\nCamera was good"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Its been one month I am using it and really happy with the purchase, camera, performance, battery scores full out of the expectations. Display is the one of the things lacking behind in terms of video experience, graphics of games, though I was samsung user earlier so to compare with samsung display is not worthy here. Overall happy with this product, thanks to flipkart as well."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Good Camera"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Awesome phone with awesome looks. Value for money but only camera is not that much of worth. Camera quality is just fine compared to android phones. But when we talk any specific brand like APPLE then cnt compare it with any other phones .\nHurrrrah !! Amazing phone for amazing people."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Superb Phone❤️"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Working as expected"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "This phone gives an awesome feeling and confidence."
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Well.... i got brand new phone from Flipkart... that was my utmost concern ever since i had ordered this i phone... some negative reviews made some of my past nights sleepless.... although i may be one of those fortunate ones who got new phone... one less star is for late delevery as well as for a bit low battery performance than i expected... rest it is great product so far from Apple..."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Superb"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "nice phone"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Charging time is more."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Worth of buying go for it!"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Just upgraded from 6s to 11. Yes its been a long time and also a good decision as this phone provides hell lot of a performance. Camera is awesome, battery life is more than 1 day after heavy use, display and touch are too good. Apple could have given 18W charger instead of 5W. Overall its a must buy"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Dreams become true🥰\nSuprb grip and smooth processes❤\nLoved it🤞"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Nice phone\nCamera quality is awesome 😎\nBattery backup is good"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Super 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Superb mobile, latest model of iphone is too good. Everything is too good just the battery is less and the charger these people are providing are the old slow one. That is the only negative point. But still it is too good and if you want to buy an apple iphone then this is the phone, just go and grab it."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Extremely good for daily use or official purpose or entertainment whatever you do with this phone is just butter smooth."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Feeling awesome after getting the delivery of my phone. Dual speakers makes the sound quality very loud. Amazing!!"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Phone is excellent. I was already using iphone 11 for past 1 year. Only thing in which apple has disappointed us is the missing charging brick and earpods in the box. This again calls for an extra cost to customers."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Superb phone 👌👌value of money 👏excellent performance 👍feeling😊 comfortable"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Best phone and deliver was also best"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "It got everything you need in a phone\nPros -\n1 best camera\n2 best performance\n3 best battery life\nCons\n1 Lcd display could be better\n2 little bit pricey"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Awesome Phone. Slightly high price but worth. Better than iPhone XR.\nCamera is superb and wide angle camera is very clear.\n12MP selfie camera is also very good.\nA13 Chip gives a very good and smooth performance."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Very nice product looking good"
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Best camera"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "I have been using android from last 9 years and this is my first iPhone and they are good camera multitasking games even display is great though an lcd panel but colours are rich and vibrant.\n\nOne liner - A premium device with all features. 🙂"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Great phone, super performance, u will have all features of i phone 11 pro 1 lesser camera and lack of qhd screen doesn’t matter will save your more thn 30k Rs.\nDoesn’t makes a difference than i phone 11 pro just 1 camera less could save your money with all i phone 11 pre look. If u want to save more money i strongly recommend for i phone Xr its not so far than 11 just name sake and look.\n\n1 U have wast of money to burn then go for iphone 11 pro\n2 U want to save money with complete feel of ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Amazing phone but need more specifications"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "I genuinely liked it. One of the best mobile phones I have used. It's sho smooth and it's security is very astonishing. Plus it has a very good camera quality. so overall it's a win win."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Good camera, speaker (dolby supposed), battery, faster processor, decent display"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Simply wow the camera, battery backup, gaming performance, display quality and most of the value for money.... I would recommend this phone to any one who would like to move to the iPhone world. ✌️"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "The phone is really super trust me\nI used apple since iphone 4s and i could say their product is really fantastic beside you can choose note 10 also but for IOS lover iphone 11 will be better,\"."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Amazing Phone and complete value for money. Everything about the phone is really awesome especially the sound quality and camera."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "camera is just awesome... display is also good....good battery back up...iOS is fast and fantastic....only bad thing is charger they have given takes too much time...otherwise a good option to choose"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "the best choice i have taken in my life... except the Screen you will love everything... if you have other apple devices like ipad apple watch etc you will love it"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Nice"
    },
    {
      "User_Rating": "3",
      "Title": "Good",
      "Comment": "Simply best performance...\nAwesome camera\nGood battery\nGot @ 44999/-"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Awesome camera… ram management top notch….. love it"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Fantastic I Phone 11 Good Camera"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "most powerfull beast is iphone 11 u can play pubg in 60 fps without any lag on high end setting and camera have more options for you for capture image like a professional 4k 60 fps is best for video shooting and u can also get potrait where u capture your images with potrait filter."
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Nice but price to high"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Excellent Camera Quality"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Awesome mobile, it fulfil my wish"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "So sweet photos and phone"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Awesome phone with extra ordinary features,\nSound quality is superb."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "There is no heating issue while using 5w charger. It does heats up a little while using 18w charger, but it doesn’t get as heated as OnePlus or other android devices(have been using OnePlus for 3 years). Image quality and video stabilisation is best in market."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Great Phone, I am using mobile phone since 1999, this one is best in all. Very smooth and powerful, Flipkart is best place to buy. Flipkart sells original Apple Phone and with offers. Thanks Flipkart team."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Simply Awesome"
    },
    {
      "User_Rating": "1",
      "Title": "Just wow!",
      "Comment": "It's a original apple product but little bit depressed to see made in China, now India is more capable to make better things from China.... Otherwise every thing will be gud"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Awesome Best iPhone 😍👍🏼"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Absolutely great device !!\nAm loving it and its value for money withh superb features and camera❤️👍\nGreat battery life"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Excellent work"
    },
    {
      "User_Rating": "3",
      "Title": "Good",
      "Comment": "Speaker problem, very much disappointing 😞"
    },
    {
      "User_Rating": "3",
      "Title": "Decent product",
      "Comment": "From my point of you ..you should go for iPhone 12 and above them..bcz iPhone 11 has low battery performance..and have 4G which too outdated ..the camera is not full optimised and have heating issues also while gaming or using camera"
    },
    {
      "User_Rating": "3",
      "Title": "Good",
      "Comment": "After 7 months use, i can say as per first observation, i am facing so much issue with battery. Its draining too fast."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Awesome 👌"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Amazing purchase Everything about phone is good if u want to switch from android to iOS\n1.Camera Is Good\n2.Performance is Good\n3.Display is very nice\n4. After 1 nd Half month use I can say battery is fine like it can Go for whole day for normal user For gaming it may vary\n5. In hand Feel is Amazing"
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "First time using iPhone,\nPerformance is really good\nCamera- not bad, portrait mode is not good as other phones, video stability is really amazing"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "okey"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Received product before the delivery date performance is very good value for money no problem till now camera is also good but the screen is lcd which is not good and irritate some time so you have to compromise the screen Flipkart services is good and nice"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Awesome mobile value for money"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Awesome phone nice looking in white colour i m fan of its processor camera and battery life....."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Amazing performance......the brand speaks for itself"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "It runs smoothly. Battery life is awesome and camera is the best."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Satisfied"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "good quality"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Best phone is this price."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Fast delivery by Flipkart.\nAs a first time iPhone user following things I noticed\n1. Camera quality is just superb in indoor lighting conditions.\n2. Very fluid iOS experience\n3. Battery life is sufficient for normal user\n4. It would take some time to get used to iOS for an android user.\n5. Apple don’t supply charger with the phone😡.\n\nOverall satisfied with my purchase."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "just love to use Apple ?"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "It's my first time to use iOS phone and I am loving my upgradation 😍😍 I love the color, I love the assebility of the phone....I need to learn more about its functionality, but as far as I have seen, it's quite easy and it has a lot of functions to work on, specially if you are a content writer or a blogger you get a lot of content creation platforms and they are really amazing.\n\nThis phone not only for good quality photography but a lot of other task too.😍💯"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "i was confused between 11 and 11 pro. i was going towards 11 pro, but the screen size was not enough for me.\nAnd i saw 11 in the showroom. i didn't find much difference in screen quality.And cameras seems to be ok with me. And i saw offer's in flipkart and made the purchase.\nthe device is fabulous. The hardware and software quality is excellent. The new iOS is something you need to experience yourself. The drawback i found was absence of fast charger, but the pricing can compensate that. Am...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "It’s my first iPhone and I like it’s response time"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Camera quality osm"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Excellent phone in excellent price 😍😍😍😍😍 LOVE IT."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Osm Apple hai Bhai"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Its amazing phone i ever seen"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "If I consider it just as a smartphone, it's pretty expensive. Have to admit that I payed a lot of money just for the brand. I understand people use apple products for years and if we consider the time span the phone is also worth for the money. But, there are also phones available under 10k and runs for years. Yes, it is true.\nBuy, this phone only if you want to show others how much you earn, otherwise it's nothing but just a smartphone like others are."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Such a great phone good"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Its First I phone and literally loved it"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Very good"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Thanks Flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "I got this phone for good price hence 5 star for it , and over quality is good because the price to buy iphone was worth at 41000"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Worth every penny! Amazing camera with amazing performance. Go with it without any doubt 💥"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "No words for this || ITS AWESOME ??||"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Nice product good camera but bazzels are thick"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "In this segment best phone forever"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Apple iPhone don't want any review."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "The best phone I have ever owned!\n\nCamera: Rear camera is one of the best in the industry. The front camera is7/10. My Poco f1 with Google Camera mod took better selfies.\n\nPerformance: If you are moving from an android device, the performance is unreal. The sync between hardware and software is unreal! There is virtually no lag at all. All games run on it smooth AF! Bluetooth, WiFi performance is superb as well.\n\nBattery Life: Getting close to 7-7.5 of screen on time. Very good in comparison...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Performance of in this phone is mind blowing...camera quality is too good...and most important thing...value of money👌👌👌👌👌...this is my 1st iPhone...thanks alot Flipkart...1more thing I m the xtreamly miss apple earphone😕"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Very nice😊"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Nice 👍 😍 working thanks"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Very nice"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "IPhone is iPhone no comment"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Best phone ever"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Flipkart delivered in 24 hrs in a well packaged box. The phone itself is smooth and buttery with class. I am returning to iPhone after 7 years using android and my decision point was peace of mind software support for next 4-5 years. I am so glad I did. Instead of spending 50k+ on an android flagship iPhone is better. Yes not all android apps are available in iOS but user iOS experience blows away. If you there for new flagship phone go for it."
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Its to good"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "You really need a review!? Just shup and buy this thing!"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "If u are upgrading from an older iPhone, the only thing that you’ll notice is good is night mode. It’s the only reason I brought this model over iPhone X. The camera quality is great as usual like other generation iPhones. Feels solid and a tad too heavy, after using 6s for 4 years."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "The 60Hz display still feel smooth, thanks to the UI optimization by Apple. Performance and camera are much better than Android counterparts."
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "With the iPhone 11, that's even more true than before. It's still the people's iPhone. It has faster performance, an ultra wide camera, night mode, an hour longer battery life,"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Awesome phone, great display(may not be a OLED)...very fast processor...taking portrait photo is the real joy."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Speachless... Just owo❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Superb quality of phone ❤️"
    },
    {
      "User_Rating": "1",
      "Title": "Don't waste your money",
      "Comment": "Received a defective phone. Didn't switch on the same evening I received. Icare people are not ready to replace the phone. They are only doing repair and give me the same phone which I'm planning to use it for the next 2-3 years. Great apple..."
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Nice"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Good performance"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "After 6 month use. I can say why iPhone are the best"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Totally in love with this ❤ the camera quality is amazing just love it 😘😘😘 itsss dammnnnnnn amazing... Must buy iPhone 11 this is my best experience ever ☀👌👌🧡🧡🧡🧡🧡 thanku apple ❤"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Very nice phone"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "The product is nice otherwise but just the glitch that it blanks out while using, automatically and takes nearly a minute to revert back to normal"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Like a good performance"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Top"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "good"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "I was a bit confused weather I will get a original iphone or not but as many people says flipkart you get cheated sometimes, but I took a risk and order iphone 11. It's a original product, good quality, quick response from the customer care, packing was good and safe, the phone works very well,\nThankyou flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Overall its beast at this price point cause in this price point no andriod can beat this beast and the product was delivered perfectly delivery boy was good and without any hesitation it was delivered and unboxed infront of me so my trust in flipkart is grown up thank you flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Nice phone"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Overall its beast at this price point cause in this price point no andriod can beat this beast and the product was delivered perfectly delivery boy was good and without any hesitation it was delivered and unboxed infront of me so my trust in flipkart is grown up thank you flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Nice phone"
    }
  ]
}