{
  "search_query": "iPhone SE",
  "total_reviews": 146,
  "Overall_rating": "4.5",
  "Total_ratings": "1,54,684 Ratings &",
  "reviews": [
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Great device. Let me tell the Pros..\n\n1. Superb build quality\n2. Great display.\n3. Camera is great in good lighting conditions\n4. Processing is great.\n5. Sound is superb.\n6. Call quality is great.\n7. Red colour looks superb.\n8. Portrait mode photography is Superb."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Who all loves older size i.e., 4.7 inch type should definitely go for this. Nothing is better than XR, XS or 11. Best for price and usage."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Great camera for pics and videos\nBattery life is good so far with some setting turn of which i never use and when i use i turn those on and i use it in power saving mode all the time so a full day with light gaming of 1hr or more using camera for 1hr or more listening music in my car on youtube and Bluetooth on for couple of hours it gives me full day of battery varing from 4/5 to 6/7 hours sot per day\nPerformance is top notch plays every game and every task with ease\nVery premium phone look...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Phone is really good and camera is also good"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Awesome Yaar"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Can be surely preferred as your first iphone\nValue for money\nSome what battery is not sufficient but as we already know about the batteries of iphone\nCamera is up to mark but there is insufficiency of night mode wideangle mode but that’s ok its not a big deal\nDisplay performance is good enough\nOverall lookup is impressive and off course attractive\nSpeakers are mind blowing dual speaker setup which is quite loud compared to others\nAt this price range this phone is best if you are intere...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Awesome Camera with Great specifications"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "One of Best phone in 2020..Excellent Camera and Performance..battery also good without Games..Thanks u Flipkart Best offer and fastest delivery ."
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "This is the first iPhone I hv bought .. It’s bit diff for me using this first first as for so many years I hv been using android.. but I am actually liking it .. The camera omg it’s really awesome .. like it feels classy using this .. Battery is also as of now good enough .. I am writing this review after using it for 40 days.. if anyone is thinking of buying this pls go for it ..\nThanks."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Camera,display&performance is OSM🔥"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "good"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "This iPhone SE is the best phone ever you get. Beautifully designed gives a classy look in your palms. Moreover, performance wise it is a benchmark. You will not be disappointed in this budget. My purchase point was its size. If you are looking for the same you won’t be disappointed.\n\nI strongly recommend this phone to people who is more work oriented. Game loves should skip this phone as this is not a game phone.\n\nBest features with stunning looks & performance.\n\nBattery life is very good...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "I jumped from old SE to the new SE.the screen to body sized ratio is perfect for usage for a medium size palm.\nThe highlight of this product is it’s elegance and sleek design. Looks so good in white colour.\nPerformance is well packed with well coordinated GPU and CPU.\nIf u are using bezel less phones then u might not consider it. But if u have decided to buy it then this product will bring a huge smile on your face in terms of speed, CAMERA, looks, iOS ecosystem and longevity of this devic...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Mind blowing"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Ultimate performance\nDecent camera\nCompact mobile\nGood speaker sound\n30k budgets\nValue for money"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Performance is awesome\nCamera is awesome\nLittle more battery could be additional advantage"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "My 2nd iPhone 🥰❤️ I just love it💖"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Awesome mobile"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "nice small size slim mobile,awesome camera awesome performance value for money, thanks to Flipkart and Apple"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "Mobile is very handy. Packed with good performances and nice camera. This is my first iPhone. Very good experience with Apple. Battery is worst. I am hardly getting 5 hours screen on time. Positive thing is I came to know how many hours I was spending on my mobile. Because of poor battery now I am only using mobile for 4 hours a day."
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "SE IS GOOD MOBILE and camera result is best my first apple mobile but very good like better android and other device. U have apple so don’t need to camera"
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Every thing is superb except the battery"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Stunning camera... go 4 it.. no need of any editing or filters"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Here is my Review:\n\nCamera = Awesome\nPerformance = Awesome\nSize = Best\nDisplay = Average\nBattery and Charger = Below average"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Camera performance is fantastic😍😍"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Best🥰🔥😎"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "This is my second iphone after iphone 4s. I’ve been a long time android user in between. I’ll tell you who this phone is for. Prospective buyers can then decide\n\n1. For photo and video enthusiasts. Very reliable camera. Fast and excellent picture quality. Videos are absolutely stable and professional quality. You would be amazed how many people shoot Youtube videos on an iPhone. The only downside is that the display doesn’t do justice to the photos and videos you have taken. Night photos are ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Wanted a small iPhone with home button specifically,, this isn’t small at all!! Great handy phone with amazing camera settings.. Thank you Steve!!"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Super image 4k photos, 18 hour battery also extraordinary, small pocket filling, faster processer."
    },
    {
      "User_Rating": "4",
      "Title": "Love at First Home Touch",
      "Comment": "Totally worth the price if:\n\n- you are a iOS fan\n- like compact phone\n- want to switch from android to iPhone\n- you like clicking some good photos (camera is unbeatable)\n- you multitask (normal phones get stuck between apps, this will keep you going without a hiatus (lag)\n- you like to listen to music (have 2 speakers, one on the front, and another below; when I watch a movie with 4d-5d music, it feels like Dolby atmos)\n\nThere a lot a technical advantages too which I dont want to get into (yo...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "As always compact and handy ... with good image stability\n4K gives amazing experience\nBattery capacity is little poor ..\nit’s worth buying on this budget..\n4/5 my rating"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "It’s a beast in performance, only thing that I didn’t like is it lacks night mode for low light photography. Battery backup is quite average only light to medium users can live with it, not meant for heavy users. It can handle each and every task very easily. Doesn’t break a sweat no matter what you throw at it, whether a heavy gameplay or exporting/rendering of heavy videos. Fits perfectly in pocket as well as in hand. I’ve been using it for more than 9 months. It is really a great device if...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "This is a beast. Smaller yet powerful. Sleek design and a Beauty.\nI will give straight reason for:\n\nWhy to buy?\n1. If you want an iPhone\n2. If this is your first one\n3. If you want a small screen phone just for working purpose no entertainment\n4. If you have another phone as backup\n5. If you have other apple products and you want to pair this up as your latest purchase.\n6. If you have a decent 42k to spend without any second thought.\n\nWhy not to buy?\n1. Battery drain, and low battery capacity...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Loved it!\n12 MP single camera does its job better than many flagship camera phones. Very compact and perfect for single hand use. Battery lasts at least one day for a normal use."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Overall good\nBattery life is average\nDisplay is average"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "iPhone SE 2020 Looks premium😍\nBattery:-Most of the people think it’s only 1800 mAh battery???? Is it sufficient??🧐\nAfter 8 days of usage ..!\nin 100%charge\nI have played lots of game especially pubg\n3Hrs of pubg with fully charge\n6Hrs of Heavy usages also played 1Hrs of pubg\n14Hrs with normal usage like .,movie,what app,Fb,Instagram and Twitter and call\nCharging time:- takes more than 2.5hrs with box charger and with 12w 1.50Hrs\nPerformance:- Same like iPhone 11,11pro,11pro max (A13bionic...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Apple is Apple.must buy....camera better then all .please refer below some of images"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Flexin' on the new Iphone SE 2020💛"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Camera quality is best ."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Performance is good with A13: display also good but battery backup is bad...."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "I just loved it❤️\nHandy phone camera quality is awesome\nWithout any doubt go for it"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Amazing phone with beast performance and super value for money if you wanna be in apple eco system this is great device for you."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "best compact phone i ever have.It has pretty good camera and performance.I have iphone 11pro but now i fall in love with this phone.Best phone👍👍.Go for it if u love small size phone👍👍👍"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Best camera phone\nImage processing is best\nBest display and battery life is also best\nBest processor\nOverall best phone\nU can look after images also"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Greatest phone for who looks for power in a compact form! Camera is outstanding, Check the samples."
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "If you are going to use apple for first time then you will be amazed. Performance wise this phone is ultra first. Camera is also pretty good, attached images were taken indoor only. Display is also quite good.\n\nThe BEST thing about this phone is it’s size. So easy to use this phone singe handedly. Excellent grip. Fits very crisply in pockets.\n\nThe worst thing is it’s battery. Doesn’t last long. Better to have a power bank to avoid sudden switch off."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Handy size\nStunning performance\nOutstanding camera quality"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "People talk about it’s battery backup?? man I’m in love with this handset. So clean, so smooth. Smoother than xr if you’ve used both you’ll understand. Camera better than xr. Battery of xr is better but still I’ll vote for se because of A13 Bionic chip, touch haptics and many more reasons. Its a beast in this segment. Still I want you all to feel this beast in your hand. Sexy as it looks, just a perfect masterpiece."
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "Keep the battery aside and I don’t see any other reason why you shouldn’t buy it. It’s super fast, has an awesome pair of camera, punchy speaker, good looks, beautiful screen, perfect size and an amazing user experience. Everything about this phone is no nonsense.\n\nComing to battery, I was aware it was less but I didn’t care because for my casual usage, it easily lasts 24hours. It easily gives an onscreen time of 4 hours per day and if you are using your phone for more than that, you know you...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Camera is best. Mobile performance is good. 4.7 inch display phone is handy phone. Battery capacity is not good but in this range phone is good . Dual sim phone and one sim slot supported eSim. Better series in iPhone is X ,XS ,XR and 11. Software iOS 14.3 is latest."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Nice product 😎😎\nOsm look😍"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Excellent\n\nAmazing👍😎"
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Canara quality is good\nPerformance is awesome\nExcellent for gaming but small screen\nAnd battery performance is not much good\nTotally product is nice I loved it 🥰🥰🥰😍😍"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Amazing camera super iphone se"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Full of exciting features🥰🥰"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "It is a very good device. You will feel how premium is it whenever you hold in your hand. It is very nice to hold. And size is just perfect! Above all it has the best camera. See the attached picture which I clicked in the evening.You should go for the red one!"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Been using it for almost a year now. I switched to this phone from Samsung galaxy a50 and it was really hard getting used to a 4.7 inch screen from a 6.4 inch one. However, with time i got used to the display and it feels just like any standard display. The display panel is 750p which would look blurry if the screen of this phone was bigger. As it has a smaller screen the pixels are packed close to each other which results in a sharp looking display. Coming to the battery life of this phone, ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "So fast as light classy premium look at affordable price thank you flipkart for easy delivery"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Top"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Good"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Good for normal use like browsing and not recommended for gaming because of small screen size,overall a good product from apple."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "I love the camera quality it very good"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Wanna small,handy, cute phone ? Just go for it. Not for gamer's, but for simple usage and premium class phone."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Very nice phone. Actually it's my first iPhone so I was very excited. Nd I'm happy with this phone.\nNice phone for gaming, battery backup is not that much for gaming but I suggest buy one good powerbank or fast charger. If u have small fingers then it's best device for u."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Best in the world"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Good one"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "One word.. beautiful iphone ❤️ premium feel\nJust go for it without any doubt. Superb camera, handy, white color is soo good.\nThis phone is for someone who don't like big screen phones."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Hey iPhone lovers. If you like small phone you'll love it. A13 performed like a beast. Performance is top notch. If your budget tight, then go for it. You never disappoint after use it. And Apple iPhone security is best."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "My first iPhone and very happy with it. Slick and gorgeous design with perfect compact mobile. Performance is so amazing ,display softness more than 5 *. Little bit battery issues for fast drains like need to charge once in a 12 hours. May be this will solve out in next update. Definitely worth to buy than other brands."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Good product as expected."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "What a great buy. I'm so glad I didn't fall for bad battery reviews by some teenagers. If you don't play games then this phone can last you 5-6 hours SOT!\nFor me its giving me 5 hours SOT with lots of whatsapp, spotify, twitch and youtube.\nIf you got a 9 to 5 job and don't play games then this is the phone for you!"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Let's face it. The main reason you're even considering this is because you want a compact phone that doesn't compromise on power. Getting OS updates for another 4-5 years, with a decent camera, waterproofing and wireless charging is just an added advantage.\n\nThere's a few things it could've done better:\n\n1. Battery is barely adequate for a day of moderate usage.\n2. The bezels could have been reduced to have more screen to body ratio.\n3. Night mode for the camera was a software feature that ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Nice Product. Best camera ever."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "It’s completely perfect phone for me thank you Flipkart and apple."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Perfect in size and performance And nothing can beat iPhone’s camera 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Awesome camera phone 📲"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Excellent phone from Apple... Almost same like iPhone 7 and 8 with latest processor. I can feel the speed very much compared to the iPhone 6s. It’s awesome budget phone from iPhone family."
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Got in good price in big billion day. Overall performance is good but battery backup is not satisfied."
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "As always compact and handy ... with good image stability\n4K gives amazing experience\nBattery capacity is little poor ..\nit’s worth buying on this budget..\n4/5 my rating"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "First iPhone as per my budget, thanks to Flipkart for providing it in a discount price. Purchased it for the strong privacy features of an iOS.\nReviewing after 5 days of use,\nBattery: Need to use very sincerely or use 20w adapter for 100% charge in 1 hour.\n\nCamera: Good\n\nPerformance: Very good, 1 app to another app opening performance very smooth.\n\nSize: awesome, It's very handy to use by one palm and fingers only.\n\nKeyboard: After using 6inch Android smartphone its takes time to input the da...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Each and every Paisa you is worthy\nCamera section is a great upgrade\nPerformance is a beast\nIt’s just a old design but still amazing design to hold in hand.\nI upgraded from old SE and satisfied to the core"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "First of all thank u apple for making such good phone.\nGuys this phone is Powerhouse with best processor.\nCamera is too good in light, I mean best, but don’t expect great pics in night.\nBattery life is good according to size and display of phone, keep one fast charger with u and forget about battery issue because there is no issue with battery if u are not a hardcore gamer. It gives u full day with battery with moderate use. Charging in 30 minutes with 12 watt charger is 50 to 60%. I guess v...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "This phone is superb !!! At this budget it is very valuable. The camera,battery,display and sound everything is 100% for this budget. I am very happy with this phone. I have used it 2 months and I haven’t face any problem. I love it!!!"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "One word, Outstanding!\n\nI’ve Samsung galaxy A70 and I turned off many of its services including animations so that it give me a all day battery life but this is not the case with this iPhone SE .\n\nIt comes with just 1821 mah battery but trust me It gives 24hr battery backup which includes 4.5hr on screen time.\nMostly I use my phone for WhatsApp, insta, news articles, YouTube music and puzzle games when I got time.\n\nIt’s display is good, looks like OLED one (but it is not)."
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Nice product"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Awesome camera quality but bit disappointed with its design, upper & lower space covered area without any reason and battery is very poor."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Performance-----4. 9\nCamera-------------4. 5\nBattery--------------3. 5\nI think iPhone se 2020 is best budget king apple flagship phone todays market... Battery was decent.. Very light and completed.. Best quality"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Owasome and so handy"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "IOS that fits into your palm. Just compact and smooth to use."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Amazing phone with below reasons\nhandy screen seize\ngood camera\ngood Battery\nvery handy Seize\nworks seamlessly with macbook pro- for calls and messages.\nFast enough.\n6months apple music free\n1 year apple tv free\nDual Sim (1-esim/1Sim)\nBuy neuralcam for night photos"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "After 2 days of usage!!\nIt’s a beast!! May it be performance or camera or sound quality, it’s a total beast at its price. 🔥\nIt degrades every mid tier mobile.\nBattery maybe a drawback for some, but according it’s an excellent daily drive mobile. Normal usage would give a nice battery life.\nPower bank is proffered to be kept in hand for some.\nCamera is exceptional👌🏽\nI don’t find any cons at all, to be honest.\nThe display size is small, yeah.\nBut it’s so cute and handy to use. And it’s les...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Overall Good except display and battery"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "nice phone"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "This is my first iPhone. I would say that coming from Android, there are some times when I feel that it is restricted in certain ways and you just have to accept it.\n\nComing to the phone itself, camera is amazing minus the low light photography part. Battery backup is ok ok. I bought 12W Apple charger separately which charges it pretty fast so I do not worry about battery being low. Also since I am mostly at home, it doesn’t matter so much. Display is ok. Its a nice display but a small one a...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Super Phone\nValue for money\n\nI am both android user & iPhone user. This phone simply amazing.This is the best iPhone.\nOnly problem is charging issue. It’s need more than 2 hours to get full charge.\n\nFor Average use it’s battery lasts for about more than 12 hours for continuous browsing, Calls & Music.\nBut for a heavy use battery lasts for 6-8 hours for playing games."
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "Update : I’m getting close to 7 hrs screen on time on single charge. Of course without any games.\n\nEverything is good except battery and Night camera capabilities.\nPerformance is top notch\nI’m using Motorola power delivery charger with usb c to lightning cable to fast charge it.\n\nBrought motorola usb c power delivery charger for my iPhone SE 2020\nI’m using this along with Amazonbasics usb c to lightening cable.\nIts awesome and following are the charging stats :\n15 min 0 to 30%\n27 min 0 to 50...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "Well, the phone is small and looks nice. It's not for people who loves bigger ones. It's basically for those people who don't use their phones for everything.\nIt's fast.\ndesign is cool, sleek and beautiful. You will need a back cover for sure if you want to keep up it's beauty. P:)\nbattery life - not so good.\nvoice clarity is fine.\nI am not a gamer neither a photographer.\n\nBasically it;s a premium phone under budget so that you can say it loud - \" Hey! I own an Apple device\". If somebody is ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Fantastic product, i really love it."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Best 1 with a cool design and development.good processing as well as gud camera."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Honestly best package from apple. Super handy. I don't like big phones. This phone is perfect for me and would definately recommend to everybody. If you compare antutu and geekbench scores with of iphone 11; this easily beats the iphone 11."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Classic phone with all features packed in it."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "I switched to iphone from android its an very good option. Ios is just awsome. And size of SE is very compact. For i feel like screen size is little bit small but after use of 2 days its very nice experience. iPhone just nailed it."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Definitely go for it if you've a thought in your brain.\n\nBest compact smartphone with powerful processor and outstanding performance as always."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "This phone is very handy and light weight. Touch ID and phone performance is great. But battery could be improved and night mode could be given."
    },
    {
      "User_Rating": "3",
      "Title": "Fair",
      "Comment": "Not satisfied with the battery and performance"
    },
    {
      "User_Rating": "3",
      "Title": "Decent product",
      "Comment": "Nyc"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "I am very happy with this new version, which is actually a super-improved iPhone 6. The design is a bit different, and my old 6 case covered the camera lens, but with the new case added and everything running, she's about 3 times faster than my 6, has a much better camera, and is waterproof (even better with the case). The battery also lasts longer. Obviously the processor is a lot faster, but a lot cooler as well. I was really surprised at how fast this new SE 2020 is, and you can't beat the...\nREAD MORE"
    },
    {
      "User_Rating": "1",
      "Title": "Flipkart is cheating with their customers",
      "Comment": "Very bad experience with Flipkart - Even though I have provided them screenshot on the social media - they have refused to give the product along with the accessories - I would not advise anyone to order through this site."
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "Looks good! Performs good! Camera is soso! Battery is good. Once a iphone user always a iphone user. Back to iphone after oneplus and samsung."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Very y"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Best iPhone in this price range.It can do almost everything an iPhone 11 can do and will get long support for iOS updates.Battery life is very good very few people know how to optimise the iOS according to their needs for battery usage. So I get easily a day of use, many people say heavy usage consumes battery life that's true for any smartphone even iPhone 11."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "okay"
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "No value for money"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "This phone is awesome.\nProcessing is as much expected"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Brilliant performance everything is best if you compatible with small screen but battery is average , premium looks sound quality awesome handy phone camera quality ❤️❤️❤️\nThanks flipkart."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Authentic and genuine product at a very discounted price. Value for money 👍🏻"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "Awesome product... Super fast processor.... camera is good... cool design... Red is really nice..."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Value for money product by Apple. Performance is superb"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Battery life sucks.. everything else is great"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Will keep it short:\n\nPros:\nAwesome camera\nGreat speakers\nBlistering performance benchmarks\nThe Size (had been long waiting for this one)\n\nCons:\nDecent display (not really a con)\nNot that great battery life, but after optimising a lot of settings, with moderate usage it lasts almost for a day. For a power user, probably half a day.\n\nOverall, a great bang for buck, undoubtedly."
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "The phone is amazing according to me.. just some cons r the battery life and the big bezels .. the small phone is all I needed .. and it feels so much secure in one hand.. i needed exactly this type of phone which i can use one handed and have the beast like performance.. previously i was using a 5 inch phone Nokia 3 so the shift according to size is giving the same feel.. one thing that bothering me is the keyboard… even its approx the same size phone but keyboard is too tight to type.. it w...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "it’s a beast performance wise. period.\nJust go for it if bezels and small screen size doesn’t concern you. I like the screen size though, it’s not at small, it’s perfect and easily comes in hand perfectly.\nif you are switching from android, initially you may not like but after few days you will know why there is so much hype about apple. I am never going back to android."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Great flip card big billions day thanks"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Camera is 😍"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Great iPhone if the screen size doesnt matter\n\nSuperb camera, color vibrancy is superb, image stabilization is very good, awesome looks specifically in white color, very handy, light and slim (need to be very careful while handling), A13 bionic chip rocks and just rocks! Every operation you do is very intuitive and flawless. I would say just go for it blindly if the screen size doesnt matter for you as I had Samsung Galaxy M31 with me earlier and now I have upgraded to this which has a very s...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "Everything good..\nJust one thing to worry that’s battery life..."
    },
    {
      "User_Rating": "3",
      "Title": "It would be a deal breaker if Mobile battery is good.",
      "Comment": "Excellent Phone but battery life is extremely poor. If you use\nwhatsapp\nAttending calls average of 30 minutes in a day,\nTaking pictures\nCompletely on wifi\nUse apps like flipkart etc\n\nYou get 12 hours of charging.\n\nApart from Charging. Camera and performance is very good."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "I ordered it for my wife.\nDude its a iphone its too good.\nI was only worried about battery but it lasted more than 24 hrs. Without any games\n\nBut....\nBuy a wall adapter PD right away with this phone... Bcz its a slim package. Only typ c to lightning cable comes in th box...."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Amazing phone at reasonable price"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Simply said iPhone 8 on steroids. Love it! A13 chip shows it’s magic. 11pro mini to keep the review simple :)"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Best camera and performance 👌"
    },
    {
      "User_Rating": "1",
      "Title": "Don't waste your money",
      "Comment": "Need to exchange with higher version of Iphone"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Ultimate camera I click front and back camera photos and performance is also supper I compared with iPhone 8 which I used perversely 🔥🔥🔥😍"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Osm"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Very nice phone because of its size...camera is awsome.Bit disappointed of its battery.Performence is awsome and style is fabulous.Premium feel is there.Bazel could have been possibly removed for more screen size.Ita my first iphone and am quite satisfied about it."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Best"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "It's too powerful to use. The only problem is its size and its battery. But I should tell you that if you are going to buy this phone for gaming purpose you should buy oneplus Nord. As it has the same price and a bigger battery and a display too. This phone heats too much when you play game. You dont get a night mode in the camera but if you focus on an item and then increase the exposure you will get satisfactory photo in night. Taking about the battery I you need to charge the phone 2 times...\nREAD MORE"
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "Ok"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Worth purchasing this beast.\n\nGreat camera( only in day light)\n\nEndless performance\n\nThe only con is the battery which doesnot last a day\n\nRatings:-\nDesign - 5/5\nCamera -4/5\nDisplay - 4/5\nPerformance - 5/5\nBattery- 2/5"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Brilliant performance processer"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Best compact phone ,camera is excellent\nBattery is average\nDisplay is very nice\nPerformance is a power house🔥🔥🔥"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "I moved to ios from an android . Its small and amazing...Loving this phone ...love for iphone se"
    },
    {
      "User_Rating": "3",
      "Title": "Good",
      "Comment": "The battery capacity is too low and the phone is not a budget phone"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "I liked this phone mixture of all iphones"
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Charging point issue. Phone is not getting charged so I had to go service centre. Disapointed."
    }
  ]
}