{
  "search_query": "Samsung Galaxy Z Flip 5 256",
  "total_reviews": 49,
  "Overall_rating": "4.4",
  "Total_ratings": "836 Ratings &",
  "reviews": [
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Osm phone"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "EXCELLENT,\n\nI am reviewing this product after 1 week, display is very good, no heating issues, batter performance is very good, this time samsung optimized the battery at best, cover screen features are superb.\n\nEnjoying lot of new features..."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Amazing product"
    },
    {
      "User_Rating": "3",
      "Title": "Good",
      "Comment": "Looks good"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "I have been a samsung patron until Note 5. The flip design attracted me. Debated between flip 5 and razor ultra and went with flip, Lavender color. It is a bit heavy phone and slippery too. Ordered Spigen cases but had to return due to their slippery nature. Went with Samsung flipsuit case, expensive but found it gives a better grip.\n\nAs for the phone, it needs improvement. Especially in the transition from the front screen to the inside screen. A software update could help overcome. ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Best flip phone from samsung\nThe hinge is very good compared to older versions"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Excellent display, pretty good cover display, stunning design, previously I was quite worried about it's strength but it's Strong enough👍 battery is average (3/5) but it's performing better than what the number is (3700mah) , super powerful performance (thanks to SD 8 gen 2) camera is decent not what we expect at this price but this is a flip phone so .... finally what I would like to say is sometimes it's not just about money , using this feels fun and makes little bit happier.. but I'm wor...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Overall good phone, but world is not ready for flip or foldable phones...."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Excellent"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Overall superb phone. 1 day of use. Battery could have been better. Just 3700 MAH. Rest all superb"
    },
    {
      "User_Rating": "3",
      "Title": "Fair",
      "Comment": "Battery is worst after full charge getting only half day for regular use phone heat problem"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "So Far So Good !, 1 day review."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Writing review after 1month usage. Phone design is good, display and camera are excellent. UI is very smooth no lags at all. Performance is very good. Battery charging time is very long it takes 2.30mis to charge fully we will get about a day with moderate to heavy usage. Face recognition works fine but finger print does not work properly.\nPros : Design 5*, Display 5*, Camera 5*, performance 5*\nCons : Battery 4*, finger print 1*\nThey should have provided with back case"
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "Phone built is good even while taking photos come out well but battery need to improve"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "I love this device so much.. It is so convenient to carry around. Performance is what you expect from 8gen2. Camera is good. Battery is average to be honest, not the great not the worst. Overall it is a great phone in every aspect for me so far."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Nice Design camera superb must n should go"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Excellent performance"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "Good One and Stylish"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "If you like this kind of form factor in a phone then you'll love this phone.\nThe battery is less and won't last a full day of heavy usage but overall the phone is good."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Samsung flip 5 is one of the best flip phone that I ever seen. Quality and for factor is very good. Display is also bright but not as much as fold 4.. camera quality is also good."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Review after one week. Phone looks brilliant. Took me to older days where flip phone was there. Build Quality is good. Camera looks decent. Battery backup is average for a heavy usage. But nice one by samsung. Love the way they build the phone. Outer display seems to be really good with small display in it. Disappointment: Charger not available. Overall got it for a good deal."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Excellent phone..."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Excellent phone"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Wow superb\nNext level phone\nVery smooth to use"
    },
    {
      "User_Rating": "1",
      "Title": "Did not meet expectations",
      "Comment": "Just after 9 month, side protection of foldable screen broke. Don't buy this phone. It is not worth. If you want to use it daily, do not use fold function, just use it as regular phone."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Wonderful prod"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Amazing experience 😍\nWork so smooth 👌🏻"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Overall good"
    },
    {
      "User_Rating": "1",
      "Title": "Moderate",
      "Comment": "The display is not working after a month, the lower half of display was flickering and blacked out"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Love nice super duper"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "All excellent."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Decent product."
    },
    {
      "User_Rating": "1",
      "Title": "Hated it!",
      "Comment": "I made a mistake choosing samsung again after so long using Iphone. Its a blunder. Never again I am gonna buy a Samsung phone."
    },
    {
      "User_Rating": "1",
      "Title": "Worst experience ever!",
      "Comment": "Got it for 68k effective, 5k for previous phone and 12k for exchange bonus and rest bank offer. I've to say the functionality of the cover screen while using camera is good. But the cover screen display is not like Android, it has very limited functionality which I hate a lot. Screen brightness is a biggest issue while using outside. Battery backup is very low and the UI lags sometimes with snapdragon 8 gen 2. I liked OneUI though. No charger provided is a biggest con and expensive cases. Gro...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "This is the first samsung phone i used and first flip phone i have used and i am telling f iphone and other phones..samsung phones are the best phones you ever will use ...OS,display,functionality all are top notch ...only issue what you ll face is battery ..you might have to charge the phone so often may be whole day and in evening you ll have to charge of you have moderate usage..its head turner phone ...i simply loved it"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Mobile was excellent. D3sign was marvellous in this segment. Rich looks. Performance was nice in battery display cam was ok"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "It's top noch"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "It really amazing,pocket friendly computer with professional camera inside and many more features"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Top notch performance and superb camera.\nVery slippery.\ncrease is not that visible.\nScreen reflects too much ( glare ).\nScratches easily.\nUse a screen gaurd on the small screen and light weight case for the body.\nBattery can be better."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "The phone is great, but my delivery was delayed. As it was a gift for someone on an occasion, it made me look bad. But overall happy with product."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Excellent"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Fantastic product"
    },
    {
      "User_Rating": "1",
      "Title": "Did not meet expectations",
      "Comment": "Camera is very low quality\nAnd phone is Very Heat\nOverall phone is not worth for Money 👎"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Best samsung flip phone ever. The best part is the cover screen very useful in day to day life from there you can access and functional the phone. Too good."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Best quality phone, little bit unsatisfied with battery backup. Overall love that"
    },
    {
      "User_Rating": "1",
      "Title": "Hated it!",
      "Comment": "Very bad product... my phone display is blank 😐... very bad 👎"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Good product"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Finest and most attractive flip ever , just some battery issue still persist"
    }
  ]
}