{
  "search_query": "Samsung Galaxy S24 Plus 5G",
  "total_reviews": 199,
  "Overall_rating": "4.6",
  "Total_ratings": "6,395 Ratings &",
  "reviews": [
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Completely satisfied with purchase"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Fulfilled my expectations.\nThe Stunning Design, Display, new One UI 6.1, new AI are the highlights of it.\n\nHowever, Flipkart service is worst.\nPart of pre-booking offer, they are supposed to provide,free wireless charge, but not provided. I don't recommend Flipkart."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Mind Blowing phone go for it great performance camera is amazing you can look the shot with AI generation background was totally cleared from the crowd just go for it better than Iphone 15."
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Nice compact phone with great display and camera. Cons are heating and battery performance."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "It feels better than iphone 15"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Writing review after 2 weeks of using s24:\n1. Camera - 5/5\n2. Performance - 5/5\n3. Battery backup - 3.5/5\n4. Display - 5/5\n5. Display - 4.5/5"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Compact!!\n\nGreat Camera, Best Display and Design, Good Performance and Battery. This phone is for Casual User's who wants to use phone for 5-7 years.\n\nCompact is the word for this phone!!\n\n\nPoint to be noted.\nThis phone is not for Hardcore Gamers."
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "Review after 1 month using..\nHeating issue.\nCamera good.\nBattery decent\nCharging fast\nLook is good.\nPerformance is good\nOverall good product.."
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Liked the product. As expected from a Samsung device, it has a brilliant display and camera. The performance is great too. Phone is fast and snappy. What I didn't like is the battery performance. It's fairly decent. My 3 yr old OnePlus 9R was giving similar batter life (a difference of max 15-20 mins screen on time)\nCharging could be faster too. Expected at least a 45W capacity but still not a deal breaker\nAnother point is fingerprint sensor doesn't work properly with a screen guard. I didn't...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Performance 10/10\nDisplay and sound 10/10\nBattery is decent 8/10\nCamera awesome 👍\nBut ekart delivery service is so poor."
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "I am not happy with battery performance ..I spend 70k for this phone and everything that a premium phone can perform it did on top but battery life just ruined everything.."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Wonderful product.\nCamera 10/10\nBattery 9/10\nPerformance 9.5/10\nOverall design 10/10\nDisplay 10/10\n\nMust buy it."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "No phone is perfect, but it is better than any other flagship. Even From iPhone base variant."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Awesome phone, The design is very nice and premium."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Nice product, AI new feature awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Using it for 2 days.\nlooks - 10/10\nScreen - 10/10\nBattery - 7/10\nCamera - 7/10"
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Samsung Galaxy S24 is an outstanding smartphone that impresses with its AI advanced features and sleek design. From the moment I picked it up, I could feel the premium quality of the materials and the attention to detail in every aspect of the device.\n\nThe screen is simply stunning, with vibrant colors, deep blacks, and smooth animations that make everything look more vivid and immersive. Whether I'm watching a movie, browsing the web, or playing a game, the display never fails to impress me....\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Very bright and good display, speakers are loud , performance and camera is awesome. I love the telephoto lens, it's soo good. I'm coming from iPhone and this is the perfect product. Battery life max 4.30 hrs - 5hrs SOT. Sometimes the phone do get warm by doing simple task, it seems some kind of AI processing is being performed in the background, it's not happening everytime only some time. Overall I'm happy with product"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "I have upgraded from samsung galaxy s20 fe to this phone. This is grear in all the parameters. It gives close to reality photos in all portrait, ultrawide and night light shots. Capturing nature with this phone camera helps keep your memories in hand\nZooming is good upto 3x. It has all the AI features as of the recent updates.\nCompared to my previous phone this mobile is lighter and compact. Easy to hold for long time usage..\nThe performance on multitasking is also appreciable.."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "If you want to purchase a camera phone, then this would be the best option for you. Absolutely loved the pictures clicked on this phone. Also the display and the design is very awesome."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Best phone in this price even I compared camera quality with I phone 15 plus and google pixel 7 pro and I phone 15 plus is getting 3rd no in all 3 phones. So guyzz winner is here #samsung s24 gray colour.... go for it without any doubt......"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Good product"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Excellent phone under 50k"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Superb Camera😍😍😍\nBest Mobile😊"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Premium, unexpected delightful smartphone\nCamera and performance is good\nBattery is slightly not up to the mark.\nIt lasts hardly for a day with moderate use￼"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "After a three-month of using and evaluation, the camera and display performance are commendable. The battery capacity is satisfactory, with a combination of CPU from Exynos 2400 and GPU from AMD Super Fast. It is advised to refrain from using cheap inbuilt magsafe back covers as they may drain all your battery power..."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Camera quality is excellent. Overall experience was good."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Nice phone better than iphone 15"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Heating issue while using camera and banking app ."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Everything is so good really happy with the phone"
    },
    {
      "User_Rating": "4",
      "Title": "Fabulous!",
      "Comment": "Amezing pesa wasool😄"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Loving my new samsung s24 The camera takes amazing photos and videos and the battery life is fantastic there is no eating issue in this mobile very smooth and fast ❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Samsung galaxy s24 😘\nSuper 👌 quality"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Camera is good .. But still needs to be improve like the same other brand....\nTouch sensitive is top nortch...\nAI is pretty good ...\nProcessing speed is impressive....\nOver all is good . Price is bit high ..."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Absolutely love the S24 compact phone easy to hold on camera is awesome performance is good display is great but battery could have been little more overall the phone is great to use and can suggest that you can buy this device 🤙🤙🤟🤟"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "The phone is tremendous except, 3 issues\n1. Signal is low and internet connection is slow, No call drop, but a lot of buffering. But when in correct signal range of 5G downloads are super quick.\n2. Sometimes found to have incorrect, accidental touches.\n3. App drawer is not in list view, have to swipe up then left and right.\n\nElse a top notch phone which is easy to hold in one hand"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Overall good:\n\nPros-\nSuperb Camera\nAwesome design\nVery compact\nAi features\n\nCons-\nBattery drainage\nNo charging adapter."
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Best phone but need some speed charging support"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Phone is good in terms of performance, but heating a lot for basic use itself. Camara options need to be improved and battery performance/optimization also has to be improved. Software optimization for chipset has to be made."
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Product is good but disappointed about charger which is not given with such expensive phone"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "This phone is a perfect blend of performance and style. It's fast, reliable, and handles multitasking with ease. The camera delivers stunning photos, and the sleek design feels premium in the hand. Battery life easily lasts a full day, making it a great choice for everyday use ✌🏽✌🏽"
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "The phone is compact and performance is powerful. Good camera. The major miss seems to be the battery drain and the phone heats up but cools down well. Clearly needs improvement in battery optimization"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Nice"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "it's better then iphone 15\nCause in s24 have so much better features then 15"
    },
    {
      "User_Rating": "3",
      "Title": "Decent product",
      "Comment": "Phone form factor and camera are excellent.\nMajor drawbacks are the heating issue when using camera and the faster battery drain.\nThese may be attributed to the Samsung's Exynos processor's inferior performance. Potential buyers of this phone can buy the S23 instead or wait for the Galaxy S25 which will sport the latest Snapdragon processor which will solve both the drawbacks. S25 is rumoured to be launched in Jan 2025."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Good Design Feel Premium"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Classic product..Love it.."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Its good flagship phone and I loved itt.. very handyy moreover camera 📷 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Was looking for a flagship compact phone and found this s24 was on discount got it for 45k. Everything is really good except the Battery they really need to start using the new battery technology for smaller phones"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "You can blindly go ahead. Out of 10/10."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Using this little samsung device for the last 5 days!\nIt feels premium by the look and fill. Nobody can make better displays than samsung, full marks for the display.\nBettery and camera is decent, was expecting better out of it.\nPerformance wise is its fine, through im not heavy user.\nI'm not sure how Exynos 2400 is going to perform in the longer run.\nI faced network issues twice while the 5G was on, and I had to put the phone on flight mode to resolve it."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Very good product"
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "Great experience with premium galaxy S24"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Really loved the size of the phone, it sticks perfectly in my hand and feels comfortable. The phone is fast and performs all the basic tasks perfectly well and the display is just amazing. It's a well-rounded phone and would highly recommend it for someone who prefers smaller-sized phones compared to the large 6.7 or larger screen phones these days."
    },
    {
      "User_Rating": "3",
      "Title": "Just okay",
      "Comment": "Everything is fine except the battery life while using phone on 5g and outdoor condition."
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "Better s22 not worth for 70k"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Everything is perfect except battery"
    },
    {
      "User_Rating": "3",
      "Title": "PATHETIC NO CHARGER GIVEN",
      "Comment": "Its pathetic to know that Samung do not provide standard charger for a phone so expensive like S24.There are thousands of charger/adapter available online claiming that its is best fast charger for samsung S24.\nWho the hell will be resposible if anything happens to mobile by charging from such charger.Its last SAMSUNG phone i am using."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "I upgraded from S21 to S24, The design of the Phone is stunning and It also has an awesome display, Camera is good, Overall It's a great Phone, Will be posting an in depth review after using it for couple of days"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "The Samsung Galaxy S24's camera system is outstanding, capturing stunning photos and videos. The premium build and vibrant display offer an excellent user experience. The battery life is impressive, with fast charging capabilities. The One UI software is user-friendly and customizable. However, the high price may be a concern for some buyers. Overall, it's a top-performing smartphone that exceeds expectations."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Better than iPhone 15...\nAwesome 📷\nAwesome display 👏\nEven Good battery backup\nSmartest smartphone S24..\n🫡 to Samsung."
    },
    {
      "User_Rating": "3",
      "Title": "Decent product",
      "Comment": "Ignore the comment over battery life and heating issue..now regretting..premium phone with lacking important premium features"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Great in hand experience"
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Owasm Product quantity camera, feel, perfume, features,\nBut\nBattery drain high in normal uses.\nI feel heating lightly"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Every things of this phone are awesome except the battery, from it you can get maximum 5 hours battery back up in a single charge."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Overall best phone"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Night vision camera is excellent 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "The Phone is compact. Good for those people who are tired of big screen and just want a compact device. A bit heating issue is there. Reminds me of the iPhone 5s but that's me. I would say it's a good purchase. Galaxy AI is a cool feature."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "LIGHT WEIGHT...SMOOTH DISPLAY...GOOD CAMERA"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Great experience"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Except battery rest all great"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Compact phone very easy to carry.Features are good as per the price."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Nice phone camera is awesome better than iPhone 15"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "great color, delivery person also helped a lot in setting up new phone"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Very pleased 😀"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Just fabulous 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Best product with battery backup of 1day of regular usage"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Flawless for day to day use. Does the job intended. Good buy ! Would recommend for people who love to have power packed compact phone. Battery life is decent. Charges 100 percent in 1 hour. Beautiful display. Camera that does the intended job. Smooth processes. Good connectivity."
    },
    {
      "User_Rating": "3",
      "Title": "Just okay",
      "Comment": "doesn't feel like a samsung screen, heating, signal quality too poor. first high value flagship purchase turns a disappointment for me."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "The product was good . Working smoothly while typing and hate part didn't got adapter."
    },
    {
      "User_Rating": "3",
      "Title": "Does the job",
      "Comment": "Worst battery backup"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Compact phone with hits and misses...not worth more than 50k"
    },
    {
      "User_Rating": "2",
      "Title": "Moderate",
      "Comment": "Very big range problem."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Wonderful product...sleek and compact..I loved it"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "I love this phone"
    },
    {
      "User_Rating": "3",
      "Title": "Decent product",
      "Comment": "If you are coming from ios go for iphone 15 only night mode is better then 15 not recommend although good phone"
    },
    {
      "User_Rating": "3",
      "Title": "Fair",
      "Comment": "Avg , don't waste your money on exynos chip , battery avg , let's hope samsung will fix by software update"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Nice camera"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "After 2 weeks writing this review over all good phone. Till now i didn't find any heating issue. Camera is super. Just go for it. Battery is decent. Very handy and light weight"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "This is best phone either in any aspects first.\nSecondly and lastly better than iPhone. Must have it and enjoy it."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "If you planning to buy a premium phone for looks, performance, camera and battery, then go for this phone.\nJust awesome. IPhone is just a hype nothing else."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Very nice product\n1 . Top notch camera better than i phone 15 nd 16\n2. Design is also top notch .\n3. Very compact size nd handy to use very lightweight mobile.\n4. Only battery might be the reason for heavy users .\n5. Display is one of the best .\nOverallly i will give 4.5 out of 5 for this phone ."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Superb performance as always!. Working perfectly after one month. No heating issue as expected for Exynos. Initially we may feel some warmth. Don't worry. Afterwards, it will do all its jobs silently. Excellent camera performance as well as integrated AI functions."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "I love s24 purchase from the platform"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Awesome phone at this Price Range"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "In hand feel just awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Nightography photo is excellent and we capture good portraits is very excellent videography also good this phone is very reasonable to buy"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Osm"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "It's incredible!!! Shift from realme 8s to this!!! It's a camera beast!!! I used it for 2 mon"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Camera is good .. But still needs to be improve like the same other brand....\nTouch sensitive is top nortch...\nAI is pretty good ...\nProcessing speed is impressive....\nOver all is good . Price is bit high ..."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Amazing product. Great delivery by flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Compact and powerful"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Camera like wow 😙 🥰🫠🤩😘"
    },
    {
      "User_Rating": "3",
      "Title": "Does the job",
      "Comment": "Happy 😊"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "One of the best buys in Android mobile phones. Absolutely in love"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Best"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Good phone"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Best mobile phone looks classy and amazing AI features in this mobile."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Excellent"
    },
    {
      "User_Rating": "3",
      "Title": "Decent product",
      "Comment": "Performance and design is good. Heating with minimal usage."
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "Everything was good but the battery backup was not enough"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Fulfilled my expectations.\nThe Stunning Design, Display, new One UI 6.1, new AI are the highlights of it.\n\nHowever, Flipkart service is worst.\nPart of pre-booking offer, they are supposed to provide,free wireless charge, but not provided. I don't recommend Flipkart."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Good phone compact and handy"
    },
    {
      "User_Rating": "1",
      "Title": "Not recommended at all",
      "Comment": "Overheating issues with normal use and battery drains immediately..battery life for oly 5 hours with normal usage"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Amazing product for 2025!"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Camera quality is excellent. Overall experience was good."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Very great phone but battery should be big atleats 5000mah."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "BEST"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Using this phone more than a month. Excellent performance. Ultimate camera. Everything is great, except speakers, speakers is very bad."
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Good 👍"
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Awesome Performance 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Track phone"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "This is very useful"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "It feels better than iphone 15"
    },
    {
      "User_Rating": "1",
      "Title": "Absolute rubbish!",
      "Comment": "Phone is heating for nothing and simple day to day tasks. It's heating 40 degrees just using spotify. Worst phone. Never recommend any samsung phone which has Exynos. Don't regret after buying. Go for apple or any other that has snapdragon. Even customer support also doesn't listen your problem or ignore. So, my suggestion would be please be careful before buying this."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "If you want to purchase a camera phone, then this would be the best option for you. Absolutely loved the pictures clicked on this phone. Also the display and the design is very awesome."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Worth Buying"
    },
    {
      "User_Rating": "1",
      "Title": "Horrible",
      "Comment": "The battery life is very poor. I was expecting better battery performance.with such high value product..."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Nice product. Happy with the item along with FlipKart, Seller and Delivery. Open box delivery and the eKart delivery boy awaited until the product is checked and found ok. Battery backup is more than expected. Camera quality is great."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Very high end performance"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "BEST PHONE AT 42K RANGE."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "I love this phone"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Cam 5star"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "After buying this phone on launch thru flipkart i must say it is worth buying. The price which i got is 52500 after all discounts is very good.\nPros: Build quality is very good\nCamera is futuristic and excellent.\nNo heating issue at all after 2 months of usage.\nPremium design\nNo lacking after multiple applications runs on same time\nCons: As of now battery last for 24hrs, but on hard usage it will last only 12 hrs.\nCompany must add a adapter"
    },
    {
      "User_Rating": "1",
      "Title": "Horrible",
      "Comment": "Heating Heating Heating .....\nVideo recording time Heating Heating danger"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Overall good:\n\nPros-\nSuperb Camera\nAwesome design\nVery compact\nAi features\n\nCons-\nBattery drainage\nNo charging adapter."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Nice product value for money"
    },
    {
      "User_Rating": "1",
      "Title": "Useless product",
      "Comment": "Mobile heating problem\nBattery backup not"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Everything is so good really happy with the phone"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "All features and smoothness,handy and fabulous mobile🤍"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Best phone I ever use Got this Deal on Launching offer and Amazing Everything is in this phone No Need IOS"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "The product is awesome bomb...Everything is awesome"
    },
    {
      "User_Rating": "1",
      "Title": "Worthless",
      "Comment": "Heating issues. Mobiles becomes Iron box during charging. Camera picture quality is very poor. Design is somewhat ok."
    },
    {
      "User_Rating": "3",
      "Title": "Decent product",
      "Comment": "If you are coming from ios go for iphone 15 only night mode is better then 15 not recommend although good phone"
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "Great phone with great aesthetics"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "All the things of this phone is excellent except the battery. The battery backup is not good."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Best quality and fast service trusted company\nFull"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "best best best best."
    },
    {
      "User_Rating": "1",
      "Title": "Useless product",
      "Comment": "Not worthy"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Best product with battery backup of 1day of regular usage"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "I sold my I phone 15 just 3month old and purchase S24\nWorth the money,I got it 58k after all disconts...it's a great deal for me\nGreat phone 5 star ⭐love the phone❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "It's a beast 💪. Love Samsung because of Knox security and Secure folder. Barand is always brand"
    },
    {
      "User_Rating": "2",
      "Title": "Moderate",
      "Comment": "The mobile has vey bad heating issues even if used very lightly and battery draining with very moderate use.\n\nIf the basic features provided in the phone cannot be used according to our preferenes because of heating issues then what is the point in giving those features?\n\nI used oneplus 6 for about 6 years and did not have any such heating issue.\nNot worth for the money."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Completely satisfied with purchase"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Samsung galaxy s24 😘\nSuper 👌 quality"
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Little bit heating issue, battery life is as per usages. Rest is awsome phone."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "My best phone ever 👌🏻"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Better charger also provided with mobile phone"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Amazing Flagship phone"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Performance 10/10\nDisplay and sound 10/10\nBattery is decent 8/10\nCamera awesome 👍\nBut ekart delivery service is so poor."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Very nice everything is 💯 perfect."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Nice phone"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Very good display and camera.. Wonderful night mode and the 3x telephoto lens is incredible.. Battery life is average 6+ hrs of Screen on Time.. Processor is also very good... Maybe not as great as 8 gen 3 but more than enough for most usage."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Good product."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Very Nice Product, Fully Satisfied With Product"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Good compact phone at this price."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Overall Good ,Slim,handy Phone"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Phone is good in terms of performance, but heating a lot for basic use itself. Camara options need to be improved and battery performance/optimization also has to be improved. Software optimization for chipset has to be made."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Best tum!!!!"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "All Suppar"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Amazing Product by samsung.."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Not bad"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Superb performance as always!. Working perfectly after one month. No heating issue as expected for Exynos. Initially we may feel some warmth. Don't worry. Afterwards, it will do all its jobs silently. Excellent camera performance as well as integrated AI functions."
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Super cute pics"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Camera is good ,performance is also good ,I am not satisfied with battery soon draining out ,phone getting heated."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "The product was good . Working smoothly while typing and hate part didn't got adapter."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Nightography photo is excellent and we capture good portraits is very excellent videography also good this phone is very reasonable to buy"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "I've been using the this mobile for the past 20 days, and I must say, it's been a delightful experience overall. Let's dive into the details.\nDesign: The S24 exudes a premium aura with its sleek design and compact form factor. It strikes the perfect balance between size and weight, making it comfortable to hold and use for extended periods.\nCamera: One of the standout features for me has been the camera. It delivers exceptional picture quality, capturing every detail with clarity.\nDisplay: Th...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "One of best phone upgrade from Redmi phone best device"
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Owasm Product quantity camera, feel, perfume, features,\nBut\nBattery drain high in normal uses.\nI feel heating lightly"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Best phone but need some speed charging support"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Best compact phone ever...."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Nice phone"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Best tech device i have ever used"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Good product"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Writing review after 2 weeks of using s24:\n1. Camera - 5/5\n2. Performance - 5/5\n3. Battery backup - 3.5/5\n4. Display - 5/5\n5. Display - 4.5/5"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Great divice and look awasome"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Best phone in this price even I compared camera quality with I phone 15 plus and google pixel 7 pro and I phone 15 plus is getting 3rd no in all 3 phones. So guyzz winner is here #samsung s24 gray colour.... go for it without any doubt......"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "The Samsung Galaxy S24's camera system is outstanding, capturing stunning photos and videos. The premium build and vibrant display offer an excellent user experience. The battery life is impressive, with fast charging capabilities. The One UI software is user-friendly and customizable. However, the high price may be a concern for some buyers. Overall, it's a top-performing smartphone that exceeds expectations."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "The phone's aesthetics are exceptional; however, battery life is a significant drawback."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "great color, delivery person also helped a lot in setting up new phone"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "It's definitely worth buying."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Battery is doing good after update and after using some time as it understands usage patterns in initial days after that it works fine. Camera is easily the best in this price segment."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Was looking for a compact sized phone. Earlier I was using s22 plus but it had a poor battery life. Upgraded to s24 and currently I am getting very good battery life as per my smartphone usage. About phone, black colour is always my favourite. Display is nice and crisp. Camera is awesome. Haven't seen any heating issues yet. One notable thing is that very precise haptic feedback."
    },
    {
      "User_Rating": "1",
      "Title": "Unsatisfactory",
      "Comment": "There was a free wireless charger with this phone but seller didn't sent,battery draining very fast big battery issue"
    }
  ]
}