{
  "search_query": "Samsung Galaxy S25 Ultra 5G",
  "total_reviews": 128,
  "Overall_rating": "4.7",
  "Total_ratings": "1,890 Ratings &",
  "reviews": [
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Overall Excellent phone"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Excellent Product...I just loved it ❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Nice Mobile"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Totally worth it, just shifted from an iPhone, was worried that I won't like the interface but no, this phone feels great and very premium in your hands, loved the design and features and the performance it delivers will blow your mind"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Awesome product with best exchange price."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Excellent phone, Display superb. Camera good. Performance fast. Overall satisfied with upgrade to S23 Ultra."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "THIS IS MY FIRST ULTRA PHONE AFTER USING FOR SOME DAYS MY FIRST IMPRESSION IS JUST WOW. CAMERA IS OUTSTANDING, DISPLAY IS CRISP AND ANTI REFLECTING COATING IS ADDING MORE FLAVOURS TO ITS DISPLAY.BUILD OF THIS FONE IS SUPERB. BATTERY IS UPTO THE MARK EASILY GIVE ONE DAY WITH MODERATETO HEAVY USE. PERFORMANCE IS TOP NOTCH 👌 AI IS AMAZING🔥. ONE UI7.0 IS THE BEST👍"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Just one word Beast 💪( all rounder) ,just go for it"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Go for it"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "I have upgraded over from an iPhone 12 Pro Max, and I'm incredibly impressed. This phone is a powerhouse! Here's my feedback:\nCamera: The camera system is simply outstanding. The zoom capabilities are mind-blowing, and the image quality, even in low light, surpasses anything I've experienced on a smartphone, including my previous iPhone. The detail and clarity are remarkable, and I'm constantly amazed by the photos I can capture. The various shooting modes offer a lot of creative control...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Excellent phone camera is super 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Overall excellent product"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "25 Ultra, you beauty! 🔥💯"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "An absolute powerhouse! With its stunning AMOLED display, buttery smooth 120Hz refresh rate, and top-tier performance, it delivers an exceptional user experience. The camera system is a game-changer, capturing sharp, vibrant images with ease. While the battery life is solid, it could use a bit more endurance for heavy users. Overall, this phone combines premium design, cutting-edge tech, and impressive functionality, making it a must-have for anyone looking for a flagship device. Highly recom...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Great product to have",
      "Comment": "S25 ultra phone really marvelous and one of finest phone.. Everything is awesome of this smart phone..AL is mind blowing"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Overall great experience."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Very good camera and photo editing features. Even it edits old photos of mine. Battery is ok. I am facing network issues sometimes even within the city limits where my earlier mobile worked good."
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Earlier I was planning to buy S24 ultra. After good deal I bought this one. Butter smooth performance. Excellent display. Only concern is battery."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Top notch quality 👌\nFull satisfied......."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Beast. Display is superb. Performance fast."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "The bar is set for 2025, absolute beast.\nEarly birthday gift.\nThank you wife."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "What marvel phone Samsung has made! 🤩 Absolutely stunning, amazing screen, camera, battery life, and what not. The best part? AI! 🚀 It's something Apple hasn't achieved yet. Samsung is on another level! #Samsung #Phone #Technology #AI #Innovation #Marvel"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "I'm totally loving this new phone! 🤩\nIt's seriously everything I've ever wanted and more. The camera is insane, and I can't stop taking pics.🤳 Been using it nonstop since I got it. Definitely worth the hype! 💯 Thinking of taking it on my next trip"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Top notch..😎"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Excellent phone with performance and camera quality."
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Phone is great. But slow charging speed annoys.\nDisplay is good.\nAI features are really ahead of other phone brands.\n\nFlip kart is giving very less price for exchanging old phone"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Awesome 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Excellent Mobile, Great Performance and AI experience. Loved camera, UI and Screen.\nPlease install samsung screen guard otherwise finger print will not work."
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "S25 ultra is good, classy , but you will not feel anything special if you have used s24 or 23 ultra before.camera is of top notch quality but in low light, It doesn't perform better."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Nice pic"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "This is the best overall phone right now . U can go for it without any hesitation.."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "I have exchanged the Iphone 15pro max with good discount , S25 Ultra is nice phone and experience the latest flagship"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Samsung S25 Ultra features a stunning AMOLED display with exceptional brightness, sharpness, and smooth 120Hz refresh rate. One UI 7 enhances the experience with refined animations, improved AI features, and seamless multitasking."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Loved it, hands down better than iphone16pro max"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Crazy mobile must buy !!"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Osamm camera and design, performance on top notch"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "From a visual perspective, the S24 Ultra appears to be more premium. However, in terms of performance, it surpasses the S24 Ultra."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "The s25 ultra is incredibly fast everything runs smoothly but the processor is only part of it one ui7 is better"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Super"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Excellent performance. Exchanging my Iphone 14 for Samsung S25 is worth it for each penny!"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Very very premium phone from trusted brand. Recommended to upgrade."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "The Samsung S25 Ultra is a top-tier phone. Upgrading from the S22 Ultra was worthwhile. The camera is significantly improved, especially the 5x portrait mode. It's also lighter and more comfortable to hold. The selfie camera is better as well. Many helpful AI features are included."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Excellent performance\nStunning display\nImpressive camera\nLong lasting battery\nPremium design\nAnd Enhanced AI features\n\nOverall the Samsung Galaxy S25 Ultra will be top tier flagship smartphone of 2025."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Product is really awesome 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "This phone is simply amazing! The battery life is great, the cameras are amazing, the display quality (especially the anti reflective coating) is tooo good. You even get 6 months of gemini advanced subscription for free.\nThe only downside is the downgraded s-pen. If you're upgrading from an old cheaper phone then this phone is completely worth the upgrade, but if you already own an s23 or s24 ultra or equivalent device, i wouldn't recommend upgrading since most of the changes are very minor."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Fantastic phone.\nReally smooth to use.\nBattery lasting longer than expected.\nDisplay is a treat for eyes.\nCameras are top quality as expected."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Best camera centric phone."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Awesome 👌"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Best in class AI features. But I find Google Pixel's user experience better than S25"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "I couldn't get a 512GB deal because the phone was out of stock in 10 minutes for the same deal but can be purchased at a higher price, so I went with a 256GB deal which was a very good deal if not the best.\nNow coming back to S25 Ultra disappointed with the design, no doubt I liked the light weight but S 24 Ultra design was felt more premium, so design is minus for me\nDisplay as well as performance is top notch\nBut the camera needs improvement in low light, The battery is good but we need a ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Here is my review after 15 days usage:\n\nThe device features a compact design with excellent battery efficiency, ensuring minimal drain. It comes with intelligent safety features and a high-quality camera packed with multiple modes. It supports 8K video recording, while 2K at 60fps offers outstanding performance with optimized stability. Additionally, it includes its own video editing software. The selfie camera is equally impressive.\n\nFor gaming, it delivers smooth performance, allowing you t...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "I love this product, I was planning for S24 ultra but I wait for S25 ultra and it's worth it"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Very good phone"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Best AI future mobile looks more premium\nThen 16 pro max"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Fabulous Fantastic 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "SAMSUNG Galaxy S25 Ultra 5G is powerful, reliable and well-equipped smartphone."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Absolute beast, best display in the segment"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "I upgrade from s24ultra\nS25ultra Mobile was Beast 💥\nBattery same as usual s24ultra\nCamera improved\nDisplay Great better than s24ultra\nDesign was Really really worthy upgrade from s24ultra\nPerformance 💥💥\nNo heating,No Lags\nNewInterface, totally AI Technology mobile"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Good one for business"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "review after 15 days of using this\nexcellent display\nexcellent battery\nexcellent camera\nheavy gaming could be better by updates\noverall excellent product from samsung"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Great phone....."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Go with it without any second thoughts"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Excellent Phone! Absolutely butter smooth.\nAlready loving it"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Samsung is best"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Loved it"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Top notch point n shoot camera, top notch display, top notch performance. the only issue i faced is during video recording where pro features are not at par with iphones's, eg log recording (not as true to life) and 120 videos (not as stable)"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Great phone in android version performance is too good, camera quality is ultimate, bettrey life is too long as i want but fingerprint sometimes not taking and face camera is not taking when you are in low light overall phone is best with ultimate AI features.\n🩵"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Excellent phone with best feature. Camera is awsom"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "A beast mobile which can even be used as a personal laptop with Samsung Dex! When it comes to Camera and Performance, I don't think there is a competitor for this device! I really like the new curved edge design which makes it look more convenient. On the battery front, I feel it could have been done slightly better. I am getting some 4 hour screen on time with 27% battery left with last charged about 12 hours back. So I bought a Samsung original 25W charger just to see if that can make any d...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Just fantastic."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Got it delivered today and phone is just awesome and low light photography is awsome"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Everything is fine, Very much upset about the s-pen"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Product is good but it is widder than iphone 16 pro max, Camera is good but not accurate all the time like iphone. Overall in my opinion if you are iphone user don't switch to it."
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Been an iOS user for the last 10 years, but I've moved to Samsung. Every year I thought about moving but was locked into the ecosystem. This year, I decided to switch. iPhone users still think Android is old-school and fear moving. Nowadays, Android is very developed. It has good battery life, a greater display, a fantastic camera, and is optimized. I compared iPhone pictures with the S25 Ultra; the iPhone can't come close. iPhone video making is still good."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "It is a beast in every angel. Just love the samsung mobile next level 👌."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Best in the comparison of ios.\nI recommend S25 Ultra not 16 Pro."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Its a beast phone. Amazing camera quality and video quality looks better than Iphone 16 Pro Max. Battery life is excellent and is lighter than S24 Ultra."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Asome Galaxy s25 ultra"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Worth the price, Go for it."
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Best Phone but obviously the price is premium knowing that the price will be reduced to its half in next 2 years, which is kind of disappointing to know that other will enjoy the same thing at half priced😅."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "It is good"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Excellent 😍"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Thanku flipkart best price😍😍"
    },
    {
      "User_Rating": "4",
      "Title": "Does the job",
      "Comment": "It's Good but not as expected. Fingerprint is not working properly."
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Nice phone...no lag..."
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "4 star because of fingerprint, its not so fast and need to try 2-3 time to unlock the phone"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Beat android phone in the market, absolutely beast in all aspects.love the new s25 series."
    },
    {
      "User_Rating": "3",
      "Title": "Just okay",
      "Comment": "Fingerprint is not as expected."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Super phone"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Overall best performance i loved it 😍 ❤️ 👌 Camera performance is outstanding design and build quality superb 👌 display has best ever viewing experience"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Wonderful Device 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Awesome phone and robust quality. Must go for it."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Super duper Allrounder 🎉"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Upgarding from Oneplus 11 to s25 Ultra was worth for every penny."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "No phone can beat this beast.. Not even Apple.. Best phone ever.."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Earlier a ios user, loving this phone every bit. Awesome camera, awsome design . One ui7.0 and AI features are cherry on the cake."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Best"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Beast"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Best camera phone of the year. Great camera great optics and great software experience."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Excellent 😍"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Fantastic phone.\nReally smooth to use.\nBattery lasting longer than expected.\nDisplay is a treat for eyes.\nCameras are top quality as expected."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Worth the price, Go for it."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Overall second best product after my iPhone XS. Good quality camera and the best part is the screen. But the price is on little bit higher. Overall a good product."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Awesome product. Loved it."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Nice in hand feel. Good phone to have in your pocket. nice performance nice battery nice camera . just grab the best deal."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Terrific purchase 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Best in the comparison of ios.\nI recommend S25 Ultra not 16 Pro."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Pre order this phone just after launch was waiting for it desperately.. I was a huge fan of oneplus but post merger oneplus is no more giving a pure Oxygen OS so I decided to move to Samsung and opted for Ultra... Since I got this phone I am in love with this from design to performance, camera to software experience everything is top notch beside all these flagship performance they added AI as cherry on top.... Samsung nail it in AI department, it work flawless and very useful in daily life.....\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "A beast mobile which can even be used as a personal laptop with Samsung Dex! When it comes to Camera and Performance, I don't think there is a competitor for this device! I really like the new curved edge design which makes it look more convenient. On the battery front, I feel it could have been done slightly better. I am getting some 4 hour screen on time with 27% battery left with last charged about 12 hours back. So I bought a Samsung original 25W charger just to see if that can make any d...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Asome Galaxy s25 ultra"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Totally worth it, just shifted from an iPhone, was worried that I won't like the interface but no, this phone feels great and very premium in your hands, loved the design and features and the performance it delivers will blow your mind"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Fabulous Fantastic 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Go with it without any second thoughts"
    },
    {
      "User_Rating": "3",
      "Title": "Good",
      "Comment": "Best flagship mobile phone"
    },
    {
      "User_Rating": "3",
      "Title": "Fair",
      "Comment": "Quite good."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "THIS IS MY FIRST ULTRA PHONE AFTER USING FOR SOME DAYS MY FIRST IMPRESSION IS JUST WOW. CAMERA IS OUTSTANDING, DISPLAY IS CRISP AND ANTI REFLECTING COATING IS ADDING MORE FLAVOURS TO ITS DISPLAY.BUILD OF THIS FONE IS SUPERB. BATTERY IS UPTO THE MARK EASILY GIVE ONE DAY WITH MODERATETO HEAVY USE. PERFORMANCE IS TOP NOTCH 👌 AI IS AMAZING🔥. ONE UI7.0 IS THE BEST👍"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Thank to flipkart before time delivery and s25 ultra top notch 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Excellent android phone"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "It's awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Upgarding from Oneplus 11 to s25 Ultra was worth for every penny."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Overall excellent product"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Phone is great. But slow charging speed annoys.\nDisplay is good.\nAI features are really ahead of other phone brands.\n\nFlip kart is giving very less price for exchanging old phone"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Overall Excellent phone"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Everything is good then 24 ultra and iphone pro series"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Loved it"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "What marvel phone Samsung has made! 🤩 Absolutely stunning, amazing screen, camera, battery life, and what not. The best part? AI! 🚀 It's something Apple hasn't achieved yet. Samsung is on another level! #Samsung #Phone #Technology #AI #Innovation #Marvel"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Awesome phone"
    }
  ]
}