{
  "search_query": "Samsung Galaxy S24 Ultra 5G",
  "total_reviews": 172,
  "Overall_rating": "4.6",
  "Total_ratings": "3,663 Ratings &",
  "reviews": [
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Best in night photography"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Android King 🤴\nAll-rounder phone 📱\nAll in one 💯🎊"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Nice performance of camera and other features..\nSamsung always great..,"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Best mobile for photography\nCharging wise also good\nNo issues at all.\nGiving my review after using it almost 50 days."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Amazing Products 👏 🤩"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Awesome Display and Camera.\nBattery performance is also good."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Excellent"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Superb product great in every aspect. Go for it"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "What a fantastic mobile it is. Camera is the best, performance is the best, look and feel is very rich. Display is Ultra HD. The best of best."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Awesome product. Best display, best camera, best performance in comparison with any mobile in market. Just loved this phone. It's really Awesome."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "King of the android smartphone 🤴"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "World's best phone👌"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "#Excellent digital zoom\n#Display is mind blowing\n#camra is outstanding\n#Just likes wow"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Awesome phone"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "No one can challenge the camera of this smartphone. This will be beating up every smartphone upto 4-5 years."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Great camera"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Good product"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Just love the performance and looks 😍"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Very nice mo and camera 📷 Very good 👍 no\nchallenge 👌 mo s24 ultra I love ❤️ mo"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Best samsung flagship purchase, Nice Smartphone awesome camera Great features and amazing s-pen really loved it."
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Top notch display. The flat design with titanium frame feels premium. Camera could've been improved as it is same as that of 23 ultra. But may be it will get better with future updates."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Great design. Easy to use. Very nice performance so far."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "The Phone is really awesome in terms of performance as well as looks wise."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Excellent Galaxy S phone as always. Samsung, you rock 🤟."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Product is really good. You can buy it now even in April 25, only you really needs it. 1 lakh rupees for phone is something not recommended....\nSound could have been more better.... else all things are good"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Thanks, Samsung, for making such awesome phone! 24 Ultra beats IPhone 15 pro max in all aspects"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Overall the phone is very good, upgraded from 21 ultra, seamless upgradation through smart switch. Camera is awesome, 100x is also decent. Integration of AI is definitely something to look forward to."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Unbelievable zooming clarity, just one day over, Good battery.\nBut in box, charger and headset required for this price"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "The New King of 2024.🔥❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Display is awesome 👌\nOne UI doing great work\nCamera is out standing"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Mind blowing device just wow...."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Best camera,display, sound, user interface and features.battery backup is too good."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Fab software and capable hardware to match it, ergonomically it may not be very comfortable to hold.\n\n+ Good weight balance, feels sturdy and well built.\n+ Super impressive haptics and strength can be varied at various levels\n+ Very less screen reflections, using dark theme is a breeze with this phone"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Great product at great price!"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Excellent Phone"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Superb"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Its grrrreat. There's nothing missing in this device. Screen is superb, camera is great , performance is flagshippy.\n\nBattery runs at least a day for me. One always wishes for more in this department. Fast charging is limited to 45W.\n\nIt looks amazing, feels amazing phone. Worth the hype."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Samsung S24 Ultra after 5 months of usage:\n\n*Display:* The Dynamic AMOLED display still impresses me with its vibrant colors and crisp resolution. No complaints here!\n\n*Performance:* The phone's performance remains seamless, handling demanding tasks and multitasking with ease. The Snapdragon 8 Gen 3 chipset is a beast!\n\n*Battery Life:* The 5000mAh battery still lasts me a full day, even with heavy usage. Fast charging is a lifesaver!\n\n*Camera:* The camera system continues to impress, capturin...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Superb Phone, with best processor,you can any Android game in any mode. Camera clicks world's best photos. Mind blowing 😎 , Flawless Phone"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "S24 Ultra is a great flagship phone. Bought mine during the launch with offers and I'm so glad I chose this over pixel 8 pro. Cameras are good (may not be as good as Pixel), design is so unique. Love the flat screen, it's so practical. Display is top notch! My previous 2 phones were OnePlus and seriously considered OP12 as well, but the AI features stood out. Phone software is well optimised and battery lasts me full day fully. I use 25w charger and it charges from 35-100% in around 50mins. ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Performance: 5 🌟\nDisplay: 5 🌟\nCemara: 4 🌟\nBattery: 4 🌟\nOverall: 4 🌟"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "One of the best mobile i have ever used. Moved to this from iPhone. Beast of a mobile."
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Everything is perfect the design, display and performance and the Battery and Camera I would say is neither bad nor great, it's GOOD. Battery lasting more than 18 - 20 hours with 7 - 8 hours of SOT. If you get a tempered glass kindly get a thin one, because if you get a thick one the Ultrasonic sensor won't work even if you increase your touch sensitivity.\n\nOverall a great flagship experience everyone should at least use once in your life time."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Osm 👌\nGood experience"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "I think this is the One of best phone 📱 and the camera of the phone is so better"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Awesome phone..just go for it."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Best samsung ever!"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "These are some of clicks and it takes awesome pictures and the AI is working beyond the level."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "1.performance is next level you can play any game with out lag.\n2.battery is not as expected\n3.display is awesome 👌\n4.Camera is top notch in this mobile\n5.Amazing AI features\noverall it's an amazing phone only issue with battery backup"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Clearly the best flagship phone of the year. I am reviewing it after 3 days of use.\nPros:\n1. Fast and Smooth performance\n2. Awesome Camera and it's features are best\n3. Galaxy AI is Good initiative yet to improve\n4. Best Display\n5. Battery is awesome\n\nCons:\n1. Live translation will work only for Hindi Language moreover Google translate is more accurate than Samsung translate"
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "S24 ultra nice but at time of exchange delivery not give price as seen in exchange value although exchange products as per mark"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Best phone in the world 🌎"
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "I will be honest .the phone feel super premium and the one ui is icing on the cake\nBut camera is not that great as hype overall but it still taking some good shots in extremely well lighting condition..In night or low performance is average"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "No words to explain this mobile, Galaxy 24 is the best in the universe."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Just fabulous. The king of Android phones for 2024 already. Incomparable to any other Android smartphone. An ace in all departments, whether it is stability, gaming, performance, camera, or overall usage and security. Not to forget the AI features, they are really handy and useful. If budget is not an issue then just go for it don't look anywhere else."
    },
    {
      "User_Rating": "4",
      "Title": "On an Average",
      "Comment": "I want to share following point regarding this phone.\n1) Camera - As this is Camera centric phone as Samsung advertising but camera doesn't meet to the expectation if we are considering price point of view. There are modes given for the camera which are old one only and camera clarity for the rear camera is ordinary and not showing any proper upgradation with compare to galaxy S 23 ultra. Front camera to too bad I can say. When you try to capture the photo with front camera comes very pixel...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Phone is fantastic no doubt aboutit . Love it's Display. Surrounding sound quality is at the top notch. Performance and speed is of next level. Camera would have been better compared to it's price."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Beast and better than iphone"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Nice product with super fast experience"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Best phone in the world"
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Apart from Flikart's pathetic service, everything else is good about this purchase"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Photo all good but price too high"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "My Dream Smartphone.\nAwesome Experience with this device. Thanks too SAMSUNG."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "We have various options in the market. Thought to go with IPhone 15 pro max,but in the end Samsung has nailed it in every department.Camera and video quality is top notch.After intensive phone usage I am getting good amount of battery backup. AI features took the phone to the next level. Took the moon photo in manual mode and the output came very well. Camera is working great in low light conditions. Definitely outshined IPhone 15 pro max in various segments.Just go for it.Done a lots of rese...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Perfect phone at Perfect price,"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Damn...prettiest...\n\nUpgrade from oneplus 7 pro, thought for 12 but nothing new so bought this"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Simply G.O.A.T the mobile is literally performing at its best in every aspect literally killer of iphone"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "New android king"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Camera is outstanding"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Very awesome camera....best performance...best display..best battery"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "I was fear of being delivering of fake s24 ultra...but m fully satisfied now....."
    },
    {
      "User_Rating": "5",
      "Title": "No issues. Fully satisfied.",
      "Comment": "Second phone from Flipkart. No issues. No pre-activated issues. My S24 U got activated on the day I received it, got my full 1year Manufacturer Warranty. As far as the phone goes. Loving it."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Simply excellent\nCamera is too good\nPerformance is next level\nBattery is good\nDesign is nice"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Thanks for selling original and authentic products. It's my first experience buying such an expensive phone from Flipkart, and it's been amazing."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "I bought this phone a week back from the date of this review.\nI own an Iphone 15 pro and a Op11 so the s24 ultra is an upgrade to Oneplus 11.\nComing back to the s24 ultra.\n\nIts an amazing phone. Great Display, Best Cameras, Spen..etc\nIts a perfect Smartphone for all.\n\nBad is Battery life, health and the charging is something i don't understand still. The 80% thing why?\nWhy Copy Stuff?\nLike i know Apple came up with it but that thing works with proper optimisation S24 ultra doesn't, as soon y...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Best Display, best looks, best screen. Performance wise, it's a beast. 5☆s overall."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Camera 5 star ⭐\nDisplay 5 star ⭐\nBattery 5 star ⭐\nSuperb performance."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Superb Performance 📱"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Absolute Beast!\nPros:\n1. Pretty good camera, few updates and it will be flawless.\n2. AI stuff is cool, fun to play around.\n3. S-pen always comes in handy, specially to e-sign documents.\n4. Display is just really amazing! What an experience to consume HDR 120/60 FPS 4K videos.\n5. The anti-reflective display is really helpful, specially when it comes to outdoor usage. It really creates a huge difference.\n6. The weight balance is done correctly, it's hardly 1.5 gram lighter than S23 Ultra but f...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "I'm in love with this phone. Though the camera quality isn't as good as my iPhone 12."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Awesome mobile. Everything you could ask for, it is there in this piece of technology. Samsung's One UI has many customization options. Cameras are amazing. You get DSLR like portraits from the camera if there is sufficient light. Night photography can still be improved. Otherwise everything is perfect. The battery also lasts more than 1 day on normal usage. Screen is very bright even under direct sunlight. I am a bit disappointed as even after paying such a hefty amount for mobile, the AI f...\nREAD MORE"
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "The Phone is amazing. Only 1 issue. I pre-ordered the Phone and a samsung wireless charger was supposed to be a benefit of pre ordering. I did not receive the charger. Deducting 2 stars for that."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "The Best flagship phone you could get yours hands on! Absolutely love this beast!"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Camera quality is very amazing,\nDisplay is very clearly,\nBattery is very powerful,\nDzine dhansuuuu\nSuperb performance"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Best phone and much better than. IPhone go for it beyond doubts a very great phone"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Nice"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "I'm happy"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Osm phone"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Super phone 🤳🤳🤳"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "S24 is the best phone at this time."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "If you are planning to buy for office and CLG stuff then this is the best option you got if you are willing to spend that much and stop comparing with iphone both phones are best in their own perspective iphone is more over person gadget which won't give us the freedom to explore various things and perform different things which we can do by samsung s24ultra"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Excellent phone with awesome AI features and best camera. The display is top notch with snapdragon gen 3 processor, making it a power house performer."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Beast"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Great performance"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Best of best.\nI have no complaints.\nDisplay is awesome with almost no reflection\nSound amazing.\nCamera amazing\nBattery backup SOT upto 6hrs for me\nPerformance top notch although I m not power user.\nFully satisfied with s24 ultra.\nProbably a phone for next 4 or 5 years it has all features uptodate for next 5 years atleast"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "King of android is here.\nNo one can beat samsung s24 ultra with this price and specifications."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "For taking photos the best phone and the premium quality of the mobile is too tooo tooo goood.....if u have money go with samsung S24 ultra instead of iPhone"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Wonderful product 👌.. Camera is Wonderful..\nAI is worilking wonderfully... Battery life is aslo very good 👍.."
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Good product, bit expensive, but who can afford may go fit"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Phone edge too sharp... when hold long poking...\nOtherwise overall gud..."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Mobile is just awesome. The camera, display, battery and sounds like everything is awesome.No one will regret and mobile looks so premium."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Camera like a waoo"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "It was great to get in 75k with great photo"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Display is awesome 👌\nOne UI doing great work\nCamera is out standing"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Product are awesome 💯,"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Just 8x"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "No regrets in buying this beast"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Superb model.nice smartphone"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Excellent"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Excellent Excellent Excellent"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "We have various options in the market. Thought to go with IPhone 15 pro max,but in the end Samsung has nailed it in every department.Camera and video quality is top notch.After intensive phone usage I am getting good amount of battery backup. AI features took the phone to the next level. Took the moon photo in manual mode and the output came very well. Camera is working great in low light conditions. Definitely outshined IPhone 15 pro max in various segments.Just go for it.Done a lots of rese...\nREAD MORE"
    },
    {
      "User_Rating": "1",
      "Title": "Not good",
      "Comment": "Unnecessary expensive. Nothing special in terms of software and hardware. Everything are similar to cheap sumsung phones. I think waste of money. Battery drain very quickly and takes 2.50 hours to full charge. And also facing heating issue"
    },
    {
      "User_Rating": "3",
      "Title": "Fair",
      "Comment": "Beast in best"
    },
    {
      "User_Rating": "1",
      "Title": "Unsatisfactory",
      "Comment": "Camera pic quality is not good"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "This is just the perfect android phone you can buy. I got it for 80k after exchanging my iPhone 13. It's worth the price. Awesome camera amazing display and performance. If your budget allows .. just buy it."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Great design. Easy to use. Very nice performance so far."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "All is good but heting issue i am facing"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "It's the King of Smartphone. Loved the design, display, performance, camera, battery.\nWorth the money."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Samsung S24 is Awesome✌️..."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "This phone is amazing! 😍 I love the design, the battery life, and the camera. The AI features are really superb. Samsung always makes the best high-end phones."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Extremely awed by the product."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Superb"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Nice looking\nGood picture quality\nEspecially 🖊 is superb"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Very good"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Superb product from Samsung And Flipkart delieverd 2 days before love it And to anyone out there don't let those thugs in the market loot you Buy from Flipkart on half the price🤫🤫🤫"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Just awesome"
    },
    {
      "User_Rating": "1",
      "Title": "Worst experience ever!",
      "Comment": "Camera is okay not that great but biggest issue is display colours are totally washed out in vivid mode also"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Best mobile phone."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Amazing Mobile.."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Best mobile I have ever used. So elegant, stylish and performance overall ⚡"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Android King 🤴\nAll-rounder phone 📱\nAll in one 💯🎊"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "My 1st Flagship Phone"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Good satisfying but u not give me any type of gift or discount with this product so little disappointed"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Thanks"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Baterry and display is outstanding"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Good nice 👍 👌 👏 ☺️"
    },
    {
      "User_Rating": "2",
      "Title": "Expected a better product",
      "Comment": "For camera buy a iPhone instead AI is great but yeah camera is not\nAnything above 3x gets blurred if clicked in indoor lighting\nand photos have too much noise\nThe photo i uploaded its just point nd shoot in 3x"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "This phone is best"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Happy 😊"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Just awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "The phone is just a beast in the mobile industry."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Android King 🤴\nAll-rounder phone 📱\nAll in one 💯🎊"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Best mobile phone."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Loved this phone 🤩🥰"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "World best Fone.."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Awesome phone"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Osm Samsung galaxy s24 ultra mobile"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Loved it\n\nMigrated from oneplus 8"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "This Cellphone is very good 👍"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Best Display, best looks, best screen. Performance wise, it's a beast. 5☆s overall."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Thanks, Samsung, for making such awesome phone! 24 Ultra beats IPhone 15 pro max in all aspects"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "I feel this phone camera software needs improvement. Blur photo when taken pics in evenings. Also battery utilization needs to be improved. Charging phone daily because charge goes from 100% to 1% daily.\nOtherwise this phone design and display really looks nice👌"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Good mobile"
    },
    {
      "User_Rating": "1",
      "Title": "Must buy!",
      "Comment": "Awesome performance best phone in this budget."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Nice mobile phone"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Perfect picture quality\nSmooth functions"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "ITS A Beast. Performance too Good Can't wait to test its camera as its very foggy here."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Best phone in the world"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Beast"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Very good looking premium phone, it feels right away when you hold it. The matte finish in the back looks superb.\nIn terms of camera quality I think it will give similar results like a S23 Ultra nothing substantial difference but front camera is better optimised.\nRest AI features I have not explored much but that would be interesting and probably a big USP of this phone.\nOverall happy with the purchase and will definitely recommend if you like the Galaxy Ecosystem as I had to change my primar...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "For taking photos the best phone and the premium quality of the mobile is too tooo tooo goood.....if u have money go with samsung S24 ultra instead of iPhone"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "I'm happy"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Yah filpkart delivery is before time phone is good to look in hand\nI will give review after some days of use"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Greatest Of All Time. Totally WORTHY 💪😉"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "This is an exceptional phone in it's segment for the price. As a person looking for features go for this. The AI updates are really good."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Awesome 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Very good"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Worth it 🔥"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Great camera"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Owsome"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Its simply amazing device and glad Samsung remove the curve screen, might some people like the curves but i like the flat display, there is room for battery improvement"
    }
  ]
}