{
  "search_query": "Samsung Galaxy F41",
  "total_reviews": 410,
  "Overall_rating": "4.3",
  "Total_ratings": "3,94,545 Ratings &",
  "reviews": [
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "nice camera"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Nice 👍"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Extraordinary\nAmazing!! I fall in love with Galaxy F41.. wonderful.. just go for it 😍😍😍😍 Perfect ph ever.."
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Overall it's very good but it hangs sometimes ..camera is awesomee value for money ..and battery is alsoo good and the touch is so smoothh but I give it 4 star because it does hangs sometimes and alsoo heats when I switch on the flash .."
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Awsm phone"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Awesome phone from Samsung"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "I liked it"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "I love Samsung very nice looking, Super AMOLED display. Mind blowing"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Good display\nBest camera\nI liked it\nGo for it"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Excellent product\nWorth for money\nOne of the best product among samsung brand"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Value of money. Best budget mobile. Best in camera mobile."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Very nice image im camera 📷 👌 👍"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Very good phon"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Very good"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Outstanding"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "battery backup, processing speed, display, camera all is good."
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Reviewing it after 6 months of use.\n\nNo doubt I love this phone everything is good about it.\nBack camera is excellent, front can be improved.\nSamsung f41 got android updated to new version too early actually we can say 1st only.\n\nThere is lags you find in phone which is not much but you experience it sometimes.\nBattery backup is excellent.\nOverall a good budget smart phone, I don't find any Indian smartphone as good as F41 in this price range.👍"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Amazing phone with best features in this price range. Must buy product from Samsung"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "Camera 📷 is very good, display is also very good and battery 🔋 backup is fantastic 👏. Overall nice, but its charged fully around 2.5hr."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Good Good"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Samsung Galaxy f41 very nice camera (KIMS)"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Awesome Everything Not Word Ever\n\nThis is Fabulous"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "It's a budget friendly purchase with good features. My husband gifted me this mobile as Diwali gift. And I loved it. Camera quality is also good. So I am giving this product a big thumbs up👍💖💖💖💖💖💖"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Good phone"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Supper f41 battery is good"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "I am loving it and this is a awesome mobile . The features are very useful and advanced. I am very satisfied with the product. Good in range delivery on time. Happy with the best service. Thank you Flipkart."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Excellent camera 📸\nMobile to good.\nOssom"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "Honest review: Front camera is not good... Reddish picture quality but only I like about this phone is rare camera, display is good and battery backup is also good."
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Good Mobile . Battery backup is ok.Camera is Awesome.Displag is good and Sound is also nice. Overall a good deal if bought with Samsung smart upgrade plan."
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "This phone is display very nice and camera performance average, battery backup is good but charger cable very short, 2 hr to above time complete charge, 2 region the disappoint charger cable and processor performance, mobile cover is the nothing type c port is very short cable Gorilla glass 3 protection is normal display, 👍"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Nice shots"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "The camera is awesome,picture quality of front and rear is very good👌🏻😘64 and 32 mega pixel camera is superb😍super amoled display is so wonderful bright display and big battery 6000mah, battery backup is amazing.....\nAnd yesterday,I receive android 11 update one ui 3.0🔥😍✌🏻❤\nAfter update the performance is very smoothly and I loved this phone🥰😘this phone is really good for a normal usage👌🏻👍🏻❤\nThanks flipkart....👌🏻✌🏻"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "It is so good but I feel sad that the battery is getting heat at the time of charging.\nCamera is awesome and the display is fabulous.\nValue of money.\nFull handsome."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Great phone within this budget. I have been using it for 1.5 months now. Battery is staying 2.5 days, even after playing candy crushers and watching movies in hotstar or amazom or YouTube. Picture quality great too. Happy and satisfied using this phone."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "This mobile is very very good😘😘😘😘\nCamera quality are best in segment📸📸\nBattery backup is very good\nI love samsung"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Not Good & Not Bad\nAfter 3 days used.\n\nPros: - 1.Good camera both selfie and Rear. Both camera have Flash light and rear camera useful zoom option available.\n2.Slim design.\n3.touch is very smooth 👌.\n4.single take capture give better result.\n\nCons : - 1. screen heating issue near selfie camera.\nSoftware updated but heating issue not solved.\n2. Screenshot option is not available in notification bar.\nScreenshot capture palm sensor option not working.\n3.charger cable is very short."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "It vry nice set. Berrtry performance it average typ"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Very nice mobile. Used 1 week, there is no any trouble. Smoothly run all apps. Camera is very nice. Best in his category."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Today's I'm writing my review after 12 days used.\nFirst of all I would like to say it's front camera is best, awesome as per as 32MP and rear cameras are also good, one thing is best in rear camera is change background effects which thing I liked so much.\n\nNow I will come on battery 🔋backup, it's battery backup is also good as per as 6000Mah. If your phone is 100% charged then I will work 2 days. And now would like to say it's performance, it's performance is best no lag and work smoothly. ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Nice 👌 mobile"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Highly Recommended to Buy\n\nGreat Phone! What a Buy\n\nI Have Purchase it on Big Billion Days at Flipkart\nTill now Great Performance.\nI want to buy a phone which have Great battery and camera feature, Samsung F41 fulfill my dream.\nNo lagging, long lasting battery, superb camera quality simply wow.\nBattery takes 2- 2.5 hours to fully charge and give us wonderful backup. My all work on call & whatsapp can easily manage in one charge. Also you use YouTube, gaming internet Surfing in one charge.\nC...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Amazing camera quality and overall it's worth it\nReally liked this mobile phone and battery back is also amazing...\nThis phone was gifted by my wife on my 50th birthday and I really liked this phone and definitely going to suggest others as well for this piece\nThanks a tonn 😊"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "First of all I would like to thank Flipkart for smart upgrade deal.\nAnd the second is Samsung for this wonderful device\nScience many months I am looking for a device for my business needs This device fulfill all my needs very special thanks to Samsung and Team.\nIn this\n1. First I like battery backup \"supper Backup\" usually I need to use very hardly 8 hrs per day (in this mobile data& Hotspot and 8 to 10 apps will work background) remaining time use as normal 95% 🔋 will work for two days co...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Amazing products"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "For the value paid it's a good phone. 64mp camera but comparing to Vivo 48mp camera quality this one is not good. Battery is average lasts for a day with normal usage , sound quality ok. Refresh rate is good . Os could be more user friendly"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Doe's the job..\nPros: Display, features, battery,fast charging,3.5 mm audio jack,usb c,dedicated memory Card slot.\n\nCons: Camera,processor,general lagging in some apps like YT music, vibration motor"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Ita a batter quality mobile phone I really like it nd it is a value of money👌👌👌☺️☺️"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "best phone for this prize..camera quality...battery backup and display is awesome but shlowmotion video is not good ..overall 4.5 rating phone"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Excellent product in this range, happy with screen, memory & astonishing camera quality. Thanku flipkart, for fast service, you did your part very well."
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Phone is great. But it takes too much time during charging.. it takes above 4hr to full charge.. otherwise everything is great.."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Camera is above good\nBattery is the best\nIt charges full in 2 hrs almost\nPerformance is good but camera portion get heated after heavy use\nDisplay is best\nWorth buying\nSpeakers are good"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "After using of more than a month I feel it as an Awesome mobile. Value for money, camera is slight yellowish, but overall good performance. Battery stays more than 2 days after hard use. Gameplay quality is good. Selfie camera is awesome. Slow motion mode is really good. Music quality is like other mobiles. Its internet catching power is of another level. If I start to download a 100 mb's app, It downloads it in 2 minutes. Its live focus is just amazing. I am fully happy"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "After using 5 months , i know what's good and bad in this phone.\n1. Charger is 15 w , that is slow in this decade .\n2*. Over heat in upper half of phone mostly while using camera\n3. Camera quality is very good.\n4. Best part in phone is it's display\n5. Battery life mashallah ( very long life )\nOverall this phone is good in everything (except heavy games)"
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "Not bad"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Nice phone if you need a display and camera phone so this is for you very good quality display and camera but in Performance it is worst. Phone gets heats in 5 to 10 minutes usage if you are a light user so u can go for it and if you are heavy user so don't buy. Overall it is good."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "The camera is good. Main attraction is the screen resolution. Memory is taken according to it's need...6GB/128GB. Running fast now. Hope it will work fine throughout."
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "To be honest it is the most value for money smartphone till date. Even if you have slightest idea about smartphones I can say one thing from my heart you can go for this Samsung Galaxy F41 blindly without a second thought. I promise you that this phone will never ever gonna disappoint you. It is blazing fast cause it has the best processor,Exynos octa core,it has the best camera in this segment way better than redmi, mi, oppo, vivo, realme, nokia, lg, panasonic, etc.,64MP(Main)5Mp(Depth),8MP ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Everything is good about this phone.\n\n1: great camera\n2: awsome battery backup\n3: display is just wwwoooww.\n4: fast processor"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Awesome mobile.. superb display and camera..Thanks to Flipkart for super fast delivery.. 😊"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Super. Mobile 👌👌 camera Nice 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "In one word........awesome 👌"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "nice camera&display superb"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Nice phone for normal use."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "I bought my phone 23.12.2020, good looking and very good camera, best battery backup, display also good, all of value of money. Flipcart delivery also very fast."
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Its good phone"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "As expected"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Samsung galaxy f41 overall very very good\nM happy 😊"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Very nice phone Very smooth functioning"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "I was not sure about the phones under 20k. Came across this one. And I absolutely don't regret choosing it. The color fusion blue as the name suggests, is a fusion of blue and a shade of black intermixing with it. Camera is amazing. Samsung never disappoints with the resolution, so it's bang on. I was uncertain about the battery while purchasing, but this one has a great battery too. The performance is brilliant. Please don't hesitate to buy this model. I am critical about purchasing phones, ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Performance of display is so good and value of money everything is good thanks flipkart..."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "I am happy"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Awesome camera\nAwesome battery backup\nIt's a value for money\nBest feature of this phone is camera 64 mp camera which is outstanding photo clearty good battery backup only need to improve fast chargeing take 2 hr to full charge"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Excellent Smartphone!\nI am very happy to buy this smartphone.\nLook is so beautiful.\nPerformance is better than others.\nCost is good....\nI love it...\nIf anyone want to buy smartphone then I suggest to buy this smartphones"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Best mobile this price but nit gaming processor, and every task best preforme .. but my thank godess is camera, display, battery, and build quality I'm so happy it's my little friend."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Great phone display and battery is superb display is smooth and I love this UI camera quality is awesome\nSpecially I like single take option"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Galaxy Fantastic 41 is what I would call this latest gadget what I posses from Samsung!! To start with it's really sleek and the way the edges are smoothly bewled, feel like not letting it go out of your hand. Not just that the reason it's fantastic also is the battery is massive 6000mha and lightweight hence it's Fantastic 41!!!\n\nPictures taken on this Fantastic 41, is really Fantabulous. I did visit Goa last week and those snaps are going to be my best memory ever in the land of Goa. The q...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Display is awesome like always\nBack camera is good for this price\nI'm satisfied by the battery backup\nOverall a good Mobile phone\nUndoubtedly you can go for it\nFaster delivery by flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Excellent phone in this price segment,super phone with full on specifications, without any confusion go for it..Camera excellent with many super options like as single take, single take works on moving moments or stilling moments,get a super images with 6-10 super quality photos with GIF video,battery super super..Processors also 👍"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Mobile performance is outstanding and battery or camera so lovely work and video recording clearity is awesome always best ❤"
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "It's been a while since I bought this phone, camera setup of phone is amazing but the display is not that great like other Samsung smartphones. Though battery life is excellent but if they would've give a 18 or 20 watt charger, would be better cause it's take almost 2 hrs to get fully charged.\n\nIf you want best camera setup then go for this F41. Other this is not for gaming...."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Best Smartphone by SAMSUNG. Mostly Battery Service is very good & Screen Resolution is too good and Clear. It works fast. Both sim access 4G Network with same time. Overall This phone is incredible for me. Thanks \"SAMSUNG\" & Thanks to \"Filipkat\"."
    },
    {
      "User_Rating": "3",
      "Title": "Decent product",
      "Comment": "Good product"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "It's a very good product"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Nice 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "In short I have never seen any problems in this phone. If someone using this phone for normal use then I easily recommend this. Under this budget I rates to the 📱 5/5."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Everything is excellent be it camera or screen or performance....!"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Nice phone"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Excellent product"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Awesome camera and performance!!!"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Amazing phone"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Camera Quality is awesome and operating speed is good.\nValue for money..."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Brilliant mobile....."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Really nice phone"
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Mobile is not very good as expected ..😔..Camera disappointed me alot .... After clicking a pic ,the photo is not clearly visible when i zoom it ...charging is very late ..Otherwise performamce and phone's look is very good..."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Very good 👍"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Good mobile for day to day light users as this mobile has Samsung exynos 9611 which not a great processor. Camera of this mobile is quite good as considering its price. Battery of this mobile lasts really long as it is 6000 mah. Display is good because it is super amoled. But you cannot do heavy usage as it lags a lot because of its dull processor. Overall ill recommend this mobile to those who want good camera with good display and battery. If you are looking for a performance based mobile t...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Very good product"
    },
    {
      "User_Rating": "3",
      "Title": "Good",
      "Comment": "Best phone in this range, everything is good but it has 15 watts fast charger which take more time to get full charge. Overheating problem arise when you use more than 1hr. Phone get very hot if use continuously."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Camera quality is so good and battery backup beyond my expectations as compared to all brands music is ok"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Awesome phone and battery"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Camera is awesome 👌and display too. Touch is so smooth"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Beautiful Mobile with Good Battery Back up. No heating issue. awesome Camera quality."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Awesome camera and battery\nGreat job Samsung for giving priority to camera\nSuper display ...."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Very nice product, selfie is amazing and it's a worth buying this product... And the rate is cheaper than compair to other mobiles... Thanks to flikart and Samsung topology....."
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Very good"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Not for gamers,\nCharging could be a little faster,\nCameras are good but expected more from a samsung phone,\n\nBattery backup is more than expected,\nDisplay quality is awesome as expected from samsung,\nPerformance is overall good if we dont consider it as a gaming phone.\nBest mobile in this range for normal users."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "This is the best mobile phone in this price range... It has great camera, great battery, great display which is super AMOLED.... And what else uh want... So these features make it the best budget phone"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Good...value for money"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "First of all, congratulations to Samsung for bringing out F41. It exceeded my expectations. Great display, outstanding battery life, very good camera, fast processing without any lag. Go for it."
    },
    {
      "User_Rating": "3",
      "Title": "Fair",
      "Comment": "1. Performance is not up to the mark as per the given spec,\n2. my need is not served as I purchased this mobile for better connectivity as in my area network signal strength is weak..there is no improvement in call quality in comparatively with Redmi note5 pro.\n3. I opted this mobile because of the brand which is not belongs to China."
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Nice 👍 phone"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Amazing supeer mobile camera quality is best ND display all off best"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Nice quality awesome"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "No good for gaming but good camera and good for day to day usage........ I recommend you to go for it, if gaming do not matter you....."
    },
    {
      "User_Rating": "3",
      "Title": "Just okay",
      "Comment": "Samsung💕..camera Loved it❤❤\n... But somany issues... Battery is 6000 but it is not getting more than one day.....\nWhen charging it is heating... My old phone is oppo f3..compared to that it is waste... I want a small change.. So i come to samsung family... But not comfortable with this product. No applock is provided and musicplayer... So i download third party apps... When using internet speed is slow... My rating is 3 out of 5"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "This is an excellent device camera, display and functions are too good overall best for everyone. I will say in this price its too good go for it and enjoy SAMSUNG name is enough...."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Overall Good. Go for it"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "I am very happy. don't go with the negative review.just buy with flipkart."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Good phone camera and battery and battery and display is awesome."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Awesome product !!"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Very nice product and smooth running"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Love it"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "I have using this product for almost 2 months and i am really satisfied with this product. For daily tasks this phone is awesome. And the camera performs very well."
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "Go for it ...just loved it!💞"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Its a worth for money product. No Hanging issues..6GB RAM is enough to run many applications at a time.. If you are searching a smart phone within 20,000/-. It's a better option. Good luck"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Detailed review after 2 months of usage:\nProcessor, multi-tasking & display (4/5)\nSamsung F41 is sort of a budget device with the tried & tested Exynos 9611 at its heart. A capable processor for day to day tasks, content streaming & basic gaming. Display clarity & colour reproduction is superb as it is a Super AMOLED screen.\n\nBattery & charging (3/5)\nPrice-wise I think Samsung should have given either a 20W or 25W charger in box or at least provide support for that. So, at least one could c...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Best smart phone under 15k"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "I really satisfied with Camera. As it has 6000 mah battery it does not give that much battery backup."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "It's Front Camera is very Good and Back Camera is better than front camera.Overall it's Camera quality is very Good . Battery Backup is Good.when your phone is fully Charged and use for normally work so it's battery running 1 Days continuosly.But you are playing Games or anything then it's Battery running in half a day continuosly.it*s charging speed is very low. it's adapter is 15 W so it's charging speed is slow. Display is awesome because it's AMOLED Display. It's Display consuming Low bat...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "NYC performance, NYC battery backup, NYC Camera (both Rear & Front), NYC S.AmoLED Display and very much functions and specifications which I can't list all...Don't look for any other Phone . This Smartphone is worth each Penny.😀😀😀.\nThis phone can truly satisfy all the needs which a child/a man/or anybody would hope .\n1. Very nice 64mp Rear camera, Single Take, 4k video Recording, Slow Motion & Super Slow Motion & Night Hyperlapse and much more brilliant functions.\n2. Excellent Front Camera...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "It by far best phone. Affordable, gud camera, light weight, kudos battery backup"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Phone is attractive and it's amazing performance and it's display is winning my heart day by day. And it's camera is own to take picture of anything(nature and forest) mostly.Depth of camera is own I love it.I want to suggest to buy this you will definitely surprise after seeing this phone."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Awesome mobile.. like it.. very good phone from Samsung.. nice display and battery and camera is very good.."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Samsung S. Amoled display is awesome and different from others. Its camera also good with good battery performance..best budget phone of 2020."
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Good one in price segment"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Better than most of the Chinese phone. Got it in the offer thanks to flipkart.\n\nBest in display\nBest in battery\nBest in weight\n\nOnly back case is of plastic that doest matter we use back cover"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Value for money"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Very nice mobile.. Worth product....."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "camera performance nice...bettery is also bery good...i visited the sky......nice phone"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Samsung F41\nSmartphone with Fabulous41 Performance with Fabulous Camera"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Best in camera but slow charging and laking problem"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Good and ok"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Super exlent good for battery and super amoled display fast charging"
    },
    {
      "User_Rating": "5",
      "Title": "A decent performer...",
      "Comment": "Got the 6/64 variant for 11k including exchange + 10% credit card discount. For this price it's one of the best value for money phone. Have been a Samsung customer for more than a decade & have used many flagship phones & this phone didn't disappoint me.\nBest in class Amoled display, decent performance, best battery backup, good camera & overall it's a complete package for the price. If you can get this phone for less than 12K including discounts, you can blindly for it.\n\nExynos 9611 SOC is n...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "super quality in camra"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "This mobile is very good and good camera"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Nice mobile\nCamera quality is nice"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "To good 👍"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "In this range it was worth to buy....."
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Almost ok .For normal user not for gamer."
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Good 👍"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Supar mobile 📱 ♥"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "On this price range\n\nThe best you will get\n1. Display\n2. Camera\n3. Battery\n\nThis mobile completely for Photograpy & Video suit... and yes Best you will get in this range with brand...\nAnd not for high end Gaming... for gaming plz choose others...\n\nAnd for me its awsome experience...\nBut i feel some tighten to insert memory card... memory card feel jam to insert...its may be a problem...."
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "CAMERA IS BEST .....VERY DECENT CAMERA, CHARGE SLOW, SMOOTH TOUCH, TOTAL AWESOME. BETTER THAN CHAINA BRAND ... GO FOR IT .SAMSUNG IS BEST FOR TRUST. I AM HAPPY FOR THIS MOBILE."
    },
    {
      "User_Rating": "3",
      "Title": "Decent product",
      "Comment": "Best battery, Normal camera, display is good\nBest phone for daily normal user\n\nCamera at night is worst, front camera is waste"
    },
    {
      "User_Rating": "3",
      "Title": "Fair",
      "Comment": "1:Display is excellent\n2:performance is average as expected with this chipset ( not for gamers) ,\n3: camera is not as expected, athough it uses same camera sensor which is in m31 but m31 gives better result because f41 unnecessarily smoothen out the picture,which makes picture not looking sharp. Actually i found picture from even redmi note 9 better than this with 13 MP front camera instead of 32 MP.\nFinally, Product delivery is really fast, i feel like flipkart making it norm to deliver sm...\nREAD MORE"
    },
    {
      "User_Rating": "3",
      "Title": "Decent product",
      "Comment": "Wow"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Purchase this device for my friend. This phone is best in this price range.Camera is just superb and Battery is remarkable. Overall this Samsung phone is mind blowing in this price range. Simply go for it if you r Lover of Samsung and your budget us around 15K."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Lovely Budget phone with Fantastic Battery Back up and Camera. The processor could have been Qualcomm Snapdragon at this range, then it would surely outcome other competitors. Nevertheless a fantastic by Samsung at this range"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Ideal phone for a medium usage. Initially there were some hiccups, but after few days of usage it was fine.\nAfter exchange and offer I got this phone for 10K.\n\nCamera: 4/5\nDisplay : 5/5\nPerformance : 4/5\nBattery : 3/5 ( As getting it charged take a lot of time, though it has 6000 mAh)\n\nOverall a good mid range phone, however I believe its better to take M31s with some extra money."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "This is a very good smartphone.\nGo and buy it.\nDISPLAY: 5/5\nBATTERY: 4.5/5\nCAMERA: 5/5\nPERFORMANCE: 4/5\nLOOK & FEEL: 5/5\nOVERALL:❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Great camera\nPerformance is good\nBattery backup is great,take more time to charge.\nDispla is awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Cell super but dual apps not supported except social apps"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Good product i liked it ... 😊😊😊😊😊😊😊😊👍👍👍👍👍👍👍👍👍"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "It's just amazing,....plz don't compare with any china products"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Very nicee phon 14500 thanks flipcart"
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "IAM sooooo happy"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Choosed this phone because i dont want to buy a Chinese phone though xiomi note 10 pro was very tempting at this price range. My initial aspiration was F61 but that was a bit overpriced( around 25k) now. So shortlisted f41 and motorola g60. Finally decided in favour of F41 because of the dedicated memory slot. If you realy need a macro camera then go for m32 or some other quad setup. So far Iam satisfied with this phone and happy with my selection\nHistory\nUpgraded from realme5\nRealme was earl...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Flip cart service is very good.\nSamsung Co has not provided ear phones for the value of 14500... ? Why .\nIt's a basic requirement with the phone.\n\nPhone is good but charging issue.\nSamsung has not provided fast charger. It requires 3 hours for full charging. They advertise its a fast charging. Either mobile complaints or charger.\nBattery back up 6 to 7 hours only is poor performance.\nThis is my 11th phone from fast 20 years and I use Samsung mobiles only.\nI didn't compare this to any o...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Go for it."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "What I expected from this product, it actually performed better than my expectations. It is extremely nice product. Samsung gives you good specifications at low price, that is the best part.\nTwo things I liked the most in this phone.\n1. A handy 6.4 inch super amoled display.\n2. 6000 mah battery"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Value for money best in this segment i m using from last one month and i m so satisfied from this good job samsung"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Fantastic,\ntake a look what a amazing shot clicked by me."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "This is the perfect product at this good price with Good Super Amoled Display, powerfulful speaker grill, amazing front and rear cameras, also with a Big battery, with many comfort features like one hand mode, live caption, always on display, vivid mode and many beautiful features also it has a toch sensitivity which allows you to feel more special while using the device. I am really very happy with this product."
    },
    {
      "User_Rating": "5",
      "Title": "Best budget Mobile Phone.",
      "Comment": "1. Camera is the best beyond this budget.\n2. Zoom feature is perfect but control button is to be fixed by the developer.\n3. Over all this model is best phone with huge storage.\n4. Thank all.\n5. OK"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Camera quality and features is good, Battery is ausom, touch quality is very smooth as like always provide Samsung in every phones, overall value for money..... good show Samsung in this new F series.......\nI'm sharing a rear cam. night image sample in below so u can understand better the quality of image."
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Phone performance good but net connection not properly."
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "It takes more than 3.5 hours for a full charge. I don't know why do they say as Fast Charging.. also phone hangs at times. I had to lock and unlock it for 3-4 times to make the screen work."
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Its good phone, with good performance and battery life.\n\nSometimes its hangs, sometimes its lags, misconduct.\nBut most of the times it performs well and good.\nSound and camera quality may be more good.\nLets hope for good update.\nOverall its value 4 money phone."
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Overall value for money 💰\nCamera is ok ok and battery is good."
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "Very good camera and battery and performance is very good value for money"
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Good one in this range"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Nice product"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Great camera, also in night mode and the ultrawide too"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Very nice 👌 after the first time purchase 🤠"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "phone is good. good cameras. performance is good for daily usage like calls, massages, social networks, youtube etc. for gaming i wont recommend this mobile. Display is super. Watching videos was awesome. Missing the fast charging is drawback in this phone. Of course 15w charging was available in this phone. But nowadays 15w is not considered as a fast charging. Overall good phone for daily usage in my opinion."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Nice product from Samsung.\nExcellent Display and sound quality.\nMedia consumption is good in this device.\nAbove all a nice experience with this smartphone.\nWorth every penny."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Good camera, good battery life, perfect display, value for money phone... just go for it.."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Best camera. Photography is my hobby but it was not convenient for me to carry my dslr all the time, I needed something to fulfill its gap and I found this. Thanks samsung for this wonderful device.\nNice performs. Nice display.\nI am reviewing this product after 5 months of use.\nI will recommend this product who so ever want to buy any smartphone under 16000."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Using from past 15 days... every aspect is good as of now. Battery backup is good. Can be used for 2 days without charging unless you play high end games for long time..\nCamera is good for this price.\n\nSince the display is super amoled u need to be careful... better get a good quality screen guard and back case. Even the screen is gorilla glass but I recommend u go for screen guard and back case.."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "First off all this smart phone has got android 11 update which is great ...\nCamera is superb\nLowlight photography is good enough with respect to price .\nBattery life is awesome. Even after heavy use for the whole day 40 percent battery life remains when I return home at 8 pm"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Best phone in budget"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "I think in this price range ..this set gives me all the things which i want."
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Best Phone within Budget.\n\nMaximum feature at minimum budget.\n\nCamera quality is awesome.\n\nDisplay and Touch is smooth.\n\nVideo quality - 1080p HD\n\n4G and network connectivity - Excellent\n\nBuilt Quality - Robust and slike.\n\nHeating - Not so much.\n\nCharging - Fast and quick Charging.\n\nDon't hesitate go for this phone."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Excellent performance, battery backup super ,best budget mobile with 6gb ram.\n2 days battery backup.\nSimply superb and fabulous. Best mobile for this price.\nThank you Samsung and Thank you flipkart."
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Pros\n1. Battery capacity\n2. Amoled display\n3. Decent camera\n4. Don't feel heavy on hand\n5. Lowest ever SAR rating i.e. 0.383\n6. Most of the bloatwares can be uninstalled\n7. Nice UI\n8. Gorilla glass\n\nCons:\n1. Charging time is almost 3 hrs despite fast charger ( told to be 15w)\n2. Processor could have been the latest one, whereas their competitors offer SD 750 for this price tag."
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Camera quality is not worth 64 mp\nIts look like 20-25 mega pixels apart from it\n\nEverthing is good but price is little bit higher when we comapre its feature physical dimensions disign"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Mid range phone from Samsung.\nCamera is good.\nBattery is enough fo 1.5 days of general usage.\nBuilt quality is not good low quality plastic material used.\nDisplay Quality is best at this price range"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Good mobile by Samsung, wanted to buy NON CHINESE mobile. MADE IN INDIA."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Very good"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "You should definitely go for this phone. Better display, best battery, better performance and best camera experience till now"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Good camera and good display"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Very nice phone🥰\nExcellent cemera👍\nGood battery 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Value for money , good product and fast delivery."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Excellent"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Nicely taken this captured"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "This phone is superb ..good battery backup..best quality camera this 13999 price range..but Heating issues.but overall best phone."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "This phone is selling a lot, and I have one too. The first thing that I noticed on opening the box is that the plastic film in which the phone comes wrapped in, was full of dust, like as if the phone was packed in a haystack. Poor quality control, I have seen another person write about this issue.\n\nComing to the box, there is a 15 watt charger that isn't very fast but the phone shows fast charging when connected. The type C cable is shorter than the standard cables but the quality is very go...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "If u are looking for a good non Chinese phone then I think this is best buy. Battery is good with full charge last for two days.I am not a gamer...Display best in class and both front and back camera are good. Finger print sensor is quite quick...non heating issue and lag in performance. After card and exchange it just costed me 7k...earlier I was using iPhone 6s and its a much better phone in all aspects...only drawback in that build quality is not good specially back..u need to have good qu...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Camera Is Awesome Best Picture Quality, In Affordable Price Worth it, Value For Money. 😊"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Nice camera is good looking pics,charging also better and nice display and fast working"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "It is great deal. I got this mobile in price 14499.. I am very happy with the product. I am always trust for shopping in Flipkart.com. Thank you..."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Nice phone"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Nice phone , camera is nice, display is super, good battery and nice performance , good for my cousin"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Awsome phone best camera best and beast battery and body color and everything I love is samsung"
    },
    {
      "User_Rating": "4",
      "Title": "Mind-blowing purchase",
      "Comment": "Nice 👌"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Phone is good,with lots of features in it at this price point.\nBy my view phone is only for the people who use phone for moderate use. U can't expect this phone for gaming as its processor is not very good. Battery is good. Easily can 1 or 1.5 day of power to phone. Camera is also satisfactory but not the best. Display is excellent in this phone . No doubt about that. Charger is just of 15 W which charges hpur phone in 3 to 3.5 hours form 0 to 100 which is too slow but considering the price ...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Superb all-round phone in this budget. Display is excellent, camera is very good, performance is good but battery does not feel like a 6000 mah battery.\n\nDisplay 4.5/5 excellent super amoled Display don't compare with s series phone but excellent and vivid display.\n\nCamera 4/5 camera is very good though not as flagship phone but perform much better than our exceptation.\n\nPerformance 4/5 performance is now above average just started using.\n\nBattery 3.5/5 battery extra .5 for charger otherwise ...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Amazing product launched by samsung overall performance is good the only thing which i thought to be it's pros and cons is it's waight. It is little bit heavier which is also due to it's large battery capacity. So i thought it should be ignored while choicing this mobile. Absolutely stunning....."
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Amazing quality with low price all people must try to buy this set"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Im giving this review based on money I'm paying:\n\nCameras are best with lot of options at this budget\n\nBattery was 6000Mah it's good to last long but drawback is lack of fast charging it takes more than 3hrs for me.\n\nI'm not a heavy gamer so the performance is good enough for me.\n\nOne of the best display in this budget loved so much while watching movies.\n\nI got this for 13k it's an alrounder at this budget."
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "I love samsung products..... Super.... Value for money also............"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "I'm using this since it has launched and it gave me a lot value for money"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "All good but some features are missing which MI phone has for instance you can lock any app. in MI without installing app lock app. Unlike samsung galaxy f41 . There are few more things which can be improved and missing. Camera can be improved . If you are looking for camera ph. Go for Real me ."
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "I was using chinese smartphones brand cause they were so known to offer lots of features in low price,recently switched to Samsung F41 on my friend's recommendation,I was amazed with the phone when I got it on my hands,it was so light and slim considering the battery,the display is no doubt the best in class and the camera did impressed me,here are some shots I am sharing shot with scene optimizer"
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "Phone is very nice and got this at a very good price of 13k with 6gb and 128gb.\n1 star is less due to experience with delivery person.\nSo unprofessional and rude."
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Reviewing this Phone after 2month of use. Battery is good. Camara is fine displays and other thing is ok. Phone is little heavy in weight."
    },
    {
      "User_Rating": "4",
      "Title": "Great Choice",
      "Comment": "I am a regular normal User writing first time for any mobile, After two days of use. i use this device for all basic and daily useful things. One thing to say for those who are looking for Non chinese and handy smartphones with premium inhand feel this is the perfect sphone. Yes its perfectly handy for one hand use not bulky TABLET, and its In hand feel and display are like you are holding some premium flagship samsung Device.\n\nPros\n> Brilliant sAmoled Display and Premium touch experience...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Very good mobile in terms of quality,camera,display and performance.but after update sometimes it gets very minor lags.but ok 👌.very good feels when holded in hands"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "FullON fun using this device...\nFabulous camera, smooth touch and display experience, long lasting battery and trendy design all in one Samsung Galaxy F41...\nI'm glad to have this phone.."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "camera quality is superb look like natural image.super AMOLED display is better experience for me wonderful battery FULL OF ENERGY .totally my experience is fabulous fon in this range."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Very Good product... but inside no case"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "Camera is okk good quality\n2-baiatry not good compare to realms narzo 20 6000mah baithe\n3- display is best\n4-overall good phone\n5- fission green nice clour"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Camera, Battery, Display, performance all things are good and in this budget this phone is best😎😎👌👌👌"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Excellent"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Pubg game play smooth game play"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "I was a bit worried after seeing the reviews but after almost using for a week I don't have any troubles. Thus is an everyday phone you can't game very well but for normal daily use. This is the best you can get."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Best phone but camera is not good"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Mobile is good but charging cable is very short and charging speed is very slow than description in detail it take more than 1 hour and 30 minute it's is c type and it is not fast charging mobile is good but charging take long time"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Nice"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Hey! Received the mobile today. Purchased it for my Dad. Being a mobile freak, I check all the features minutely. Mobile working properly (of course it will). Have ordered another too for my Mom. Will receive it tomorrow. Once I have two F 41 with me, will click pics of one F 41 from the camera of another F 41 and will update the review soon! Happy shopping guys!!\n\nSaket Saurav\nAdvocate\nSupreme Court of India"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Good Mobile . Battery backup is ok. Camera is Awesome. Display is good and Sound is also nice. Overall a good deal if bought with Samsung smart upgrade plan"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Very impressive model launched by Samsung his camera is very good both side front and back, battery backup is nice,Totally value of money also thank you flipkart for deliverd on time this phone."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "After 4 month of usage i m giving my reveiw Camera is bit disappointment as it don't meet the specification of 64mp even it is not that much good as of my previous mobile' samsung on max's 16 mp camera though the front is great, battery performance is also good. Overalll the phone is good but need improvement in camera . Hope it could get better with next update."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "I am happy"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "1🌟 - FAST DELIVERY AS WELL AS DELIVERY PERSON IS POLITE AND WELL BEHAVIOUR.\n\n2🌟 - THERE IS NO PROBLEM IN THIS PHONE AT THE DELIVERY TIME.\n\n3🌟 - DISPLAY IS GOOD AS WELL AS SAMSUNG \" UI \" IS ALSO EASY TO USE AND FAST .\n\n4🌟 - CAMERA IS MUCH BETTER THAN EXPECTED . I AM AMAZED BY IT'S PHOTO QUALITY . BOTH THE REAR (64MP) AND FORNT (32MP )CAMERAS ARE GOOD.\n\n5🌟 - SOME EXTRA FEATURES MAKE THIS PHONE BEST (FOCUS MODE , SIDE BAR , GAME LAUNCHER , EDGE LIGHTING AND MANY MORE)"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Nice phone ...camera is too good"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Very nice camera quality"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Battery drains very faster after updating software"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "👍👍👍perfect picture clarity"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "It is very good phone on this budget I was giving my review, The best phone I ever use in this budget\nBest for gaming\nBest for camera\nBest for every thing"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Display is awesome for price point. Camera is descent. Value for money. I got it for 10.5k\nBut gaming wise it's not a good performer."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Most beautiful Camera"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Samsung galaxy f41 phone very good phone ***********"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Very nice phone phone camera is good and long battery phone battery is very good but charge is low 15 w charged"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Selfie camera very nice 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Very nice Handset in this money"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Excellent smart phone by flipkart.. amazing battery life, camera and also speed. Must buy. Thanks flipkart for your secured packing."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "It's my dream come to reality.\nAmazing phone"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "First time using samsung mobile and I'm loving it."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "What a amazing thing of Samsung galaxy. Must buy"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Awesome touch camera quality is clear and realistic in pictures. Handy set waight is low battery backup very good. Sound quality very loud and good. Over all product is very good. Flifkat service very fast delevay boy is polite viaveor very copoarative."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Good"
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "Genuine review - this is my first samsung device...\n1. Camera - average camera both front and back too 32 MP front is only hipe in real I think it's 13 MP\n2.Battery - one day usage same as 5000 mah .If use only calling then it will be 2 or 2.5 days\n3. Build quality - plastic and average design.\n4.Heating - it's heatup when u use more than average I never played game.\n5.Network - it's has some network connectivity issue.\n6.Price - price is too much as per specs.\n7. Charging - it's take more...\nREAD MORE"
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "Giving 3star , one star deduction due to flipkart and other due to heating issue while using camera\nI'm reviewing after 7days . I'm telling only cons , all other are pros . Flipkart delivered on time but little scratched phone . Return policy is not good because u can only one time replace it .\nPhone heats while using camera , u can play heavy games but it heat up . Charging time is high but u can't better expect from a 15w charger .\nAll other things are good enough...\nREAD MORE"
    },
    {
      "User_Rating": "3",
      "Title": "Does the job",
      "Comment": "Performance is very worst.With in 1 month mobile have hanging issue."
    },
    {
      "User_Rating": "3",
      "Title": "Decent product",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Very good product at a reasonable price\n\nPros\n1. Good camera\n2. Good display\n3. Handy\n4. Response time of finger print sensor very good\n\nCons\nNearly 2 months usage only. So far none"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "The Phone is good and front and back camera is awesome. One problem is that the phone heats after a usage of 3 - 4 hours .\nThe processer EXYNOS 9611 is not good, and delivery boy was also talking rudly. He was not taking the exchange item.\nLookwise phone is good. The battery performance is also good and the display is also good but sometime the phone lags when it gets heated."
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "I just want to mention cons as pros everyone knows and u can check in youtube.\n\n- charging time is upto 2 hrs for full charge.\n- phone design is smooth but I don't like it slipped so many times . U definitely need back case or cover. I am not comfortable in handling without backcover.\n- Figerprint sensor don't work quickly...I need to try 2 times atleast.\n- major issue is call drop in secondary sim.. I reported issue to service center. Found way to solve that. Cellular network should be se...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Camera is awesome at this price range."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Samsung Galaxy F 41 super phone Battery Pack Up amazing camera super 64 megapixel friend camera 32 megapixel Super Khiladi display full HD super phone super"
    },
    {
      "User_Rating": "3",
      "Title": "Good",
      "Comment": "Highly satisfied with the photo quality and inbuilt AI. If you are not a gamer you can go for it. The reason behind my editing the review from 5 star to 3 is that the phone cannot capture weak signals. When you are in a area where subscriber base is bigger, this phone surrenders itself. No calls can be received, not a single \"hi\" is delivered in WhatsApp. Disappointed with this loophole."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Very good 🙂🙂"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Good..Nice❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "This product is very helpful and enough memory and camera is very nice and very good product."
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Samsung f41 is almost best for long time .\nI give rats\nBattery. 3\nDisplay 4\nPerformance. 3\nValue of money. 5"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "I am writing this review after 1 month\nThe phone is awesome..everything is just amazing\n1) Display - the super amoled display is superb (5/5)\n2) processor - exynos 9611 is sufficient and after software update I got android 11 one ui 3.0.it's really gud and I haven't feel any lag while using this phone. (5/5)\n3) Battery & Charging - 6000 mah battery and 15w fast charging is killer combination.after the heavy uses (attending online classes and all) I used to get 1.5 to 2 day battery backup eas...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Outstanding product at reasonanle price. Excellent camera, battery as well as other advanced technical features. With 128 GB internal memory, even sd card use is not so essential. Ease in operation, with fast browsing. Attractive look, with Samsung's reputation , one will tempted to bye it immediately."
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Not a best phone but in this range this is good..it's camera is very good and the quality of picture is awsm.it's processor is not good, I think it can be hanged in future due to it's processor...now good phone in this range...."
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Handi phone\nEasy to use\nLong battery life\nAwesome camera\nWat else does anyone needs\nLiterally wanna thank samsung for making such an amazing set available at pocket friendly price"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "The camera and display quality is unmatchable..Bought it for my younger brother & maa..they are extremely happy..a suitable back cover is to be attached coz it's back is polycarbonate nd can easily get stratches..other than that no other major issues..a little bit heating issue but can be fixed with regular updates from samsung..Go for it..😌👍"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Fastest delivery by flipkart.\nComing to phone galaxy F41 is a good midrange phone with following pros and cons.\nPros:\nSuper amoled display\nSmooth One ui 3.0 with Android 11\n6000mah battery\nGood camera system\nCons:\nExynos 9611\nPlastic built\n15w slow charger\nHeating issues\nWho should buy?\nBasic mobile activity like calling,messaging,\nContent consumption,medium games playing(no heavy games),browsing,online classes,zoom meetings.\nAnyway my father is happy with this phone.\nMoreover guys it's sams...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Beautiful pic"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Phone is too good I am writing this review after 1 month use. This is fabulous and worth to money . In one words it is awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Best quality with valuable price"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "I just wanna say that it is Awesome !!!"
    },
    {
      "User_Rating": "3",
      "Title": "Just okay",
      "Comment": "After 7 days\n\nCamera: clicks picture with unusual white balance. The picture looks dull with less color saturation. Need to manually adjust the exposure everytime you click a picture. Clothes may come out blur in picture if there is slight wind. May cause of slow processor.\n64mp Camera clicks good picture but when you zoom in the quality is lost as in there is no sharpness. The objects tend to merge with nearby object. Also if there is any written words in the picture they are not crisp.\nWi...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "After watching lot's of reviews I purchased this mobile honesty I noticed that 6000 mah battery not up to the mark and it drain so fast, camera is just ok,super amoled screen awesome ....I can say that this phone is just ok ...ok"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "I have used this phone for one week now. The phone is really good in the price range. Battery is little concern. Overall other things are really good"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Good"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Pros:\nDisplay\nFront Camera\nCons:\nBattery backup is not good\nSlow charging\nRear camera is not good\nPerformance is good enough for its price.\n\nVerdict: Good for parents are elders who will only watch videos and click some pictures also good while playing low graphics game. Not good for performance oriented people."
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "Value for many"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Nice product amazing camera quality"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Best phone under 15000"
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Value for money."
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "I used the phone last 2 days. Overall good phone. Based the price this phone is fine bt battery performance was not good. After complte full charging it give me only 24 hours back up and full carhrging time take long about 3 hr."
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Brought it for 14k,\nGreat display, bit dedicate, need to take care of it as the replacement will take 5k.\nBattery, Cam and over all performance is at par level.\nBudget friendly in non- Chinese sector. But not a very high end gaming friendly."
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Satisfied"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Hi,\nI'm writing this review after usage of few months.\nI felt the battery backup is good,Camera is OK. In call,if you switch to loudspeaker,the sound is very low.That is one disadvantage.\nOverall value for money.\nEventhough they say many camera lens,it is not Great.it's average.\nSpeed of the phone is ok."
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Good product"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Average.."
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Just wow....value for money..\n\n\nF41 🤳 selfie poses...very good 👍"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Good phone for me"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Superb phone on this budget range.\nDisplay and camera is aweome.\nBattery life is very much .\nIn hand feel great."
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Good"
    },
    {
      "User_Rating": "3",
      "Title": "Fair",
      "Comment": "very poor Camera."
    },
    {
      "User_Rating": "3",
      "Title": "Does the job",
      "Comment": "Display is good, battery is good , it's fast but I didn't liked the camera to be honest ,front camera while video call doesn't look like 32 mp and worst part for me is its weight.It weights around 201 gram ,it's heavy for those who has used slim phones before."
    },
    {
      "User_Rating": "3",
      "Title": "A Good budget phone",
      "Comment": "Its a descent product.\n\nPros:\nThe product is handy you can use it with one hand.\nBig battery.\nDescent Images from camera.\nThe display is vivid\n\nCons:\nThe fast charger is not at all fast. It takes ages to get it fully charge."
    },
    {
      "User_Rating": "3",
      "Title": "Just okay",
      "Comment": "Disappointing Display features. The screen stated to be 6.5 inch. But it looks very small. Further, You tube does not play full screen.\nCompared to Lenovo and moto phones, the display is not that crisp and clear.\nAlmost 21 GB occupied by existing programs and apps.\n\nCamera is good quality.\nSpeed is good.\nSome additional features like scrolling of apps across the screen are useful.\nOverall value for money is not that satisfying."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "This is an amazing budget phone from Samsung. I loved the specs. Camera quality & picture is crystal clear & sharp. It doesn't blur or distort with slight movement of hands. The touch experience is very smooth without any lag, probably due to 6gb of super memory. Overall 5 stars."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Good but battery like 5000 mah but screen on time near about 9-10 hours.\nLittle bit data 4g issue in this mobile.\nCamera is best under 13.7k(buy in offer)\nDisplay is best under 20k.\nBack panel looks average.\nSpeaker is good but little bit vocal sound breaking.\nProcessor is above good but not good as snapdragon 710.(not for too much heavy games)\nUi is very smooth.\nNo problem in phone calls.\nDolby atmos is better."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "battry draining too fast. heting problem"
    },
    {
      "User_Rating": "2",
      "Title": "Moderate",
      "Comment": "Very poor performance, 8 days usage, phone started hanging, Samsung apps are killing RAM, very bad experience"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Awesome...\nWriting this review after 4yrs of hard and usage\nBut the device is working amazing\nThe battery life is also very 👍🏻 good."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Plz don't buy this phone. I am writing review after 1 year useage .it's has ICU problem"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Very good"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Super mobile, good camera, battery backup"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Excellent product from Samsung amazing camera 📷 quality and battery 🔋backup upto 2days I will come and it depends how to use phone thank you flipkart"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "The phone is really good for average daily use. Excellent design, good battery backup and excellent camera. Although it heats up quite quickly. Wouldn't recommend it for heavy users/gamers. Also, due to huge battery, charging takes too much time. Samsung should have provided at least 25W charger with it."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Newly purchased SAMSUNG Galaxy F41(Fusion Green) is excellent in performance and it's appearance is so appealing.I have not yet operated it's Camara and don't know it's performance. A very good mobile phone available in budget price!.And my previous Vivo Zipro exchanged at very reasonable price with the help of Flipkart.Thank you Flipkart and Delhivery Curriers for their speedy and secured delivery in advanced scheduled date. SURESH M(Flipkart plus Member)."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Everything about the phone is amazing apart from the processor. If it had a better processor this would be a no brainer. But for the people seeking a non chinese phone in this budget on flipkart and not requiring high end gaming this is the perfect choice"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "GOOD PHONE AT THIS PRICE FROM SAMSUNG. EVERY THING JUST DECENT NOT BEST. JUST A AVERAGE PHONE FOR AVERAGE USER FOR DAY TO DAY USE."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Nice product, value of money 100% satisfied."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "I am in love with this phone .camera is great ..have features like slow mo ,zoom,hyperlapse, and great camera quality."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Bought for my father, don't compromise on the price. It's light weight and also my father never complained about purchase 😅. Has a fast processor, best budget Phone."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Spr"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "I am writing this comment after one week of use ...previously I found that camera isn't good but after using for a week and analyzing found it good in camera front and back both.. battery backup is awsm...overall good product..."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Mobile are excellent and very nice"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Excellent performance. good camera rating 5.0"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Very nice\nCemra is best"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "This smartphone is a powerhouse delivered by Samsung. It is very beautiful (I am using the green one, it has superior touch and feel and really premium colour), has long battery life, good camera, amazing sound, seemless connectivity, nice latest Android with new features, good utility apps from Samsung, elegant design, etc. There's just no shortcoming observed in the phone. There are 4 models of F41 in my own extended family. There are already more than 2.5 lakh ratings of 4 star and 5 star ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Excellent product"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Superb"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Super buy...worth for money"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "gifted to my senior on his birthday..he liked it very much..good battery back up..display is best in this budget...really fast...camera is also upto mark...good for everyday use..samsung proves to be best in this segment."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "This is my 7th F41 now my hole Family using F41 mobiles its So Good and Good camara and Good Life worth for it"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Camara quality is excellent never expect from samsung\nSuper budget mobile 😍😍🥰🥰😇😇"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Very NYC product"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Value for money..."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Excellent phone but little bit expensive"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Good quality\nCamera also good\nBettary back up is very good\nLow price\nThank you flipkart\nDilevary boy good service"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Camera Quality is so owsm"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "The phone is good but charger is 15 watts only its takes time everything is good camera quality is nice.."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Good very good"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Awesome phone at its price\nBest camera\nBest battery\nBest display at this price range\nGood speed performance"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Highly recommended..."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "As expected"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Camera is good... battery backup is very good... delivery is very good (weathen twodays) thanks to Flipkart..."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Full camera hd clarity"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Very good camera and battery\nThanks samsung and flip cart"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Nice..❤"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Very very good product camera is asume.....a"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Camera quality average"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Amazing camera"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "I just say go for it.. Software 11 Android after update.\nFeel like it has everything which you want.. Don't play games for long life duration of mobile. It would be great if it has tempered glass on it and black cover."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Awesome. 6GB ram gives a smooth experience and phone does not heat much."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Amazing mobile 📱 go for it"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Excellent"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Good option"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Good product at this price range.."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Super"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Value for money"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "On this prize range\nOsm Samsung mobile\nBy if u need battry\nCam and superb display"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "It's best mobile"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Very good mobile\nSuper camera quality\nFast charging\nLong battery life\nOverall good"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Phone is fantastic. But flippant has cheated me. First it provide 3750 exchange price of my old phone. But at the time of delivery it reduce the amount 1500 saying that there is a fault in the display. So buy the phone but don't exchange your old phone. Batter sell on olx."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "It's wonderful phone."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Value for money mobail"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Very nice product"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "nice mobile"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Heat then charging"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Worth money if 32w charger is provided and case provided it is fantastic purchase camera is superb"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Woesome phone and nice camera photo and features."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "This is only the mobile wich you will get all features at less price"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Value for money"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Amazing phone now i am using this phone for 3 years and feel like new phone....must buy this phone......"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Amazing phone and good prices"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Nice .tq flipkart I got offer so I paid 13749/_only for this mobile .very nice am happy .since 2 month onwards am using this phone no complaint"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Excellent camera and phone in this prise"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Better then expectation."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "It was a very gud experience nd a very NYC product received...thnx for such a great deal"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Nice Performance & very Camera Quality"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "awesome display , superb battery ,camera quality is very good too.no excessive white like chinese phones. processor review ll give later after 3 mnths as its too early"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "I bought this phone for my daughter’s online schooling. She spends almost full day with this phone in school , tuition and other study . Got good battery backup. Display is bright and not giving much eye strain. Higher display refresh rate would have been better. Performance wise sometime feels lag in app opening and gaming otherwise in study purpose it is good phone. Overall satisfied."
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Nice phone with awesome display and camera"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Superb MOBILE under this range\nSuperamoled display with 6000mh power\nSuperb camera quality and connectivity is really good\nNice benchmark with an outstanding performance..\nBut everything has some drawbacks as it has a overheating problem or heavy use and no Earphone & Protective case from the leading company Samsung is somewhere disappointing.\n\nMust buy phone"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "I'm facing mobile hanging problem after 1 month"
    },
    {
      "User_Rating": "2",
      "Title": "Moderate",
      "Comment": "Camera quality is very bad 64 mp is only for name shake ...picture quality is very poor"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Amazing phone. Gives long battery life aloled screen guves clear and vivid picture so watching netflix becomes a boom in this mobile specially for mobile plan subscribers. Camera is also good and i havent noticed a stutter or slow down of this phone thanks to 6gb of ram on board and 128gb storage is more than enough for my usage"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Nice look and good and smooth touch but slow from my vuvo s1 , but best in price under 12000 , refer to every one enjoy the phone"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Phone is good"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Nice phone camera is so good"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "So cool products"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Great display, 64 MP camera nicely capture 50ft far images.\nVery good battery life with very very less heating.\nFinger sensor lock. Phone with advanced features and good sound.\nReasonable price."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Amazing product on this price range."
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "Good value for money purchase. Positive sides are good display and good battery. Camera is good if we have good light, and terrible in low light conditions. Some use less apps yet good UI. Rest all are good for normal use. Video editing is also smooth if we use full hd footages and lags terribly if we use 4k footages. Overall good for normal usage. Heats up quickly when we shoot videos and put it on charge.\nPeople.with less usage can choose for this. Battery is enough for 1.5 days."
    },
    {
      "User_Rating": "3",
      "Title": "Fair",
      "Comment": "Phone getting struck sometimes..\nFound no heating issues..\nBattery backup is super..\nDisplay also Super..\nCamera above average"
    },
    {
      "User_Rating": "3",
      "Title": "Fair",
      "Comment": "The cheap and bestest phone ever..thanks to flipkart."
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Phone needs update at starting after that it works seamless. No TPU case inside , no screen gaurd. If you need any mobile other than Chinese products, You can take this and this is my no.1 choice. Front camera looks good but back camera not looking like 64mp(need some other camera app). I recommend this product only for long term users because of its built quality, brand and most importantly you can get 5 years system update guarantee."
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Its a good phone for this price... it is one best smart phone right now in the market with this price.. performance is good..Camara quality is good though it can be better...battery is also doing good till now as I purched it at the lunch time.. as of now it is doing good..\nOverall good.. hope it'll remain good.. ITS A GOOD SMART PHONE.."
    },
    {
      "User_Rating": "3",
      "Title": "Good",
      "Comment": "Worst product, started having issues as soon as the warranty got over, then only realised everyone who bought this mobile having similar auto restart issues, got very low resale value, totally pathetic product from samsung, lost the faith in this brand, kind of cheating the customers by giving the best specs on paper but worst on reality. Disappointed ☹️"
    }
  ]
}