{
  "search_query": "Vivo X90 Pro",
  "total_reviews": 139,
  "Overall_rating": "4.4",
  "Total_ratings": "755 Ratings &",
  "reviews": [
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "I am writing this review after few days of usage.\n1. its the best camera in the market currently.\n2. display and performance is great.\n3. build quality and desing is top premium.\n4. Battery backup is good easily give u 1 full day wih heavy usage.\n5. 120 w charhing is grt reach 0 to 100 in 20 to 25 mins.\n6. only one thing can be improved is user experience with funtouch OS.\n7. Night photography is awsome far better than iphone."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Great camera.nice design.waited for this phone for a long time."
    },
    {
      "User_Rating": "4",
      "Title": "Terrific purchase",
      "Comment": "Overall a good phone"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Absolute beast in terms of camera and display and smoothness .. Overall an amazing phone. BEST SMARTPHONE CAMERA in the world"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Amazing pictures camera was marvelous"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Best camera phone so far! I'm surprised by the performance of Dimensity 9200 processor, it's hyperfast. Gaming is seamlessly smooth. Overall camera performance is superb, specially in low lights. Bokeh effect is outstanding, close to DSLR. Camera aperture is the largest i have ever seen in a smartphone. If you're expecting high zooming like Samsung s23 ultra then don't go with this phone otherwise it beats Samsung in comparison with pricing as well. 120w charging is superfast and gives a dece...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "So here is the honest review after using it for a week.\nDesign- Excellent and feels premium 5/5\n\nIn hand feeling - Fells perfect, weight distribution is quite good. 4.8/5\n\nDisplay- Amazing, scrolling is super smooth and feels premium. Though due to curved display sometime accidental touch occurs so 4.7/5\n\nBattery -Decent, Not too great or woow. Needs to be optimized, not the best though i am using always On display and my hotspot is used 24*7. 4/5.Though the cons of battery life is taken goo...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "The Vivo X90 Pro is intended to serve as a handy companion for shutterbugs that want to push the boundaries of smartphone photography. However, there's more to this ultra flagship than just a great image-capturing experience. You also get top-notch performance, a svelte design, lasting battery, and a vivid display. Overall the X90 Pro masters a lot of smartphone traits but it is an absolute champ with its optical skills.\nWorth buying"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Zeiss Effect is Outstanding.\nCamera 📸 Like DSLR.\nPerformance Top Notch.\nBattery performance is super"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Superb camera smartphone"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "As per price...\nCamera is good\nBack camera awesome in day or night\nFront could be better\nBattery performance could be better...\nPerformance excellent.\nNo heating issue till upto day...\nCharging speed awesome full charge in only 27 min.."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "1. Superb camera with 1inch sensor\n2.excellent design\n3.battery backup average\n4.very good display\n5.night photography is really awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "What a flagship phone and camera is incredible everything is extreme I love it go for it if anyone is thinking buy"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Camera is very good"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Simply beautiful and Excellent phone for Photography..whatever Vivo claimed is true ... Excellent Astro photography..S23 ultra or iPhone 14 pro max..none of this flagship can take these kind of pictures..Pixel 7 pro as well...Vivo team this time u guys nailed it..Kudos to your team ."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Product is excellent , over all value for money phone ...camera is good ,.display is good , performance is good , battery is good will give easily 1 day with normal usage , charging is very fast , so no problm ,just go and get it.\nCons.- Just there is some reddish skin tone in camera , over excellent.\nBattery must be improved more ."
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "Good product But battery backup is worst."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "What a Camera. I love the image getting from this device. Vivo X90 Pro is really a Legendary Mobile. The build quality was also amazing. Go for it if you love to click image.\n\nRating : - Camera: 10/10, Build : 10/10, Display : 9/10, OS: 7/10."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "camera,phone design,too good,best camera phone in 2023"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Outstanding product from Vivo.....love the camera....📸📸.....\nCamera 5/5\nPerformance 4.5/5\nBattery 4.4/5\nDesign 5/5"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Super 🤩"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Simply awesome cameras\n\nCamera performance. 10/10\n\nMobile performance. 10/10\n\nDesign. 10/10\n\nDisplay 7/10"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Like most new launches it's a camera that's also a phone. Using the camera and it's features does take some getting used to - sometimes the moment can pass by the time I could figure out the settings :D. Not good for macro shots but again, it could be that I'm still learning!\nI don't play games on the phone but performance is as expected with a premium phone wrt, speed, refresh rate, battery life etc so far.\nThe curved screen looks great but disappointed during usage - I had to tilt the phon...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "good phone back camera is osm but front need some improvement i think....front is also very good but need some improvement"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Great camera phone, battery is ok could have been a little better, front camera should have been 4k,"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Great phone"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "An awesome phone, I liked everything about it.\n1. Camera - it's a camera beast, still need to explore so many things\n2. Battery - 33 hours avg, with 6 hours avg screen on time\n3. Performance is also great\n4. No heating issue"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "The phone is overall good.\nFew things i noted in first 3 days of use:\n1) battery lasts for an entire day with medium usage.\n2) speaker output is good and loud.\n3) still have vivo apps such as - v-appstore, easyshare which cant be hidden or uninstalled. This should be removed from flagships atleast.\n4) display is awsome, but LTPO would have been better given the price.\n5) havent tried heavy gaming, but processor seems capable.\n6) camera performance is good, but in my old phone i have been usin...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Camera is awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Review after 15 days usage\nCamara outstanding display very good performance.. charging speed unbelievable..\nOverall very premium phone..."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "One of the best camera in my experience\nSoftware is good\nDisplay 5 ratting\nZeiss mode superb\nPhone looking was very good 👍"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Good Design , Camera and Performance in this price segment"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Super impressive camera takes it to a next level. Fully satisfied with the device. 10 out of 10"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Best camera centric phone\n\nDSLR like pics.\n\nI have been using it for the last 2 weeks,\n\n1. No heating\n2. No performance lag\n\nCamera: 10/10\nPerformance:10/10\nBattery: 9/10\nSound:10/10\nGaming:10/10\nDisplay:9/10\nCharging speed: 10/10\nDevice : holding a premium , with leather finishing\n\n\nPeople can consider this phone against the competition below\n\nXiaomi 13 pro\nSamsung S22,S23 ( not ultra models)\nIphone 12,13,14( not pro and max models)\nOppo find n2, techno fold,\nPixel 7 pro,"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Overall the phone make and build is poor than vivo X80 (not X80 pro). Performance is as same as X80. Nothing difference is seen for V2 chip or 9200 chip. I wonder how this costly device did not support DP ALT MODE. Overall old Chinese Wine in new bottle. This costly device did not feel you premium experience. Average look.\nBut Pictures are exceptional.\nWhen I see the X90 pro pictures in my Sony 43 inch led tv it's look fantastic. Fantastic than Sony A7C Full frame DSLR. 4k videos are awesome ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "I loved this phone❤️ exceptional camera. Just wished the phone wasn't this heavy"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "very nice Vivo"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Camera quality is osm"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Switching from Samsung to Vivo.\nVivo has changed a lot while experiencing. It's UI is also so impressive.\n1) The camera is too good.\n2) The sound quality is too good.\n3) The screen display is too good.\n4) The performance is too good.\n5) The Battery is so powerful. Gives you 100% charge within 25 mins.\nGo and buy... don't think much ...grab this one with heavy discounts. I got this smartphone at just Rs. 60000/- (cashback and mobile exchange)"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Best Mobile\nGreat Display\nHigh performance Camera\nVivo is good work in Camera"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Nyz mobile"
    },
    {
      "User_Rating": "3",
      "Title": "Decent product",
      "Comment": "Oh god after launch date 5th May, so far nobody reviewed strange but yeah got tell after using for days i didn't feel that great with the phone it was ok first 2days felt phone is pretty faster as they said about processor, phone got updated after that i feel phone lagging i felt that couple times in a day high end phone performing like this i Don know what to say but hope they will fix with updates, lagging feels so irritating...\n\nI brought this phone only for camera specs thinking of doing ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "So i have been using this phone for 6 months now.. Got it for 66900 net after exhange of my OnePlus 5t for 11000 and other card discount...\nThe Camera is the Best thing about this phone undoubtedly... The battery backup could have been better but i am not complaining either... Front camera needs improvement... Design and feel is premium... Software is very average but not a deal breaker.. one issue that has bugged me is that calls get disconnected in pocket due to oversensitive touch while t...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Overall wonderful mobile. But it heats up a little during normal operation.Battery backup is very good. Camera is not upto the mark as per price standard. Pictures looks like we have shoot with mid range camera phones . Pixel tends to break a lot with normal zoom which actually occurs with mid range camera mobiles. So I would rate camera 2/5....and other than camera 5/5. Sound was really great. Loud and crispy."
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Performs very well Camera good gaming good"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Professional Photography !!! Incredible low light performance. Excellent 1.5k display. Premium Design looks apart, just love it. The only issue is with battery optimization. The best portrait camera mobile in the market right now. Cinematic video feature is crazy good too. Stabilization is pretty decent too. It has not lagged even once since the time I bought it. Trust me its that snappy !!! I agree with SD GEN 2 it would have been better. But this MediaTek 9200 coupled with 12gb ddr5x and UF...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Superb display and camera is excellent, mobile never slows down . Performance is very good"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "I have been using this phone for the last 10 days,\n\n- Super Smooth.\n- The camera is amazing.\n- Charging is super fast, battery backup is more than a day with more than 7 hours of screen time, playing games and watching videos.\n- Ultra Game mode is amazing\n- Phone needs a good cover. As camera bump is big."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Wonderful camera..particularly night photography."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "I purchased this phone for it's camera quality and that's superb. 10/10 marks for camera quality. You can see the pic of early morning Sun behind clouds taken with SuperMoon mode. Overall a great premium phone."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "I am happy with my purchase .The camera is next level .I purchased it using exchange and emi."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Good one"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Mind blowing purchase.The phone was really fast and the performance was good. The display provides clear and vivid visuals, making it perfect for gaming, watching videos, browsing internet. Perfect set for travellers and a person who all are working till late hours as its battery life is great and in another hand it's picture quality is very good."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "The camera is awesome and one of the best among flagship. Night photography and portrait are amazing. Standard use battery will last for a day!"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "The camera is good as you could expect.\nPhone battery could last for about 14-16hrs max\nAs days go by I am liking the design"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "Camera is fantastic. No one can deny. Performance is also going good till now. Battery is not so good. But there is fast charging. I saw that it takes 10 mins only to charge 0% to 25% charge. Overall good phone. I have purchased it only for its camera features."
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Screen and Cameras are very good. Battery backup is average. Charging speed is fantastic. Performance is also good without any lags. However, it lacks Dolby Atmos and Vision support. It is a good device overall but also a very overpriced one."
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "After zooming the camera clarity goes off\nBattery back up comes for one day with 5g nerwork"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Very impressed with the performance of the device. Especially the camera. It's stunning. The portrait mode and night modes are awesome, Also great gaming experience with x90 pro. Played COD mobile in hd settings flawlessly. Next level camera performance, Zeiss has nailed it with lots of filters and photo options."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "I had been using it for a year for the price point the con's are negligible, previously I used an iPhone 14 pro and a Samsung's note 20 ultra compared to them I found this is the best in many aspects especially in camera department\nIrrespective of how high end mobile you buy there will be minor lag issues which is also in this,one negative I find majorly is it doesn't support Dolby vision and hdr 10 + while watching Netflix and prime you will have some minor contrast issues\nBut camera,perfo...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Camera is very good all specifications good but battery is poor"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Its an amazing product...go for it"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "The best android phone\nCamera is awesome except zoom\nDisplay is awesome\nPerformance is fadu\nBattery is dhansu salute to charging speed\nDesign speaks premium top to bottom"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Totally satisfied 🥰\nPremium flagship handset,Best camera,Best performance,Superfast charging,Amazing display.\nBattery is all day performer,but at this price need to be give some more hours extra backup."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "All are okk in this machine.. but the battery is not upto the mark... Draining much quickly with limited use..\nOverall phone has very good camera and best performance with ultimate display.."
    },
    {
      "User_Rating": "5",
      "Title": "A Flagship Marvel",
      "Comment": "The design of the Vivo X90 Pro is nothing short of stunning. With a sleek and slim profile, it sits comfortably in the hand and exudes a premium feel. The bezel-less 6.7-inch AMOLED display with a high resolution and vibrant colours makes media consumption and gaming a delightful experience. Vivo X90 Pro delivers impressive performance across the board with its flagship Dimensity 9200 processor. Multitasking is a breeze, and resource-intensive apps run smoothly without any lag.\n\nThe camera sy...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Superstar phone can be comparable with iPhone 14pro max."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Best phone in category"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Monster perfomance. Xtreme imagination with Zeiss lens is awesome in portrait mode. Premium look ."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Superb mbl.\nCamera 👌\nDisplay 👌\nBattery 👌\nPerformance 👌\nAllrounder phone"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Product is good"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "The camera performance is awesome 💯. Earlier I had concerns about Dimensity 9200 SOC but with V2 chipset, the performance is good. Lack of good cases in the market is unfortunate for such a great phone. Battery performance is also great. The 120W fast charging is a wow factor for the phone. Great smartphone to own for those who love photography."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "All rounder. No problem after the latest update. If I face any problem I'll update.\nSeriously, it's better than any phone out there when it comes to still photos and videos are also pretty amazing.\nBattery life with heavy uses at least 9 hours."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Night camera quality is awesome..\nPortrait camera is awesome..\nselfie camera is average..\nrequired more nits brightness for clear sunlight visibility\nmissing periscope camera lens"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Awesome phone with Amazing picture quality, loved it :)"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Mobile all features are good but price is too much high on this feature segment."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Battery backup is excellent.Overall performance is awesome."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Do not think,just go for it. No one can beat this phone in this price range just amazing camera, battery, performance overall all rounded phone in this price range just buy it if u have this 85k budget. But u have money above 1 lakh then go for s23 ultra or 14 pro.Other than that it's superb phone.....but remember some bloatware apps are there so nothing such issues buy it...."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Best camera phone in the market right now...but video quality is not good enough.."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Good"
    },
    {
      "User_Rating": "1",
      "Title": "Horrible",
      "Comment": "Battery backup is very poor..The battery of this phone got damaged after just one year. It switches off as soon as it goes below 30 percent.."
    },
    {
      "User_Rating": "3",
      "Title": "Good",
      "Comment": "Nice 🙂"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Nice product...great quality pic"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Outstanding phone"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Very good photos and videos quality and mobile smuthly"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "No words to say... It's one of the best camera phone available in the market right.. Main advantage is one inch Sony sensor"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Ok"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Gud"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Recommended"
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "The phone design is nice but the camera bump is so big, it has good display and speakers (Dolby Atmos) i have problem with its battery backup. battery back up of this device is hardly 4 hours of screen on time that is not good for heavy user. preforms wise awesome it has dimensity 9200 processor which is good for gaming not great for efficiency. i have totally disappointed of my vivo x90 pro battery backup... but the camera performance of this phone is next level. it has take crisp, detailed,...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Everything is of good quality and the camera is DSLR"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Very nice mobile"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Best product. 🫡 Salute to Vivo.. 👍"
    },
    {
      "User_Rating": "4",
      "Title": "Fair",
      "Comment": "Awesome products... I love it. Nice camera phone... 👍🏻👍🏻"
    },
    {
      "User_Rating": "1",
      "Title": "Worst experience ever!",
      "Comment": "Mobile is hitting on using data services centre not responding I'm suffering the issue in 2 months"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "Nice"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Very good camera phone"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Super"
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "Camera focus not working properly.. Zoom in/ out issues."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Just u will love it"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Nice 🙂"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "All is good"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "The Best Thing About This Phone Is Camera 🤳📸, Just Go Blindly To Get This Phone If You Are Photographyholic"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Very good"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Awesome primium quality phone"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Awesome product. Overall seems value for money."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "The camera is good... But it requires some more improvement and the display is very good ....\nAlso the battery needs a clear upgrade..\n\nGaming better than x80 pro...\n\nNo periscope lens...\n\nAudio enhancement like deep field science is v bad...\n\nIt needs to be upgraded to Dolby atmos"
    },
    {
      "User_Rating": "3",
      "Title": "NiceNice Look But Only Look....?",
      "Comment": "I am using this phone for two weeks\n\nBattery back up Just a day\nWarming almost all time (Even regular use. i wont play games.)\nSoftware Must be update\ncall quality poor compare to samsung..\nConnectivity speed average.\n\nCamera Quality very nice.\nCamera softwrae options are vast and useful.\nfinish is excellent.\n\nwill update later"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Everything is perfect, this review is after 1 month usage."
    },
    {
      "User_Rating": "3",
      "Title": "Does the job",
      "Comment": "It must have a good performace video editor by Vivo."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Awesome Product In All Aspect"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Over all good experience till now, but product has some software bugs should be resolved asap."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Nice phone with best camera at this price and this phone has less bloatware than previous phones.Loving it!!!!"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Only zoom needs to implement."
    },
    {
      "User_Rating": "2",
      "Title": "Slightly disappointed",
      "Comment": "Selfie camera is extra saturated . Honor mobile is very good comparing to this mobile . Waste of money"
    },
    {
      "User_Rating": "1",
      "Title": "Utterly Disappointed",
      "Comment": "Camera not as expected"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Except battery everything is awesome...\nCamera no doubt is of top quality...."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Mind blowing 🔥"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Awesome 😎"
    },
    {
      "User_Rating": "1",
      "Title": "Useless product",
      "Comment": "The phone is ok looks beautiful and the camera is ok don't expect too much i was comparing vivo x60 and x90 pro and i feel photos are the same not too much difference,\nBut Vivo software is too bad. Some vivo bloteware u cannot uninstall like vivo app store and browser and vivo cloud and some other apps.\n\nIn my opinion if u are paying 84k u should get at least a clean UI.\n\nThe phone feels premium until the screen is off, once the screen on its feels that u paid for Chinese bloteware and pathe...\nREAD MORE"
    },
    {
      "User_Rating": "2",
      "Title": "Not good",
      "Comment": "The phone is not up to mark. It's lacking too much. Sometimes while calling caller is not able to hear my voice either I am not able to her caller's voice. In this condition, I have to restart my device. Don't know if it could be solved with an update or not. The camera is also not so good as it has a big hype in the market. The processor is bad. I won't suggest anyone to buy this phone. If some have this budget go with Iphone. It could be a better option. This phone is very poor. I had ...\nREAD MORE"
    },
    {
      "User_Rating": "1",
      "Title": "Don't waste your money",
      "Comment": "After 3 months plus usage. Camera is average. Video is too bad"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Just awesome Phone"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "-Camera is amazing even in night time\nIt does processes the image to give best image of its time on smartphone.\n-performance of the product is like amazing.\n-battery is like that of a normal phone vivo only that was a disappointment but yeah it does have 120watt charger that too typeC to typeC\n-funtouchOS also needs huge improvements coz I have used one plus but it still lags behind\nQuality and design of the product is really amazing but some ppl will like and some wont like it"
    },
    {
      "User_Rating": "1",
      "Title": "Very poor",
      "Comment": "Very bad performance, it lags while playing games, unnecessary heating. Overnight battery drain, weak processor, bad front face camera. I don't recommend buying this phone."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Excellent from all side.."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "excellen"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Excellent phone"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Superb was waiting for it for a long time.finally in hands"
    },
    {
      "User_Rating": "1",
      "Title": "Hated it!",
      "Comment": "It 3x zooming...not clear..and have 40 x ...I request all of you please don't buy by Flipkart"
    },
    {
      "User_Rating": "1",
      "Title": "Don't waste your money",
      "Comment": "Don't buy this product it is over heating in charging\nAnd battery backup is too bad 😕 once I am charged mobile 100% it will drained in 4 to 5 hours.😡 .iam unsatisfied in this product.lost off loss money 🤑 it's worthless of money 💰"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Fantastic"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Wonderful to have in my hand...."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Best"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Super go for it"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Best Camera phone with ZEISS camera function....."
    }
  ]
}