{
  "search_query": "Vivo X200 Pro",
  "total_reviews": 146,
  "Overall_rating": "4.7",
  "Total_ratings": "910 Ratings &",
  "reviews": [
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Outstanding performance for all department 😍😍 owsome"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Very nice no words awesome camera"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Excellent Purchase. No Complaints Yet. Only drawback is maybe the Funtouch OS could be more polished. Apart from that, everything is amazing, forget iphones and samsungs, you won't regret."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "The power of the camera was immediately apparent after just one use... the camera clarity surpasses that of the iPhone."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Awesome Camera.. totally killed the competition 😀🙌"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "After using it for a month this is the best camera phone device. No lags in any kind of use. Superb device."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "I am vivo x70 pro user and upgrade to x200 pro is worth full"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Good camera"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "The product itself is truly awesome... performance top notch...display superb...camera UNBELIEVABLE...BUT the flipkart delivery was pathetic to be polite"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Excellent 👌🏻"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "DSLR like camera👍👍"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "I was not a fan of Vivo, but this device is just 🔥🔥.\nNever thought the battery would be this good though. Its a bit of a heavy mobile for sure. In love with the telephoto lens. Macro mode is just crazy. You don't even have to make an effort to take macro pictures,just zoom in and the best part is you can keep the device closer to the subject and it will focus without any issues. Detailed camera review in few weeks. Will load more pictures for sure."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "The best camera phone."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Great phone with a great camera.I really like the phone. Its camera is a top notch . And the performance is also good. If you are interested for a camera phone just go for it.The look of the phone is too great and it has a 1 day and above battery back up."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Fantastic phone with an outstanding camera.."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Splendid camera. iPhone users will ask pictures from this phone. Take care of the lens. It's very exposed"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "* Excellent Camera\n* Excellent Battery\n* Smooth UI\n* Completely satisfied with the purchase"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Software is good... battery is awesome... camera is beyond compare...special requests coming to capture pics on this phone... pics are DSLR quality...just point and shoot... literally it is a DSLR in pocket."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Great mobile, awesome camera ❤️\nUI is not much greater"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Camera is excellent 👌\nBattery life is excellent 👌\nPerformance is excellent 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Awesome camera. Loving it."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Everything is best except the funtouch os."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "The top most mobile with camera.No words , mind blowing camera. Iam 100%satisfied with this camera setup in mobile. If anyone want to have camera setup in mobile , this is the best.Without any doubt can pickup this mobile for content creation."
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Over all good"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "I love it camera simply awesome flower 20x zoom picture quality awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Since I'm using this device last 15 days ,Phone is next level what a camera 🔥🔥🔥and battery also powerful."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Camera and all performance beat all mobile and this upper segment phones like s 24 ultra , apple 15 ,16 pro"
    },
    {
      "User_Rating": "4",
      "Title": "Perfect product!",
      "Comment": "Good Camera Mobile"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "All time iPhone users.. ist vivo phone\n.. really mind blowing..\nKeeping my iPhone 16 pro max"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Best camera like DSLR\nBest battery life"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "The hardware of the phone is very good like camera, battery, screen, brightness.. but the software is where the phone requires improvements. Coming from a Samsung phone, I see so many things are missed and lagging behind."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "it's Like DSLR😍😍😍😍😍"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Using this phone since 3 months now\n1. Camera supremacy- iphones are over rated. X200 pro camera is ultimate. 5 star\n2. Battery is 5 star\n3. Display is 5 star\n4. Performance is 5 star\n5. Only software is 3.8 stars. Since I was a samsung user. So SW of samsung looks little better."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Blown away by the device and the aesthetics of it. Unbelievable camera and performance. Highly recommended."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "The best camera phone i have ever used. I was doubtful when i changed from Vivo X90 pro to 200 Pro and i think it is worth it. The best smartphone in 2024. Battery life is also awesome 👍"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Awesome cameras!"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Everything is excellent but resell value is very low. I sell my vivo x80 pro in very low price to purchase this one."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Great Camera Especially a Telephoto\nGreat screen.\nGreat Speaker and Earphones sound.\nJust Funtouch OS needs to be more refined and Aesthetically designed like ORIGIN OS in the Chinese variant."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Excellent display, cameras and build quality, Funtouch OS 15 is not as bad as people make it to be. Overall a great phone with the best cameras.\n\nAttached a 20x macro photo - breathtaking quality"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Upgrading from a Vivo X100, which was again an upgrade from the X90 Pro, and I can't explain how Vivo aces the camera in every single iteration. The X200 Pro does photos better than most phones in its generation, has a mammoth battery life, and performs better than most flagships. It is such a fresh take on high end devices. The best phone of the year and the majority of it is due to the stellar and outstanding camera and unparalleled processing! Aced computational photography, along with dec...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Need improvements in zoom and stabilization.\nPortrait images are incredible.\nTelephoto macro imgages are mindblowing."
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "There is a major big in camera while using at 23mm for potrait mode and mirror selfies, it does weird post processing and changes your face and shape make it look fat and round. HDR doesn't work well in sun and tends to over exposed the skin, considering this is flagship phone it should work like one and Vivo should listen to the customer and fix the issues that people are reporting."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "This is my honest review,\nI first thought of buying Samsung S24 ultra but when I saw camera quality of vivo x200pro I decided to buy X200pro. Its camera is much better than Samsung S24 ultra. The best powerful processor is Dimensity 9400 and finally its battery backup is very better than Samsung S24 ultra I got 2 days battery backup in normal use.\nIf you want a good mobile with very good camera, battery backup and powerful processor. Then you can purchase this one."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "1. Best Camera in Segment\n2. Best performance\n3. Battery is good for normal user...but i need to charge twice in day\n\nI will Edit this review after 1 month of use"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Monster camera 📸,\nThis phone smokes iPhone by far margin in terms of photography, video quality also excellent 👌,\nSolid battery life. Easily last for one and half day for normal use.\nCamera bump create some what unusual holding experience.\n\n\nBest purchase of the year for me 😜"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Camera and Performance That Shine\nI recently bought this mobile, and I'm genuinely impressed, especially with its camera and performance. The camera is a standout feature, capturing crisp, vibrant photos even in challenging lighting conditions. The images boast impressive detail and dynamic range, making every shot a delight.\nBeyond the camera, the phone's overall performance is equally commendable. Its powerful processor handles demanding apps and multitasking with ease. Whether I'm gaming o...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "X200 Pro - Ultimate DSLR Experience ❤️",
      "Comment": "Its a camera beast\nI was using a Samsung S24 ultra, but this phones protraits are next level\nIf yopu are camera oriented person and loves taking photos then its the best\nNo phones in this range or under 1 Lakh can't even touch its photos quality.\nUsing Vivo X series for the first time and am totally impressed by the performance and camera.\n\nPositives\n1. Massive Battery, whatever you do it will last almost a day\n2. Superior camera and potraits\n3. Awesome Gaming Experince\n4. All in- built, No ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Outstanding mobile"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Amazing camera 📸"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "ViVi X200 pro are very very nice Vivo X series phone this phone camera are outstanding and performance are next level and battery backup excellent and this phone game play are very smooth.hand feeling are very nice looking a flaship phone this phone complete beated Iphone and samsang .\nthankyou so much Vivo 🥰🥰🥰"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Superb"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Camera, performance, battery backup all 10/10. Wish the it could be designed better because the big camera bump makes it difficult to use the device in one hand but I think I'll get used to it"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Awesome camera performance"
    },
    {
      "User_Rating": "5",
      "Title": "Baap of all mobiles, its a Camera with a mobile feature",
      "Comment": "Terrific Camera... No competition with any phone available in the market."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Superb quality camera, Super battery. EVERYTHING AWASOME!!!"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Camera is awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "this phone doing amazing performance and camera is just awesome , best camera phone right now"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Excellent Camera"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Overall a beast 💪 This is the mobile waited for 😊\nCamera is a killer 😁\nBattery drains for heavy user far better than other devices .\nDisplay is cool\nDisegn is superb where as missed the front flash lights in 23 pro .\nOverall performance is cool 😎👍"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Good camera. As an android device video quality is also quite good. Display, battery everything is good. But one cons is if you change the default screen protection the fingerprint sensor doesn't work, you need to apply vivos official screen guard. Mine was working before but after replacing existing screen guard the fingerprint sensor doesn't work."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Great Phone 📱"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Worth buying. But only one issue is the games automatically closes after playing for a few minutes."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Camera outstanding!\nPerformance little slow\nRest all good!\nBattery is good\nCharging speed is good\nJust updating apps little slow"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Best Camera Smartphone till now don't go for iphone.\nMacro shot and Night shot are best till now.\nWorking flawlessly.\nOverall performance is also good."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Camera quality is best in class best flagship smartphone at thisprice"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Great Camera"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Except for Apple and Samsung, I have used high-end or you can say flagship phones from all brands but trust me this has to be the best one. Currently Vivo X200 Pro is the benchmark for any new phone which launches and the reason is it's top notch performance in every department. The value to money it offers compared to Apple, Google or Samsung, there's no match to it so if you are thinking about going for this phone or not then I would suggest go for it without any hesitation and I'm sure you...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "One of the best camera phones. I am very much impressed with the performance of the phone. I wasn't a Vivo fan but after using this phone I have become one.\nPremium Flagship Experience and all round experience from this beast."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "I am using this phone from last 4days. Excellent phone\nCamera 5⭐\nPerformance 5⭐\nDesign 5⭐"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "The Cameras of this phone are from another planet.\n\nBeating every DSLR Camera upto 5 lakhs hands down."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Mobile is totally outstanding I don't have any words explain about this phone just ossam and mind blowing genuinely its to good phone ..."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Super Phone overall in all manner awesome phone Much better in comparison with I Phone 16 and S 25 Ultra."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Very nice camera"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "This mobile is really worth the price. The camera is out of the world. The portraits come out as good as a DSLR and the post processing is above samsung and Apple. Battery is strong and charges pretty quickly. Build wise the phone is solid however the software leaves a lot to be desired.\n\nWould rate it a 8.5/10.\nI choose this above the Oppo Find X8 Pro, however when the Xiaomi 15 ultra comes in 2025. This can be tougher."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Vivo X200 Pro: A Powerhouse of Performance\nThe Vivo X200 Pro is a flagship smartphone that boasts impressive specs and a premium design. While it excels in various aspects, its standout features are undoubtedly its camera system and battery life.\nCamera:\n* Top-tier Imaging: The Vivo X200 Pro houses a cutting-edge camera system that delivers exceptional image quality. The primary sensor captures stunningly detailed photos with vibrant colors and excellent dynamic range.\n* Night Photography P...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Don't go for samsung or apple, just try this chinese brand once"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "This is the Powerhouse Camera phone, if u need Camera then don't wait Just grab it. No doubt vivo nailed it in Camera department no one can beat X200 Pro until 200 Ultra launch by vivo"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Awesome camera quality.\nI loved super micro mode"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "1. **Camera**: The camera is a standout feature, offering exceptional photo and video quality. The portrait and landscape modes are particularly impressive, and the camera app is user-friendly, catering to both casual and pro users.\n\n2. **Battery**: The battery life is exceptional, lasting up to one and a half days even with heavy usage. This is a significant advantage for users who rely on their phones throughout the day.\n\n3. **Build and Design**: The phone has a premium build quality, with ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Very very 🔥😍"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Amazing picture quality ❤️❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Worth every penny!"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "The phone is good... True camera phone with outstanding battery.\nOnly downside is the UI... The UI looks old for 2025"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "One of the best Camera smartphone u can buy. Performance is also great and battery life is very good. Overall a good package. Recommended for camera lovers."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Great phone made by vivo\nCamara King\nBattery is fabulous\n2025 mobile king"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Simply Breathtaking results"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "I have iPhone 16 pro max And i compare camera of both the phone side by side\n\nBut vivo camera is next level 🙂🌚"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "After using for almost 12 day's\nMain camera is the best till date for every use low light zoom ( best),macro\nBattery power management is very good.\nPerformance is good.display very good\nOnly drawback is camera bump which makes it uncomfortable to hold in one hand fingers will be touching lens.\nSummary if u are looking for camera centric phone with good battery life, display, speaker this is the phone.\nFlipkart delivery is getting awfull delivery boy dropped the package when said that u are ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Fully satisfied by the purchase. I used an iPhone 15 as well but this phone is far better from the iPhone in each department ( Battery, Camera, Software, Display) everything is good. Go for it guys.\n\nThis phone is far better if we campare it with the iPhone and Samsung 25ultra"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Superb camera and battery backup."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Everything is fine till now... I wish it could more features like background change or background remover in image edit options.."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Top camera performance"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Camera : Photos best in the smartphone industry,portrait Cameras is top notch\n\nVideos is best in android world very close to Iphone\n\nBattery backup is best in the smartphone world , 10 hour of screen time is for sure\n\nMediatek 9400 is not less than any SD processor in any term\n\nFuntouch OS is not bad at all\n\nDesign is good too but everyone has personal prefreneces\n\nOverall a class product !!"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "It's like a camera with Big Display"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Overall very good phone"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Great flagship phone"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "I really love the mobile, especially hatsoff to camera department,\nThank you vivo"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Best Quality"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Super phone for Camera lovers, very good performance wise...I love this phone... camera is GOAT"
    },
    {
      "User_Rating": "2",
      "Title": "Bad quality",
      "Comment": "Camera is not good... Its like normal phones images will get additional white layer using AI... They are saying DSLR like camera but its purely white shaded AI camera... If u want camera phone dnt buy this..\n\nFuntouch OS is really horrible to use."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "this phone doing amazing performance and camera is just awesome , best camera phone right now"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Very very good quality.i am happy."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Really amazing. Top 1st camera mobile in World. Battery good. Overall worth buy"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Camera : Photos best in the smartphone industry,portrait Cameras is top notch\n\nVideos is best in android world very close to Iphone\n\nBattery backup is best in the smartphone world , 10 hour of screen time is for sure\n\nMediatek 9400 is not less than any SD processor in any term\n\nFuntouch OS is not bad at all\n\nDesign is good too but everyone has personal prefreneces\n\nOverall a class product !!"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Excellent 👌 Phone"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Camera and all performance beat all mobile and this upper segment phones like s 24 ultra , apple 15 ,16 pro"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Great Camera Especially a Telephoto\nGreat screen.\nGreat Speaker and Earphones sound.\nJust Funtouch OS needs to be more refined and Aesthetically designed like ORIGIN OS in the Chinese variant."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Best Phone of this season.\nIn daily life photography you don't have to carry a DSLR set-up when you have this mobile.\n\nBut flipkart delivery is -1*."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "The delivery guy is very polite and good.This adds to my good experience of having a new product from Flipkart.\n\nPhone is awesome."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Camera 5/5\nPerformance 5/5\nDisplay 5/5\nBattery 5/5\nDesign 4.5"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "The Vivo X200 Pro stands out as a flagship smartphone, excelling in design, performance, and camera capabilities.\n\n**Design and Display**\n\nThe X200 Pro features a sleek design with a micro-quad-curved display, providing an immersive visual experience. Its 6.78-inch OLED screen offers Full HD+ resolution, a 120 Hz refresh rate, and HDR support, delivering vibrant and smooth visuals. The device is built with Armor Glass for enhanced durability and holds an IP69 certification, ensuring resistanc...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Good product... received the phone today and waiting for long term experience with this phone...\n90w charger is not up to mark. minimum 120w should provide.."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "The product itself is truly awesome... performance top notch...display superb...camera UNBELIEVABLE...BUT the flipkart delivery was pathetic to be polite"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "The phone is really good..\nBest cameras and awesome display..\nThe sound quality is also amazing..\nIf you are getting this phone for a good discount, then you must go for it without any second thoughts..\nThe only dissatisfaction is the bezels, they are a bit more compared to the other flagships.\nOther than this, everything is top notch..\n\nThankyou Flipkart for such a great exchange offer and discounts. 🤩"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "All time iPhone users.. ist vivo phone\n.. really mind blowing..\nKeeping my iPhone 16 pro max"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Outstanding mobile"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Grt"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Upgrading from a Vivo X100, which was again an upgrade from the X90 Pro, and I can't explain how Vivo aces the camera in every single iteration. The X200 Pro does photos better than most phones in its generation, has a mammoth battery life, and performs better than most flagships. It is such a fresh take on high end devices. The best phone of the year and the majority of it is due to the stellar and outstanding camera and unparalleled processing! Aced computational photography, along with dec...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Absolute Camera beast. Camera design is gorgeous. Loved it so much."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Good camera"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Blown away by the device and the aesthetics of it. Unbelievable camera and performance. Highly recommended."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Super Phone overall in all manner awesome phone Much better in comparison with I Phone 16 and S 25 Ultra."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Everything is fine till now... I wish it could more features like background change or background remover in image edit options.."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Everything is great about this phone the cameras, battery life, performance, screen, etc. Yes it will take you some time to get used to that massive camera bump but as soon as you get used to it, it'll feel normal. Also the device's design is attention grabbing."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Camera 🔥🔥🔥\nDSLR effect\nPerfect ok 🥰🥰🥰"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Software is good... battery is awesome... camera is beyond compare...special requests coming to capture pics on this phone... pics are DSLR quality...just point and shoot... literally it is a DSLR in pocket."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Very nice camera"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Very good camera quality"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "01.Good Camera (No Flash Options Available in Portrait Camera, Same Option is available in Vivo V40 Pro which boosts clarity during the night photography ), I have faced camera lag during Portrait mode.\n\n02. Videography not so good when compared to Iphone 16 pro\n\n03. Display - Only 1.5K display given in this price range.\n\n04. Design not impressive.\n\n05.Performance is very Good."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Everything top notch"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Using this phone since 3 months now\n1. Camera supremacy- iphones are over rated. X200 pro camera is ultimate. 5 star\n2. Battery is 5 star\n3. Display is 5 star\n4. Performance is 5 star\n5. Only software is 3.8 stars. Since I was a samsung user. So SW of samsung looks little better."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Who are looking Beautiful photos immediately go for VIVO X200 pro"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Very nice 👍👍"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "1. **Camera**: The camera is a standout feature, offering exceptional photo and video quality. The portrait and landscape modes are particularly impressive, and the camera app is user-friendly, catering to both casual and pro users.\n\n2. **Battery**: The battery life is exceptional, lasting up to one and a half days even with heavy usage. This is a significant advantage for users who rely on their phones throughout the day.\n\n3. **Build and Design**: The phone has a premium build quality, with ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Camera is excellent 👌\nBattery life is excellent 👌\nPerformance is excellent 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Awesome camera. Loving it."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Fantastic mobile.. absolute breeze.."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Super 👍 best in class"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Superb Phone ❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Awesome Phone..."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Excellent phone with good camera and superb performance"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "I am vivo x70 pro user and upgrade to x200 pro is worth full"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "The Camera and battery is amazing .\nCamera bump is a little too big that's all"
    }
  ]
}