{
  "search_query": "Vivo x100 Pro",
  "total_reviews": 165,
  "Overall_rating": "4.7",
  "Total_ratings": "653 Ratings &",
  "reviews": [
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Back camera is very beautiful ...near DSLR camera"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Camera is next level. It's difficult to believe that photos are taken by mobile camera.\nOverall Performance is very impressive.\nWorth every penny."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Nyc camera"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Bought this week, haven't used much so far but it turns out to be a good Purchase. Fantastic Camera (One of the Best in the Market), Massive Battery Life/Super Quick Charging. Enclosing a few unedited shots for reference."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "As always X series rocks, i m upgrading from x70 pro, so most of the features I have already experienced. Good to see the improvements"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "The Camera on this smartphone is a mini DSLR. Everything on this camera is top notch.\n\nMy only concern for this phone is only the battery. The battery on this phone is rated 5400mAh but only lasts a day with medium to heavy usage."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Very much satisfied with the X100 pro. Very powerful camera. Nice display. Fast charging. Bang for the money. Upgraded from Vivo X70PRO+. Loved the device."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Excellent camera or performance very good"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Just go for it without any second thought..😍😍"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "**Review After 4 Months of Usage**\n\nI am writing this review after using this phone for 4 months, and overall, I am happy with my purchase. My primary reason for buying this phone was its camera, and it certainly excels in that department. The rear cameras, especially the main camera and the telephoto camera, are simply brilliant. The photos clicked by these cameras are so good that it's tough to differentiate between them and DSLR photos.\n\nHowever, there are a few negatives to note:\n\n1. **We...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "It is a brilliant phone in every way, the camera is truly amazing and I love clicking pics from this phone. It's certainly a mini DSLR and one of the best camera phone in the market at this price and competes with giant brands tagged with hefty price, specs are top notch, battery backup is good, fast charging and wireless charging is amazing.......build quality is good......."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "First time buying a Vivo phone .. always was a samsung fan....now I switched to Vivo....man the camera is awesome especially the telephoto lens... Vivo does magic with the zoom even 10x is really crisp and performs exactly like s22 ultra optical lens.... I don't know how but low-light photos are really impressive and beats samsung and my Nikon mirror less..... Now I will always buy vivo"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Absolutely King of photography\nExcellent 👌👌👌\nCamera\nDisplay\nPremium smartphone\nBattery\nEverything is top class"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Fabulous , awesome camera, display and battery"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Night Photoshoot Giant\n\nI was using Realme X2 Pro for the past 4 years and the phone was running fluid but recently at my friend's sister's marriage I realised why I badly needed a camera centric mobile. All photos came out with horrendous lens flare and I made up my mind for a camera specific Android phone. I did extensive research between Xiaomi 14 pro, OnePlus 12 and Vivo X100 pro. When I saw daylight and night portraits and videos choosing Vivo X100pro came on top for its night photoshoot...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Hardware as expected, Awesome.\nMind blowing cameras.\nHowever, Vivo must enhance their software game, same ui that you get in budget segment with some ads that you can never turn off."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Its a complete package.upgraded from vivo x70 pro and it worth it.though display resolution could have been better 2k display at the price is expected.\nCamera is amazing specially portrait and macro shots.\nSelfie and ultrawide camera is average.\nI am little bit of disappointed with human face color in x100 pro compared to vivo x70 pro, it looks dull.\nx70 pro skin color reproduction was amazing."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "primium quality for imges camera and mobile also I liked 💯"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "If u looking for a cam eccentric phone go for it..Dslr on hand.. Performance wise incredible.. A negative is Stereo speakers not much loud."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "I love camera"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Best in class camera is 🔥"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Worthy competitor to Apple and Samsung. Saves you 50-60 thousand if you don't want to pay brand premium and just want more of phone out of your device."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Amazing camera and all around solid smartphone"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "No phone on earth can take this level of portrait photography, just upgraded to this phone from X70 pro plus, worth the wait and upgrade"
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Using more than 1 month. Fast charging, performance especially rear camera at its best Vivo has done a great job. Overall I am satisfied with this mobile. You can compete this with S23 Ultra. Giving Four star rating for front camera should have been provided with 4k resolution."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Excellent camera performance. Without doubt one of the best phone for photography."
    },
    {
      "User_Rating": "5",
      "Title": "Professional Camera",
      "Comment": "In one word it is a Professional camera.\nall remaining aspects like Processor,UI, Sound, Display are very good"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "What a great phone it is. I went for Vivo because Samsung confirmed that the S24 and S24 plus will come with exinos chipset. After seeing the excellent reviews I bought it. And ohh boy, it takes photos which are comparable to my DSLR.\nI had few reservations about the mediatek chipset but till now have not faced any heating issues.\nPerformance is flagship and I am very satisfied with my purchase."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Super camera"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Best phone for Photography🔥👌\nBest Phone Design\nGreat Camera Quality\nGood Battery Backup\nOverall performance just awesome🔥👌"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Vivo x100 Pro phone is better than iPhone, camera and network is very good, I liked it very much..❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "So beautiful so elegant just looking like a wow"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "I switch from s23ultra to x100pro and m happy"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Nice camera!"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Awesome 😎"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "If you want a machine not to show off (iphone) then this is the best smartphone available in the market at this price bracket. You can say, no one beat the camera quality especially the portrait and night photography. For video i can say iphone is still the king but this is also not bad compared with Samsung ultra phone. Battery backup and charging speed is also great. The processor is also top notch. I am saying if you want a mobile phone as a gadget not to show off then this is the best in ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "The camera was soo good\nPerformance was also good"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "This phone has great camera performance. The images are very close to real life however, there is a mode if you want to enhance the images. In my opinion this phone can easily beat the galaxy s24 ultra. After the latest March month update the 4k video recording option in front camera is also enabled.\n\nThe performance is also of top quality.\n\nI feel that the speakers could have little more loud. The battery performance is decent. It will last for a day very easily on heavy usage and on normal...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Just let me tell u a back story of my mobile phone obsession.\nI have used almost every mobile phone every released in this country starting from Motorola pager to Nokia brick phones to Nokia Symbian seris phones to Sony Ericsson phones to lg g seris to Samsung flip to Samsung s seris to iPhone almost every series to now moving to vivo after using oppo and OnePlus as well...\n1st time I used Vivo that too it's flagship...\nI would say amongst all the mobile phones I have used it's one of the fa...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "If camera is your priority close your eyes and go for it"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "No complaints, camera is amazing, gives you a beautiful pics. No performance issues, no concerns on battery backup too. Hope it remains like this for longer. Thanks"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Very good product, nice."
    },
    {
      "User_Rating": "4",
      "Title": "Very Good",
      "Comment": "Reviewing after a week:\nAwesome Camera,\nGreat Display\nBad OS (Funtouch 14 is buggy)"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Awesome camera 📸📸📸"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "People are comparing this phone with S23 and S24 and even ip 15 pro but believe me it's beyond that because the camera sensors are way way better than those phones. Look into the photos I have uploaded. The best part is charging with battery capacity is just fantastic. People are complaining about the heating issue but I played BGMI but couldn't feel the heat.\n\nOverall worth the price and top notch phone it is.\n\nIt's made in India as well"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "The phone is in word just awesome. I like the camera quality of this Vivo x100 pro. What a super quality of photos. All rounder smart phone. The collaboration with Zeiss with Sony imx 1inch sensor make it best.\nThere is nothing anything to hate about this phone."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Great piece of mobile. Flagship yes but flagship level display no. Imagine clicking brilliant photos but that screen is FHD+, Little disappointed. Great macro photography. Light handling is the key. No photos coz Flipkart says too large. 😅"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Great pictures. Buttery smooth touch. Superb battery. Price range should be around 60. However I'm satisfied with the build quality and performance."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Vivo just needs to work on its phone's UI. Rest is all good."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Best camera phone"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Best in every aspect"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Awesome phone... Pics are like taken from dslr... Phone is a pocket dslr.... Only issue is slight heating"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Super"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "JUST WOW QUALITY."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "The best thing about it is the outstanding camera. It delivers exceptional performance in all conditions, thanks to Zeiss' great job... When comparing the iPhone 15 Pro Max and the Samsung S24 Ultra, the X100 Pro sometimes performs better than the iPhone and S24 Ultra., It is the best phone for night photography and has a powerful telephoto lens and the clarity of the pictures is really good\n\nThe display is also very sharp, and the charging speed is awesome. The battery backup is more than en...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "The best Camera phone of 2024."
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Cameras beat all other phones hands down\n\nBattery management sucks but usually it gives 5-6 SoT if not using camera\n\nSpeakers are good and loud\n\n\nnetwork reception and call clarity is good\n\ndata doesn't seem to work during a call\n\nminor lag in software when battery saver kicks in seen in animations during scrolling or navigation\n\n\n\noverall a decent experience considering everything\n\n\nfantastic experience in photography (although it lacks a few things but they aren't used by everyone - like 3...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Nothing beats this...satisfy in all aspects"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Camera phone of the year 2024\n\nAn excellent masterpiece of photography and performance from Vivo\nPros- 1. Excellent cameras and far better in low light conditions\n2. Buttery smooth performance\n3. Excellent battery life with no heating\n4. Superfast charging\n\nCons\n1. Pre Installed non removable bloat wares\n2. Display needs improvements given the price tag"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Best phone of year 2024.\n\nNo phone can beat this phone. Whether I phone or Samsung in camera.\nBest potrait. Ready to upload .\n\nEven beats DSLR. It's a replacement of DSLR can be used for holiday trip.\n\nCharges completely in less then 15-25 min depends upon at what point you start charging.\n\nGood audio quality\n\nAlso Bluetooth in car during driving is crystal clear.\n\nFirst in pocket well\n\nWeight is on higher sider but just adequate, also lighter and less bulkier than S24 ultra.\n\nHighly sa...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Everything is perfect at this price point but the battery I think should be more optimised given that it has 5400mah capacity."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "best camera 📸"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "85mm lens is out of the world like canon mark 4"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Awesome bright curved display, fast charging battery, comfortable to hold or carry in pocket with curved edges, excellent cameras, IP 68"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Great 😘"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Coming from Xiaomi 12 pro to vivo x100 pro.\nHuge upgrade in camera\nOnly low side is the software which we ll grow into as we use"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "What a camera 📸\nif someone say to me iPhone 15 pro max or Samsung s24 ultra has a batter camera\ni think he/she need a Eye and Brain surgery.\nSome photos are taken in nights some are in days.\nPerformance up to Mark\nBattery is very good I got a avg 1.5 day\nI used slow charge for extended my battery life when i need urgent charge then i used blazing fast charger"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Amazing Smartphone....Review after using it for 5 days\n\n1. Camera: The low light photos are top notch having the right amount of exposure and colour reproduction. This phone is a portrait king when considering rear cameras but selfie portraits need better edge detection. It is a solid 10\n\n2. Battery: Charging is within 30 minutes. If you are a moderate user it will last a day and a half. Played bgmi for an hour and 15 percent went down. I will rate it 9\n\n3. Performance: I got an antutu benchm...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Camera is exceptional. Nd performance is good, need improvement on display... Price to be low.."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Got it for 65k with exchange and card discount. The best camera of 2024 I have seen. Front camera is decent, but back camera's are on par with latest phones even better in some scenarios. Phone is very fast I don't know what's trick all my 96 apps download and installed within a minute. Phone gets warm while setup it up ...may be will settle in few days of usage ..\nHate vivo app store ,browser, lockscreen magzine(glance) app and jivi home .. can't debloat it.\n\nRest all great."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Awsem..... mind-blowing"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "I ordered this on 4th of Jan when it went live and after exchanging my OnePlus 10T for Vivo X100 pro, I found that every aspect of this phone is awesome.\nCamera - 10/10\nNo compromises here. Bokeh, Cinematic, supermoon, landscape etc etc are all awesome and these have set the standards apart from the predecessors. It comes up with some great shots.\nPerformance - 10/10\nI am not a gaming person however from what I have seen this phone has plenty to offer for a very smooth and lag free performanc...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Awesome cameras and Great overall Performance, Worth the Price 💯. Value for Money Flagship Vivo X100 Pro👌"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "I love this product as of now."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Excellent phone in almost all aspects\n1. Excellent camera with great photo quality\n2. Excellent battery\n3. Good performance but heats a bit if we push a bit ( heavy games, bench marks etc)\n4. Build is good but it's bit top heavy due to camera\n5. Avg software ( no bugs as such but not polished with icons notifications or automation etc)"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "This phone is a beast... Its a camera centric smart phone and picture quality is amazing... No other phone can beat its camera performance especially at night .. selfie camera is above average only .. buttery smooth hardware.."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Mobile is best camera and battery bahubali all good 👍😊 battery backup 1.5 day more than normal use"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Good except network"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Feels more like a camera than a phone. Looks are premium. Overall good value for money.\nAnd certainly has capability to replace my DSLR."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Well what can i say, all the reviews here are correct in their description of this phone. It is a camera beast, especially in low light conditions and landscape photography, the camera sensors just knock the pictures right of the park and i would sat it is a great phone for beginners to get them selves into photography.\n\nThe battery is good as well and the flash charging is even better, Dimensity 9300 is pretty good at multiple task handling but i havent gamed on it neither i will so cant com...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Best photo"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Terrific purchase\nExcellent camera\nMust buy it .\nAwesome performance."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Master of All camera phones.. Detailed quality. DSLR Like camera. Phone looks premium. Little bit of heat some times except that everything goes great."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Great smartphone with an awesome camera. Battery backup is nice. I am very happy with this product."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "I was kind of nervous about buying an expensive phone on Flipkart. But kudos to the Flipkart team for making sure the delivery was smooth and on-time. Thank you for that. With regards to the phone... I am someone who uses single phone for 5 plus years... I am sure it will serve the purpose."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Amazing camera\nTop notch performance\nGood display\nDecent audio quality\nYou will not regret this purchase"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Camera excellent quality 👍"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Performance Good\nBattery Good\nCamera Superb Portrait Pics 10x Zoom quality\nNice mobile worthable to purchase"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Awesome phone for the price..camera quality is super good..display and battery life compares with the best in the market..very happy with the purchase"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Superbbbb"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Phone is great bought it for camera and does a great job but only con is processor is not great and most of the games don't work need to work on it"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Excellent camera with excellent features. A worthy upgrade from OnePlus 11. It can handle well enough in every lighting conditions.I was a bit sceptical about the battery backup but it really impressed me and even charges very fast. The fun touch OS has also been upgraded quite impressively, rather even now some ups and downs are there. The look and feel of the device is also like damn. The only missing of my OnePlus 12 are the haptic experience and the speakers were very good, this doesn't m...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Macro mode and zoom is fast , bit heating is there because of the optical zoom ,macro and full zoom clicks uploaded.\n\nAwesome phone , you can't carry dslr everywhere,but you can carry this"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Good phone. Excellent camera and outstanding zoom capabilities. And also comes around 81k. I think it's best value for money"
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "Best for camera. Have a lot of software glitches which I never faced when using my Samsung. Lot of bluetooth issues as well. Otherwise it's good!"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Prons: Only Front camera little bit depressing due to AI and Picture quality otherwise rear camera's all are upto mark... It really bit to Samsung galaxy S24 ultra and Iphone 15 pro Max and google pixel 8 pro is so far in that racing.\n\nCons: Design not attractive and missing S Pen with it VIVO need to work on it."
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Today I received this phone ViVo X100 Pro 16/512\nFully Satisfied with this mobile 16/512\n\nActually only reason to bought this phone for Fun Touch OS and Especially IR Blaster\n\nCamera excellent\nDual Speaker best\nDisplay Quality best\nFast Charging is best\nThis is one the best all rounder\nFinally Fully satisfied with this Phone."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Good product with premium fit and finish. Got a superb camera and a great specs for performance.\n\nMinor heating issue is there compared to IQOO 12.Hopefully it shall be fixed by software update.\n\nOverall happy with the buy and timely delivery by Flipkart too.Thank you for the happy buying experience.Shall update in coming days more on performance and other specs."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Nice phone . Photos and video are awesome. memory is enough. Battary is also good . Overall 4.5 rating out of 5.\nNice phone"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Excellent device in the price range.camera is like beyond expectations..."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Mind blowing all"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Mind blowing🔥🔥🔥"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Best camera phone in this segment.zooming pic one of the best, stability in zooming good, overall very good phon.just battery average."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Brought 3days before. Good camara phone.working gud."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Very Good Go For It"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Great mobile phone"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "All rounder"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Phone 📱 best"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Very good and outstanding phone in ever I used."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Very good"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Great camera quality and battery\n\nAds on this phone were annoying but I was able to disable v-app store and it fixed the issue"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Good ❤️❤️❤️ camera very good"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "DSLR CAMERA 📸 replac Vivo 2024 camera king"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Excellent performance\nVery Good clarity photo images"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Excellent specially the camera"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "This phone is a camera beast...if you are looking for a camera centric phone then close your eyes and go for it. The photos are literally stunning. I would say so far the overall performance of the phone has been really good"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Good phone"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Good one"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Fabulous experience..... 30 mints. Battery full"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Just bamboozled with the camera quality and performance of the phone.......simply breathtaking experience of this beast❤️❤️❤️❤️🔥🔥🔥🔥"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Amazing device overall"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Excellent all-rounder performer device"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Camera is best phone 🤳👍"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Gud camera"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Nice product and cameras do the best work.For gaming it is difficult to cold the mobile camera bump disturb you."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Amazing and Fabulous. Great camera, good performance mobile. DSLR bye bye."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Reviewing after using it for a month now....\nPros: Camera, Battery, interface, Display\nCons: heating at times, video recording can be enhanced better, selfi is good yet need to be more precise and features of selfi is less when compared to Vivo V series.\n\nOver All worth for the price that we pay 🙂"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Nice photo mobile phone"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Nice amazing phone.Its worth it.Camera is just fabulous."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Display,battery,camera 100 out 110\nBut degisn may more better in this segment"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Good mobail"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Perfect camera phone\nI loved it❤️"
    },
    {
      "User_Rating": "3",
      "Title": "Just okay",
      "Comment": "Ok.. good camera performance.."
    },
    {
      "User_Rating": "1",
      "Title": "Waste of money!",
      "Comment": "I hate the product , except cameras which have focussing issues when you click, , there is no support by flipkart also after order is received. Not able to return the product .\n\nThe battery drain is very fast which means you need to carry a charger always.\n\nCurve display is another disadvantage as starting text is not visible, better go for any flat display phone .\n\nAlso there is no option for screen guard on a curve display.\n\nThere is hyper created by Vivo and media influencers who are ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "The phone is outstanding. The camera is superb"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Osm Super and Very nice 🙂"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Amazing performance and camera"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Excellent for Photos."
    },
    {
      "User_Rating": "1",
      "Title": "Absolute rubbish!",
      "Comment": "Heating issue"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Excellent"
    },
    {
      "User_Rating": "4",
      "Title": "Decent product",
      "Comment": "Osam product"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "It's a very good phone"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Very nice phone as compared to overall performance.\nCamera is outstanding"
    },
    {
      "User_Rating": "5",
      "Title": "Amazing product, Thank you Vivo!",
      "Comment": "Value for money. Amazing Camera results. Very good battery life, smooth software experience. Very much satisfied and recommended."
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Super camera 🥰👌🏻👌🏻"
    },
    {
      "User_Rating": "3",
      "Title": "Fair",
      "Comment": "My product battery drain issue"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Good phone"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Great.... But phone is heating in camera use"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "A smart phone inside an excellent camera!"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Fantastic phone... No doubt this phone is a beast in terms of everything camera, performance. Only one drawback the front camera..."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "It's an overall complete package whether is camera, speakers, performance, display, battery, hepatic, touch response, etc. I am very happy with this purchase but just want Vivo to improve front camera a little more to the standard of Vivo V pro series level than it will become an perfect allrounder."
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Excellent product"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Best mobile"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Excellent"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Outstanding. Camera is superb.. Loving it."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Very good I am very happy"
    },
    {
      "User_Rating": "2",
      "Title": "Bad quality",
      "Comment": "Charging was too late"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Fabulous phone.worth every penny."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Wow wonderful mobile"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Excellent"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Wow..super photos and performance..the telephoto zoom is just awesome 💯💯💯💯"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Excellent camera, especially its zoom capabilities"
    }
  ]
}