{
  "search_query": "Vivo X100s",
  "total_reviews": 201,
  "Overall_rating": "4.6",
  "Total_ratings": "872 Ratings &",
  "reviews": [
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Awesome camera, day and night portraits are amazing, DSLR like camera, battery backup and charging speed is extraordinary. Looks premium on hand."
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Good camera 👍👍"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Good Phone, DSLR Level camera"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Just awesome mobile... superb camera..."
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Camera 🔥"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Mind-blowing cam just go for it"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Amazing camera and photos quality"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Everything is perfect about this phone. Battery backup is excellent in daily usage. The phone doesn't heat up despite having such a monstrous chip. Camera is fabulous."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Overall Good experience in this phone (Vivo x100)"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Battery Standby Draining is a minor drawback I've faced in my past one week of usage. It could be compensated with the fast charging.\n\nFuntouch OS is not my cup of tea. Still I'm relying on Nova Launcher.\n\nNo issues with the display. Crystal Clear. Always on Display could have been better. Only fewer notification icon support is there.\n\nSuper Smooth performance. Never had a frame drop.\n\nNetwork connectivity is good. 5G speeds were the cherry on top.\n\nFaced with mild heating here and there dur...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Dont think too much just go for it.i have dropped some pics by this device।"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Most beautiful phone in this range\nMost glorious camera\nComparison to I Phone"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Awesome Smartphone with great performance and dslr like camera... Must recommend to everyone for gamet as well as daily user and photo lover"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Camera quality is good ,but the zoom stability is not good on night,"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Amazing photography my vivo x100"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Really 10/10\nCamara...10/10\nPerformance..10/10\nBeattry..10/10"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Mind blowing camera performance 🔥🔥🔥"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Camera Quality is Superb particularly in portrait mode and there is no need to edit photos using photo edit software, you can directly upload them. Battery backup is also very good fast charging works faster. Worth every penny"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Don't buy blue if u buy blue u will ge white transparent case buy black u will get a black wonderful case 🥰 just got it device is awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Awesome Camera😘❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "This is not a phone this is more than a DSLR, more than a gamming device overall this is a device which all the things that's you want from a high end DSLR and gaming device everything is attached with it... One tip for you if u want to buy a DSLR camera, trust me no need to spends lakhs or thousands of rupees this phone gives u better photos videos more than a DSLR and IPhone 15 pro max cameras...!!! Except cameras it's also a gaming monster it's bore than a 30k gamming phone it's performanc...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "I am satisfying their overall performance of Vivo x100.this phone is better than s24 , iPhone 15 .DSLR Camera setup 😍"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Amazing camera 📸 quality 👌"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Awesome camera photo..."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Good phone 📱"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Superb camera quality... Awesome pics"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Today I have received my phone with great quality of camera and battery and delivery is very smooth and the delivery person is very nice 👍 thank you so much Flipkart"
    },
    {
      "User_Rating": "3",
      "Title": "Fair",
      "Comment": "Camera Quality is Superb.. no doubt.. but battery drain is the biggest issue..I never expected that camera quality like DSLR..if You want Camera Phone just go for it.. but if you want only performance then it's just not for you.. performance could have been better.. pre-installed apps are already there.. you can't uninstall them.. like hot games... Vivo store.. you can't disabled although.."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "A great phone camera is mind blowing, this phone takes very good quality photos, the battery drains a bit early but not bad because the charging is very fast I am very happy to buy this phone and recommend others to buy this phone."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Design looks beautiful, once you hold the phone you'll feel the premium build. Buttons have good tactile feedback. Hats off to Vivo for the gorgeous 6.78-inch amoled display colors looks vibrant and sharpe, its big and its feel immersive while watching videos. Its the first time im uing a curved display and im loving it.\nThere is no lag while gaming, the phone is fast and snappy. There is no heating issues and battery it will last a full good day. The camera is just awesome the detail it cap...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "Camera Quantity - Superb\nZoom - Fantastic\nBuild quality - Awesome\nIn Hand feel - Premium\nBattery - Enough for a day\nDisplay - Super\nPerformance - Just wow"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "I've been using it now for a long time. Im satisfied. Good performance less heat. Best camera . Everything is 10/10. One major thing there service awesome service."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Awesome. Camera quality is very good. Battery charge lasts about a day."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "One of the best phone from vivo"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Nice camera phone...."
    },
    {
      "User_Rating": "5",
      "Title": "Great product for enthusiastic photographer!!",
      "Comment": "This is the top best mobile I've ever purchased. There are mostly Pros in this mobile. I've been using this for the last 10 days.\nPerformance, Camera, Display at this price .. overall great phone!!!"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Mind Blowing Camera - I ordered this phone after using samsung flip 5 for almost 5 months..I must say this phone is the best camera phone..I used Vivo x80 in the past but this is far better than that phone.\n\nFast charging works perfectly fine..Pls go ahead and buy this phone.."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "This is the best mobile I've ever purchased. There are mostly Pros in this mobile. I've been using this for the last 5 days.\n\nCamera- 5/5\nAnyone would buy this mobile for the cameras and it is a completely satisfying experience both with the front camera and also back cameras.\n\nDisplay - 5/5\nAwesome curved display.\n\nDesign- 5/5\nThe design is really terrific. The camera module design is especially awesome and one of the main reasons for buying this phone.\n\nPerformance- 5/5\nThe performance is g...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Exlent mobile and camera like DSLR performance is very fast ovaral mobile is excellent finally I love this Mobil"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Amazing 😍🤩 look at the osm to the best for Vivo x 100 phone"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Very Nice Device Camera Awasome with sound with Stereo speakers All in all Performance is very 👍👍👍👍 good"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Camera is too good 😊\nBattery health is good 😊"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Nice camera and performance phone"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "The sleek design and vibrant display immediately caught my eye, making the overall user experience enjoyable. The processing speed is impressive, ensuring smooth multitasking and quick app launches. The camera quality is outstanding, capturing detailed and vivid photos in various lighting conditions. Additionally, the battery life has proven to be reliable, lasting through a full day of usage without any issues. Overall, this mobile device combines style, performance, and functionality seamle...\nREAD MORE"
    },
    {
      "User_Rating": "4",
      "Title": "Nice product",
      "Comment": "Mind blowing camera 📸"
    },
    {
      "User_Rating": "4",
      "Title": "Almost Perfect",
      "Comment": "Great product. This phone has finally got call recording with built-in non google dialer which made me very happy.\n1.Cameras are very good.\n2.Design is very good as well.\n3. Battery backup is okay.\n4. Improvement is needed in main cam as I found my older phone (X70 Pro) had way better clarity and details. Wide angle camera is okay, not better than my old phone. Periscope is a major improvement from my previous phone, although macro mode needs improvement. I hope Vivo pushes update to impr...\nREAD MORE"
    },
    {
      "User_Rating": "3",
      "Title": "Just okay",
      "Comment": "Camera is best, but while using camera and normal work mobile is heating too much. I am not expecting this on 60k range mobile. Very disappointed. Hope this will resolve on next updates."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Super mbaile camera super good"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Unbelievable 👻"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Nice camera 🤳📸"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Camera is next level.. Battery performance is good.. Super fast charging... Im happy with the phone.. It gets bit heat when we use camera for longer time.."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Superb camera and battery back-up. Performance is also top notch, Diamond City 9300 is just awesome.\n\nTested the camera with iPhone15 and performed better in every single parameter"
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "** Camera:** Excellent, even in low light, Zeiss optics, gimbal stabilization.\n✨ Display: Stunning AMOLED, 120Hz refresh rate, super bright.\nPerformance: Blazing fast Dimensity 9300 processor, handles anything.\n⚡ Charging: Super fast 80W charging, full in 30 minutes!\nDesign: Sleek, stylish, premium materials.\nCons:\n\n❌ Storage: No microSD card slot, limited storage options.\nBattery: Average, may need multiple charges per day\n\nThe Vivo X100 shines with exceptional cameras (ZEISS optics, gimbal ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Camera quality is Superb, Awesome Phone Vivo X100😍"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Totally awsm....👌👌👌"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Super camera mobile..."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Good camera quality"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Camera is best."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Good camera Vivo x100"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Amazing Camera, best Battery, excellent Display, would definitely recommend, better go for X100, minor difference in X100 nd X100 pro."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "One of the best device, camera quality is just like DSLR, Performance, battery are all good. Overall a very good package.\n\nloved it!!!"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Really awesome camera and performance. Meet the range"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Giving review after 1 week,\nMobile performance was awesome ,no words to say primary camera. Day and night pic is fabulous. You feel like taking from DSLR camera. Slightly disappointed with front camera.\nBattery back up okay, heavy use battery drain in 6 hours.but with 120v flash charger,26min battery getting ful.\nOverall mobile was too good."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Love this phone 💝🥰😍"
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Awesome camera and performance"
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "The phone is just awesome. But the battery doesnt last long. On heavy usage it will drain in 4-6 hrs. Except battery all other specs is great.\nCamera is superb and brilliant."
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Design and Camera is good but dimensity 9300 very powerful but not optimised for gaming"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Camera is just awesome.\nDesign looks Fantastic\nBattery back up is Ok(not so good)\nBut sound quality should have been better\nOverall perfect phone."
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "What a masterpiece it is, very much satisfied with it"
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "Only Cons is the battery drain fast even phone is in stand by.after software update issue not resolved till.Vivo mobiles should prefer snapdragon insted of mediatek."
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "Hi I like this mobile camera very much as we can take photos like DSLR and performance is also good. As of everything is good about this mobile."
    },
    {
      "User_Rating": "4",
      "Title": "Value-for-money",
      "Comment": "Portraite mode amezing 5/5\nAll over awesome phone\nNeed to improve Battery life and Optimisation 😊"
    },
    {
      "User_Rating": "3",
      "Title": "Nice",
      "Comment": "Mobile display and back camera performance and design is very good.\nBattery is ok. 1day max for normal usage.\nSelfie camera is just ok. Not as expected."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Camera is top notch in capturing picture, but video quality is very average.\nGaming is good but phone heats up easily within 10mins of pubg in 90fps.\nCharging speed is amazing but there is little draining issues.\nAnd yes it has bloatware.\nI haven't explore this device completely just a beginners review\nHope the video quality gets better with updates\nOverall rating - 7.5/10\nU can also go with s23ultra if u have 90k\nElse s24 isn't a bad choice .\nConclusion\nPros\nphotography and night photos are...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "At First i went to buy iPhone, but change decision, I ever Used this quality of Phone, normally I changed phone every Six months,\nTry to use this phone For Long time.\nCamera=5/5\nProcessor=5/5 Not Heating super Smooth.\nDisplay=5/5 but size some big\nSpeaker=5/5 loud and Bass\nCharger=Super fast\nBattery=4/5\nCompares to IPhone,OPPO And Bhai One plus.."
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Product is decent not excellent for the price. A 50k would have been great for the device. Camera is good but battery performance is average. Display is crisp but phone is quite big. Handing not possible with one hand. First time using FUNTOUCH OS and that too is not upto the mark. Vivo need to polish more. Not seen any heating issue due to cold weather. That can be evaluated only in summer season."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Update after 2 months of use.\n_-----------------------+-\n\nThe battery draining issue have been fixed with software update and one full charge 8 hours SOT now. But, the heating issues have not been fixed till now. The mobile is getting heat when you use camera for heavy photos or taking videos. This must be addressed in the next software update by Vivo.\n\nSuperb Mobile and this is my 1st curve mobile phone. Rear Camera is excellent esp low light conditions and zooms are simply great. Bat...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "X100 Suprbbbb phone"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Awesome phone with awesome photo quality"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Excellent Mobile 👌\nFirst of all thank you Flipkart for timely delivery👏\nIt took less time for data transfer and phone setup.🫶🏻\nThe funtouch OS is awesome 👍🏻. This mobile also has bloat- free and Clean UI.\nFace 🔓 and in display fingerprint scanner works smooth and fast 😚. Good animations are there for both the features.\nRear Cameras and Selfie camera both click superb pictures. It has an excellent camera features.\nStereo speakers 🔊 are good.\nMobile 📱 design is outstanding 😍. Lig...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Camera quality is like a dslr awesome, one off the best smartphone under this segment. If anyone plan to buy then go and buy without any doubt because it is the best under 65k."
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Superb.camra performance excellent.tottal very good mobile phone."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "All the things are the best...\nI would recommend this phone if you're looking under 60k to 70k..."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "DSLR camera"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Very very good"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Amazing picture, 😍"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "I must say, this product is awesome.\nI am in love with this damn thing.\nCamera, battery, performance everything is just class apart.\nI can proudly say buying this machine was a good decision."
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Using this brand from last 10yrs.. love the camera and the sound output quality... !!\nThis is my 4th vivo phone.. !\nPurchased in January review in 2 month time..\nPhone is flawless .."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "A superb phone with awesome camera and battery backup.I think It's cinematic video mode is better than I phone. Good job Vivo🥰"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Nice phone and camera zooming is the best"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Camera superb\nDisplay super\nMobile super\nSuper DSLR"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Superb camera..\nThe camera is just awesome the detail it captures.\nExtraordinary camera it has...\nDon't think too much just goo for it❣️💞"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Awesome camera"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "A quick review about vivo x 100: 1.Unbelievable camera quality just like DSLR.\n2. The ph looks amazing with nice finishing\n3. Excellent battery service also fast charging quality\n4, there is a different kind of peace in mind while using the ph as the ph runs smoothly\nThat's it ..... Only one thing that can make you bothered is round shape camera in the centre of the ph that can be little risky. But over all is good, portrait zooming is best quality nd night mood is awsome"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Awesome Smartphone......\nJust Looking like Wow 😲😳..."
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Camera is wow\nI also use iPhone but this phone camera is amazing"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Best camera. Good Battery back up. Fast charger.\nYou need to be careful with the curved glass. 😊"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "100x zoom pic of the moon. Absolutely fantastic product.. product wise no issues. Delivery agent delayed my excitement.. nothing problem other than that.."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Camera performance is best in this smart phone."
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Its the best all-rounder in this price point\nGo for it"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "This phone is awesome ..all things are good...this is the best phone in this prise"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Camera, battery, charging speed, display, gaming all perfect"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Awesome camera. Awesome gaming osm charging all are awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Excellent phone by Vivo Really Loved it..."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Amazing"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Awesome. Camera beast"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Excellent Phone, totally justifies it's price just was confused like Vivo 29 pro aura light and it is without aura light, but it can click good night photos"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Excellent phone camera is awesome speaker sound is average performance is very high you can go blindly"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Good phone with superb camera features"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Excellent camera in this segment but camera stability in zoom beyond 20x very poor,expected better performance in zoom , hope this problem will be solved with software upgrade.exoected better Battery optimisation but it's very average,hope in coming days with patch update battery optimisation will be more effective. V"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Awesome camera display performance all in one power pack dhamaka"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Premium flagship experience at it's best"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Ultimate camera phone this is not a phone this is camera and phone is fitted inside this camera."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Superb camera just looking like a waw"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "It's amazing... specially camera🔥🔥"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "The best phone you can buy in today's time."
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Camera quality superb...overall it's very good....many features available....nice experience"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Excellent Smartphone in this price segment"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific purchase",
      "Comment": "Great camera phone"
    },
    {
      "User_Rating": "4",
      "Title": "Wonderful",
      "Comment": "Superb camera.... 60x zoom...\nNight photo too good.."
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "The first thing I could talk about the x100 is the camera. It's the best in this budget, especially the different focal lengths in portrait mode and night shots. Performance is good but not the best, when you play games at 90fps or 120 fps, the device is getting a noticeable heat. Battery is definitely a plus for its performance, can last long easily a day or 1.5 days. Overall it's a good phone for the price."
    },
    {
      "User_Rating": "4",
      "Title": "Really Nice",
      "Comment": "Good one but somehow it seems like slightly overpriced.\nSafety, specifically Data Safety be always needed to be focused all around"
    },
    {
      "User_Rating": "4",
      "Title": "Delightful",
      "Comment": "Product quality no issue Range Value money 🤑 Brand camera decent 📸 overall look good 👍"
    },
    {
      "User_Rating": "2",
      "Title": "Moderate",
      "Comment": "I am writing this review after 3 months of usage.\nThe phone is over heating during video recording and gaming. It should not be expected to buy 66 thousand mobile phones. The front camera is not up to the mark. At least camera software should be fine tuned but vivo concentrated on the back camera and sells for high prices by showing the back camera and zess lens. I am doubtful about whether the vapor cooling chamber is provided or not, because it is not mentioned anywhere in the specification...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Mobile is Beyond expectations, camera is too good , smoothness is excellent, battery lasts for a day, must buy if you need an excellent camera in this segment, beats many premium segment phones in the camera department, kudos to Vivo ."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "The best camera phone in the world ... The batt drains in 12hr with regular use and within 7 hrs if used for gaming photography n video calling. Great camera and features tho . 120 watt charger charges 50 percent in about 12 mins.Happy with the pH overall but yes batt drain could hv been reduced"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "3 day usage review.\nI have upgraded from vivo X70 pro to X100. Being latest part of vivo x series I expected the camera would be super awesome, and I am not a bit disappointed. This is really upgraded to a next level.\n\nWith normal usage battery doesnt last a day but not a concern with a 120w rock which charges device in no time."
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Great photography and performance at this price .. overall great phone"
    },
    {
      "User_Rating": "3",
      "Title": "Just okay",
      "Comment": "Front camera is average quality"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Just Awesome must buy phone"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "1st purchase of Vivo phone with lot of doubts.. But it's a truly unbelievable performance. Camera beats all other premium phones in the segment.."
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Awesome camera like a mobile dslr\nExcellent performance on mtk9300\nGreat display"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Camera quality is very very good 👍\nHappy to buy❤️"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Camera 📸 Quality Best"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Best camera phone ever."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Excellent cameras in this segment"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Extraordinary camera and dimensity 9000 series outperforms each and every scenario"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "An excellent phone with beast performance, great camera, and out of the word battery life.\n\nA must have phone"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "First impressions are incredible altho please update your software first thing when you get this phone so that they allow you to adjust icons in the notification area and other features. But first impressions are just great based on the processor itself being so fast. Will probably edit the review after medium term use. But so far seems like a good decision. Although to be safer get another cover for the phone and a lens protector for the camera. This cover is basic and feels like it can slid...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "I love Vivo phone because this is best for camera phone and looks and design and I'm very comfortable to use this phone and also I'm Vivo phone addicted because I have 4 phone of Vivo brand"
    },
    {
      "User_Rating": "3",
      "Title": "Just okay",
      "Comment": "Camera quality not good"
    },
    {
      "User_Rating": "1",
      "Title": "Not recommended at all",
      "Comment": "After Six months of Usage it started heating extensively and Main Problem is network issue. Even beside Tower you won't get any signals. Very pathetic. Don't buy. Except Camera nothing worth. Rare Camera also only for pictures and not for video. Front Camera too worst"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "One of the best phone"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "Camera is very good"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Nice phone and nice work"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Excellent phone .. Everything is top notch"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Good, it's working perfectly"
    },
    {
      "User_Rating": "2",
      "Title": "Moderate",
      "Comment": "This is not camera phone. Don't buy gor camera purposes"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Perfect dslr"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Very nice photo to this phone"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Using from 3 days,there is no bugs,display was very nice, speakers are top notch,funtouch os 14 was extraordinary and haptic feedback was excellent, didn't expected this much qualities in this mobile,and finally CAMERA,it was phenomenal, actually I'm not so interested in camera,i bought this mobile because I want to use mediatek dimensity flagship processor,and it was superbb, honestly underrated processor just loved it,finally if you want to satisfy in each category just go through it,don't ...\nREAD MORE"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Awsm"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Amazing product with excellent cameras, performance top notch and good battery life... loved it..."
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Great Camera Phone 🔥"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Just lovet it.Go for it"
    },
    {
      "User_Rating": "5",
      "Title": "Brilliant",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "Supermoon camera option let you click clear pic of moon"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Over all nice"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Camera is excellent..."
    },
    {
      "User_Rating": "4",
      "Title": "Good choice",
      "Comment": "Good"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "alternate of s23 ultra love it"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Awesome 👍"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "This is my first Vivo phone bought by looking at many reviews of camera and it's wonderful 😊"
    },
    {
      "User_Rating": "4",
      "Title": "Good quality product",
      "Comment": "Good one happy customer"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "The allrounder smartphone of 2024 in this price range ."
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Very good"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Best camera centric phone"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Nice phone"
    },
    {
      "User_Rating": "1",
      "Title": "Terrible product",
      "Comment": "Mobile is getting over heated while using camera or talking video calls. And battery is draining to fast while using camera. Buying it for 58000 is not worth. Don't fall in trap of camera's. When mobile gets overheated you can't even hold it."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Highly recommended",
      "Comment": "Good mobile but battery performance is not upto the mark..."
    },
    {
      "User_Rating": "5",
      "Title": "Terrific",
      "Comment": "Overall a good mobile"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Just go for it"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "Very nice 👍"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Camera is superb . Processor is also updated and latest version."
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Awesome cemrera"
    },
    {
      "User_Rating": "4",
      "Title": "Worth the money",
      "Comment": "Excellent"
    },
    {
      "User_Rating": "5",
      "Title": "Mind-blowing purchase",
      "Comment": "Legendary camera. Met my expectations from all angles. Premium looks. And what a display! Only wireless charging is absent. Rest all top notch. A true flagship. Go for it."
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Good product but rat it very high"
    },
    {
      "User_Rating": "2",
      "Title": "Not good",
      "Comment": "Stabilization not good"
    },
    {
      "User_Rating": "5",
      "Title": "Super!",
      "Comment": "Nice picture"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Underrated phone. It's awesome 😎"
    },
    {
      "User_Rating": "5",
      "Title": "Wonderful",
      "Comment": "Nice"
    },
    {
      "User_Rating": "5",
      "Title": "Fabulous!",
      "Comment": "Excellent Product with Top notch performance"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "So far great phone with fantastic camera"
    },
    {
      "User_Rating": "5",
      "Title": "Excellent",
      "Comment": "good Vivo x 100 good cemra"
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Osm camera and specifications"
    },
    {
      "User_Rating": "5",
      "Title": "Best in the market!",
      "Comment": "Super camera ra Babu..worth warma worth"
    },
    {
      "User_Rating": "4",
      "Title": "Pretty good",
      "Comment": "Performance is good"
    },
    {
      "User_Rating": "5",
      "Title": "Worth every penny",
      "Comment": "One of the best and fantasting looking phone with no compromise everyone can go forr it especially who are photographers and love photography"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Nice phon"
    },
    {
      "User_Rating": "5",
      "Title": "Perfect product!",
      "Comment": "Just amazing phone... Not other phone can beat this in this price segment...."
    },
    {
      "User_Rating": "5",
      "Title": "Classy product",
      "Comment": "Satisfactory purchase 👍👌"
    },
    {
      "User_Rating": "5",
      "Title": "Simply awesome",
      "Comment": "Awesome phone with amezing camera and good bettery life but ui experience is not so good Vivo should improve their ui experience like premium phones Samsung and OnePlus"
    },
    {
      "User_Rating": "5",
      "Title": "Awesome",
      "Comment": "Supprb mobile i like the design,i love the camera ..one of best camera thats beat tha dslr camera .plz go for it buy"
    },
    {
      "User_Rating": "5",
      "Title": "Just wow!",
      "Comment": "One of the best phone in the history of mobile."
    },
    {
      "User_Rating": "5",
      "Title": "Must buy!",
      "Comment": "Camera awesome"
    },
    {
      "User_Rating": "5",
      "Title": "Great product",
      "Comment": "Awesome Camera"
    }
  ]
}